{
    "banded": "Parallel, uninterrupted, continuous linear segments.",
    "blotchy": "Uneven distribution, irregular spots or patches, inconsistent patterns.",
    "braided": "Interlaced strands forming a complex yet orderly pattern.",
    "bubbly": "Round, clustered patterns with varied sizes and elevations.",
    "bumpy": "Rough surface with irregular, raised patterns or protrusions.",
    "chequered": "Pattern composed of alternating squares in two different shades.",
    "cobwebbed": "Interlaced, intricate pattern resembling spider webs.",
    "cracked": "Network of fragmented lines with uneven surfaces.",
    "crosshatched": "Intersecting parallel lines creating a grid-like pattern.",
    "crystalline": "Reflects light sharply with defined, geometric, repeating patterns.",
    "dotted": "Consists of small, round points dispersed uniformly.",
    "fibrous": "Thread-like, tangled, interwoven strands forming a dense matrix.",
    "flecked": "Scattered small spots or streaks across the surface.",
    "freckled": "Small, scattered, uneven spots all over surface.",
    "frilly": "Decorative, delicate edges with a ruffled or pleated appearance.",
    "gauzy": "Thin, translucent, light-diffusing, lightly woven or knitted.",
    "grid": "Consistent, intersecting horizontal and vertical lines forming squares.",
    "grooved": "Longitudinal, consistently spaced, indented patterns.",
    "honeycombed": "Hexagonal patterns with depth, mimicking a beehive's structure.",
    "interlaced": "Interweaving lines forming recurrent alternating crossing pattern.",
    "knitted": "Interwoven yarn creating a patterned, textured and cozy look.",
    "lacelike": "Interwoven, delicate, intricate patterns with see-through gaps.",
    "lined": "Pattern characterized by long, narrow, parallel markings.",
    "marbled": "Irregular veins running through a smooth, glossy surface.",
    "matted": "Tangled, dense, closely compacted together, resembling a mat.",
    "meshed": "Interlaced, netlike patterns featuring interconnected lines or strands.",
    "paisley": "Swirling teardrop or kidney-shaped designs with intricate details.",
    "perforated": "Numerous small holes or punctures throughout the surface.",
    "pitted": "Characterized by small holes or depressions, uneven and rough surface.",
    "pleated": "Vertical, recurring folding or wrinkling patterns.",
    "polka-dotted": "Pattern with uniform, round spots evenly distributed.",
    "porous": "Full of tiny holes or spaces allowing air or liquids through.",
    "potholed": "Marked by uneven surfaces with numerous depressions or cavities.",
    "scaly": "Overlapping, rough, segmented surface akin to reptile skin.",
    "smeared": "Appears blurred, spread unevenly, often with streaked details.",
    "spiralled": "Circular patterns coiling outwards in a helical arrangement.",
    "sprinkled": "Filled with small, scattered dot-like elements uniformly distributed.",
    "stained": "Marked with smudged or discolored spots for a worn look.",
    "stratified": "Layered, varied thickness, visually segmented structure.",
    "striped": "Parallel, evenly spaced, thin or thick lines.",
    "studded": "Covered in small protruding points or knobs.",
    "swirly": "Circular patterns with wavy, twisting motions.",
    "veined": "Features networks of lines or streaks, similar to veins.",
    "waffled": "Grid-like pattern with raised bumps and indentations.",
    "woven": "Intersecting threads creating a distinct crisscross pattern.",
    "wrinkled": "Marked by irregular folds or surface risks.",
    "zigzagged": "Intersecting diagonal lines creating a repeated V or Z pattern."
}