{
    "707-320": "Twin-engined, cigar-shaped fuselage, swept wings with podded engines.",
    "727-200": "T-shaped tail, dual engines on rear body, single-aisle design.",
    "737-200": "Narrow-body, high-winged, twin-engined jet with cigar-shaped fuselage.",
    "737-300": "Short body, blunt nose, single aisle, low-wing design.",
    "737-400": "Short-haul airliner with twin engines, swept wings, and single aisle.",
    "737-500": "Short fuselage, low-set wings, twin rear-mounted engines.",
    "737-600": "Short-bodied, two-engine, low wing jet with pointed nose.",
    "737-700": "Shortened fuselage, tall landing gear, winglets on wing tips.",
    "737-800": "Short, narrow-body jetliner with distinctive dual winglets.",
    "737-900": "High-capacity, single-aisle, with twin-engine and distinctive flat tail cone.",
    "747-100": "Distinctive hump, four engines, two aisles, twin-aisle wide-body.",
    "747-200": "Upper deck hump, four engines, twin-aisle wide-body.",
    "747-300": "Upper deck lengthened, without winglets, engines mounted on wings.",
    "747-400": "Upper-deck hump, high-wing design, four engines, winglets attached.",
    "757-200": "Twin-engine, narrow-body, single-aisle jetliner with T-tail.",
    "757-300": "Long fuselage, twin-engine, single-aisle, sweeping wings.",
    "767-200": "Twin-engine, twin-aisle, pointy nose, and rear-mounted engines.",
    "767-300": "Twin-engined, extended-fuselage, winglets, and a dual-aisle cabin.",
    "767-400": "Extended fuselage, raked wingtips, no winglets.",
    "777-200": "Twin-engine, long fuselage, large swept-back wings.",
    "777-300": "Long body, large engines, raked wingtips, twin-aisle cabin.",
    "A300B4": "Twin-engine, wide-body design with high-set cantilever wing.",
    "A310": "Medium-body, dual-engine jet, unique wingtip fences, and high T-tail.",
    "A318": "Short fuselage, low-set wings, high-mounted engines, tall tail.",
    "A319": "Short, stubby body with high-mounted winglets, twin-engine rear setup.",
    "A320": "Twin-engine, single-aisle, high-wing, sharklet wingtips.",
    "A321": "Medium-sized, twin-engine, single-aisle, with large exit doors.",
    "A330-200": "Twin-engine, swept-wing design, bulbous nose, circular fuselage.",
    "A330-300": "Twin-engine, wide-body, with a characteristic bulbous nose.",
    "A340-200": "Four engines, twin-aisle cabin, sleek fuselage, high-wing configuration.",
    "A340-300": "Four engines, long fuselage, high-winged, wingtip fences.",
    "A340-500": "Four engines, long fuselage, twin-aisle cabin, high swept-back wings.",
    "A340-600": "Long fuselage, high-winged, four-engine jetliner with vertical stabilizer.",
    "A380": "Double-deck, four-engine jet with stunningly large size.",
    "ATR-42": "Twin-engine turboprop, high-wing configuration, circular fuselage design.",
    "ATR-72": "Twin-engine turboprop, high-wing, undercarriage wheels retractable.",
    "An-12": "High-wing, 4-turboprop, T-tail, twin-bubble cockpit.",
    "BAE 146-200": "High wing, four-engine jet, T-tail, short-bodied fuselage.",
    "BAE 146-300": "High-winged, T-tail, four underwing turbofan engines, short fuselage.",
    "BAE-125": "Swept-wing design, T-tail, twin rear fuselage-mounted engines.",
    "Beechcraft 1900": "Twin-engine, T-tail, high-wing, square-oval windows.",
    "Boeing 717": "Twin-engine, T-tail, rear-mounted engines, single-aisle cabin.",
    "C-130": "High-wing, four-turboprop engines, distinctive bulbous nose.",
    "C-47": "Dual engine, high-wing, tailwheel-equipped, round nose.",
    "CRJ-200": "T-tail, rear-mounted engines, narrow body, twinjet.",
    "CRJ-700": "CRJ-700 - Dual-engine, T-tail, distinctive long fuselage, circular windows.",
    "CRJ-900": "Twin-engine, T-tail, elongated fuselage, four-blade propellers.",
    "Cessna 172": "High-winged, single-engine, tricycle landing gear, four-seater aircraft.",
    "Cessna 208": "High-wing monoplane, fixed-tricycle gear, single-turboprop engine.",
    "Cessna 525": "Compact, twin-engine jet, T-tail, swept wings, circular cross-section fuselage.",
    "Cessna 560": "Twin-engine, low-wing, T-tail, straight-wing business jet.",
    "Challenger 600": "Long fuselage, low wings, T-tail, twin rear-mounted engines.",
    "DC-10": "Three-engine design, twin-aisle wide body, two under-wing and one tail engine.",
    "DC-3": "Twin-engine, low-wing, taildragger, tubular fuselage, rounded tail.",
    "DC-6": "Four-engined propeller-driven airliner with a fuselage nose cone.",
    "DC-8": "Four-engine jet, distinctive nose-down attitude during flight.",
    "DC-9-30": "Twin rear engines, T-tail, and narrow body fuselage.",
    "DH-82": "High-wing design, open cockpit, tandem seating, wooden structure.",
    "DHC-1": "High-wing monoplane, fixed conventional landing gear, dual control.",
    "DHC-6": "Twin-turboprop, high wing, fixed tricycle undercarriage, short takeoff/landing.",
    "DHC-8-100": "T-tail, twin-turboprop, rectangular windows, high-winged structure.",
    "DHC-8-300": "T-shaped tail, large spinning propellers, twin-engine turboprop.",
    "DR-400": "Low-winged, T-tail, tricycle undercarriage, single-engine aircraft.",
    "Dornier 328": "T-tail, turboprop engines, high wing, and a deluxe 3-aisle cabin.",
    "E-170": "Short fuselage, high-winged, twin-jet engines mounted at rear.",
    "E-190": "E-190: Dual engines, high-wing, streamlined fuselage, semi-circle tail.",
    "E-195": "Sleek wing design with large engines mounted below, T-shaped tail.",
    "EMB-120": "Twin-turboprop, T-tail, low-wing design, circular windows.",
    "ERJ 135": "Swept wings, T-tail, rear-mounted twin engines.",
    "ERJ 145": "T-tail, twin-engined, straight-winged, underwing-mounted engines.",
    "Embraer Legacy 600": "Mid-size, twin-engine, three-broadband winglet, sleek fuselage design.",
    "Eurofighter Typhoon": "Twin-engine, delta wing, canard-delta configuration, twin tail.",
    "F-16A/B": "Single-engine, swept wings, frameless bubble canopy, side-mounted control stick.",
    "F/A-18": "Twin-engine, twin-vertical-stabilizer, multirole combat jet.",
    "Falcon 2000": "Swept wings, dual engines, T-tail, elongated fuselage.",
    "Falcon 900": "Swept wings, three rear engines, large cabin windows.",
    "Fokker 100": "Twin-engine, T-tail, high-wing, slim fuselage, large front windows.",
    "Fokker 50": "Twin-engine, high-wing, T-tail, short-to-medium range turboprop.",
    "Fokker 70": "Twin-engine, T-tail, slim body, steep upward nose.",
    "Global Express": "Long range, twin-engined, low-wing design, T-tail configuration.",
    "Gulfstream IV": "Low-wing design, swept wings, T-tail, twin rear engines.",
    "Gulfstream V": "Twin-engine, low-wing, T-tail, oval windows, swept wings.",
    "Hawk T1": "Swept wings, twin engines, tandem seating, needle-nose front.",
    "Il-76": "Quad-engine, T-tail, dual-nose landing gear, cargo-capable.",
    "L-1011": "Tri-engine design with tail-mounted center engine.",
    "MD-11": "Trijet-configured rear, winglets, twin vertical tail fins.",
    "MD-80": "Twin rear engines, T-tail, narrow single-aisle design.",
    "MD-87": "T-tail, rear-mounted twin-engines, narrow fuselage, swept wings.",
    "MD-90": "Twin-engine, T-tail, rear-mounted engines, long body.",
    "Metroliner": "Twin-engine, low-wing, T-tail, elongated fuselage, round windows.",
    "Model B200": "Twin-turboprop, T-tail, straight wings, large oval windows.",
    "PA-28": "Low-wing, single-engine, tricycle landing gear, tapered wing tips.",
    "SR-20": "Low-wing, tricycle landing gear, spacious bubble canopy.",
    "Saab 2000": "Twin-engine turboprop, T-tail, high-wing, elongated fuselage.",
    "Saab 340": "High-wing and twin-turboprop with T-tail and pointed nose.",
    "Spitfire": "Elliptical wings, short body, large front-mounted propeller.",
    "Tornado": "Swept wings, twin-engine, fuselage with aerodynamic curves.",
    "Tu-134": "Swept wings, rear-mounted engines, glass nose cockpit.",
    "Tu-154": "Swept-back wings, trijet configuration, T-tail structure.",
    "Yak-42": "T-tail, trijet layout, rear-mounted engines."
}