{
    "apple pie": "Round pastry filled with layered, sliced apples and lattice crust.",
    "baby back ribs": "Small, curved bones with juicy meat attached.",
    "baklava": "Layered, diamond shape with visible fillings, often nuts.",
    "beef carpaccio": "Thinly sliced raw beef garnished with capers and arugula.",
    "beef tartare": "Raw, finely chopped meat with capers, onion, and egg yolk.",
    "beet salad": "Assortment of diced beets, mixed greens, and topped with cheese.",
    "beignets": "Dusted with powdered sugar, pillow-shaped deep-fried pastries.",
    "bibimbap": "Mixed ingredients served over rice in a bowl.",
    "bread pudding": "Soft cubed bread baked in a custard-like mixture.",
    "breakfast burrito": "Wrapped tortilla enclosing scrambled eggs and fillings.",
    "bruschetta": "Grilled bread topped with chopped tomatoes and garlic.",
    "caesar salad": "Romaine lettuce, croutons, and grated Parmesan cheese.",
    "cannoli": "Cylindrical, filled with sweet, creamy filling, flaky outer shell.",
    "caprese salad": "Layered slices of tomato and mozzarella, garnished with basil leaves.",
    "carrot cake": "Round, layered texture with visible shredded carrot pieces.",
    "ceviche": "Citrus-cured raw seafood often garnished with onions and cilantro.",
    "cheese plate": "Assortment of different cheeses on a platter, often with fruits.",
    "cheesecake": "Dense, round dessert with a crumbly biscuit base and creamy top.",
    "chicken curry": "Chunks of chicken immersed in spiced, creamy sauce.",
    "chicken quesadilla": "Folded tortilla filled with melted cheese and chicken pieces.",
    "chicken wings": "Flat and drumette sections, meaty, often smothered in sauce.",
    "chocolate cake": "Layered structure with glossy, creamy texture on top.",
    "chocolate mousse": "Smooth, airy texture with a rich, creamy peaks.",
    "churros": "Long, ridged, cylinder-shaped, often dusted with sugar.",
    "clam chowder": "Creamy soup with chunks of clams and diced potatoes.",
    "club sandwich": "Stacked layers of bread, meats, lettuce, often held by a toothpick.",
    "crab cakes": "Flat, round shape with a breaded exterior and flaky inside.",
    "creme brulee": "Caramelized sugar topping with a creamy custard base.",
    "croque madame": "Fried egg atop a ham and cheese sandwich.",
    "cup cakes": "Small, individually portioned cakes, often frosted.",
    "deviled eggs": "Hard-boiled eggs filled with creamy, often spiced yolk mixture.",
    "donuts": "Circular with a hole in the middle, often topped with glaze or icing.",
    "dumplings": "Small, filled, sealed pouch shape with pleated edges.",
    "edamame": "Bright green, plump pods with small, round beans inside.",
    "eggs benedict": "Poached eggs atop ham on an English muffin, draped in hollandaise.",
    "escargots": "Spiraled shell-shaped small, chewy bite-sized gastropods.",
    "falafel": "Round, deep-fried balls made from ground chickpeas or fava beans.",
    "filet mignon": "Small, thick, round cut of tenderloin steak.",
    "fish and chips": "Battered and fried fish served alongside thick cut fries.",
    "foie gras": "Smooth, firm texture with distinct lobe shapes.",
    "french fries": "Thin, elongated and fried potato strips.",
    "french onion soup": "Caramelized onions submerged in clear broth, topped with melted cheese.",
    "french toast": "Golden-browned, cut diagonally, soaked bread with crispy edges.",
    "fried calamari": "Rings or tentacles, breaded and deep-fried to a crisp.",
    "fried rice": "Grains mixed with veggies/meat, often in a pan.",
    "frozen yogurt": "Swirled, creamy texture in a bowl or cone.",
    "garlic bread": "Flat, oval-shaped with visible granules and light brown crust.",
    "gnocchi": "Small, pillow-shaped pasta with groove impressions.",
    "greek salad": "Diced vegetables and feta cheese, garnished with olives.",
    "grilled cheese sandwich": "Melted cheese oozing between two toasted bread slices.",
    "grilled salmon": "Grill marks on a tender, flaky fish texture.",
    "guacamole": "Creamy texture with visible chunks of avocado and tomato.",
    "gyoza": "Crescent-shaped, pleated edges with a smooth, filled side.",
    "hamburger": "Round, layered with bun, patty, lettuce, and toppings.",
    "hot and sour soup": "Thinly sliced ingredients in a tangy, slightly gelatinous broth.",
    "hot dog": "Cylindrical meat encased in a split, slightly smaller bun.",
    "huevos rancheros": "Fried eggs nestled on tortillas with tomato-chili sauce.",
    "hummus": "Smooth, creamy texture with sprinkled chickpeas and olive oil.",
    "ice cream": "Cone or bowl held, soft textured, often scoop-shaped dessert.",
    "lasagna": "Layered pasta sheets with fillings in between.",
    "lobster bisque": "Creamy texture with visible chunks of lobster.",
    "lobster roll sandwich": "Stuffed with chunky lobster meat in a split-top bun.",
    "macaroni and cheese": "Elbow-shaped pasta coated in creamy cheese sauce.",
    "macarons": "Small, round, smooth top with ruffled circumference (frilly foot).",
    "miso soup": "Clear broth with floating tofu and seaweed pieces.",
    "mussels": "Shell-covered, elongated oval shape, hinge-like opening.",
    "nachos": "Triangular tortilla chips layered with melted cheese.",
    "omelette": "Flat, round shape with slightly browned, fluffy texture.",
    "onion rings": "Circular, layered, deep-fried with a crunchy exterior.",
    "oysters": "Hard, rough outer shell with soft, slimy interior.",
    "pad thai": "Thin, flat rice noodles with shrimps, tofu, peanuts, and bean sprouts.",
    "paella": "Flat, wide pan with mixed rice and seafood/meat/vegetables.",
    "pancakes": "Round, flat, stackable with visible syrup absorption.",
    "panna cotta": "Smooth, creamy dessert set in a mold.",
    "peking duck": "Crispy skin wrapping juicy meat, often sliced in front of diners.",
    "pho": "Rice noodles in a steamy, aromatic, clear, seasoned broth.",
    "pizza": "Round shape with triangular slices and various toppings.",
    "pork chop": "Bone-in, square-shaped, with scoring across the surface.",
    "poutine": "Fries topped with cheese curds and covered in gravy.",
    "prime rib": "Bone-in, marbled texture, rectangular shape, served in thick slices.",
    "pulled pork sandwich": "Shredded meat stacked on bread with sauce dripping.",
    "ramen": "Long, thin noodles immersed in soup with various toppings.",
    "ravioli": "Small, square or round, pasta pillows with filled centers.",
    "red velvet cake": "Multi-layered, cream cheese frosted, crumb-coated cake.",
    "risotto": "Creamy, grainy texture with visible individual rice particles.",
    "samosa": "Triangular, stuffed, crisply fried pastry.",
    "sashimi": "Thinly sliced, raw seafood served without rice.",
    "scallops": "Round, fan-shaped shell with ridged texture.",
    "seaweed salad": "Thin, translucent, textured strands often served chilled.",
    "shrimp and grits": "Small, curled seafood atop coarsely ground, boiled cornmeal.",
    "spaghetti bolognese": "Thick, meaty sauce over long, twisted pasta.",
    "spaghetti carbonara": "Creamy texture with visible pieces of cooked pancetta.",
    "spring rolls": "Cylindrical, thin pastry wrapper filled, tightly sealed edges.",
    "steak": "Thick, juicy texture with visible grill marks.",
    "strawberry shortcake": "Layered biscuits, whipped cream, and fresh strawberry topping.",
    "sushi": "Rice wrapped around seafood, often in cylinder form.",
    "tacos": "Folded tortilla encapsulating various fillings.",
    "takoyaki": "Round-shaped with a piece of octopus inside, served with sauce.",
    "tiramisu": "Layered dessert with mascarpone cream and coffee-soaked ladyfingers.",
    "tuna tartare": "Diced raw tuna, often garnished with capers or onions on top.",
    "waffles": "Square grid pattern with deep indents."
}