{
    "tench": "Long, slender body with tiny scales, barbels near mouth.",
    "goldfish": "Small, rounded body, long flowing fins, prominent eyes.",
    "great white shark": "Large, conical snout; elongated body; sharp, triangular teeth.",
    "tiger shark": "Long, narrow, sharply pointed teeth; blunt, rounded snout.",
    "hammerhead shark": "Elongated flat head with eyes on the ends.",
    "electric ray": "Flat body, two large pectoral fins, prominent electrogenic organs.",
    "stingray": "Flat, diamond-shaped body with long, slender tail.",
    "rooster": "Crest, beak, feathers, two legs, wings, tail.",
    "hen": "Feathered body, beak, two-legged, lays eggs, has a comb.",
    "ostrich": "Long neck, long legs, large body, flightless bird.",
    "brambling": "Small size, triangular beak, robust bodies, long pointed wings.",
    "goldfinch": "Small size, conical beak, short forked tail.",
    "house finch": "Small-bodied, heavy beak, long notched tail.",
    "junco": "Small size, cone-shaped beak, short tail with white outer feathers.",
    "indigo bunting": "Small bird with conical beak and notched tail.",
    "American robin": "Medium-sized bird with rounded body, thin bill, and distinct red breast.",
    "bulbul": "Small size, pointed tail, slender curved beak.",
    "jay": "Crested head, stout body, short rounded wings, long tail.",
    "magpie": "Long tail, plump body, sharp beak, stout legs.",
    "chickadee": "Small body, short neck, large head, long tail.",
    "American dipper": "Small, chunky bird with short tail and robust bill.",
    "kite (bird of prey)": "Long, pointed wings, forked tail, and hooked beak.",
    "bald eagle": "Large hooked beak, featherless head, broad wings, sharp talons.",
    "vulture": "Long wingspan, bare head and neck, hooked beak.",
    "great grey owl": "Large rounded head, no ear tufts, yellow eyes, circular face.",
    "fire salamander": "Long body, short legs, ridged skin, prominent eyes, tapering tail.",
    "smooth newt": "Peppered skin, distinctive crest, paddle-like tail.",
    "newt": "Small-bodied, long tail, four legs, smooth skin, amphibious.",
    "spotted salamander": "Two rows of yellowish spots from head to tail.",
    "axolotl": "External gills, long tail with fin, four limbs with tiny digits.",
    "American bullfrog": "Large size, webbed feet, circular eardrums, prominent eyes.",
    "tree frog": "Small body, long legs, round toe pads, upward-facing eyes.",
    "tailed frog": "Small body, tail-like extension in males, claw-shaped toes.",
    "loggerhead sea turtle": "Large head, hard shell, paddle-like limbs, hooked beak-like mouth.",
    "leatherback sea turtle": "Large size, shell covered with leathery skin, teardrop-shaped body.",
    "mud turtle": "Small, domed shell with rough surface, webbed feet, and a short tail.",
    "terrapin": "Hard shell, webbed feet, beaky mouth, aquatic turtle.",
    "box turtle": "Dome-shaped shell, small size, stumpy legs, pointed beak.",
    "banded gecko": "Horizontal bands, wide head, slender body, sticky toe pads.",
    "green iguana": "Long body, dorsal crest, dewlap under neck, lengthy tail.",
    "Carolina anole": "Long, slim body with a pointed snout and long, slender tail.",
    "desert grassland whiptail lizard": "Long, slender body with a pointed snout and whip-like tail.",
    "agama": "Long body, triangular head, and prehensile tail.",
    "frilled-necked lizard": "Large frill around neck, elongated body, bipedal locomotion.",
    "alligator lizard": "Elongated body, rough scales, tapered tail, semi-aquatic.",
    "Gila monster": "Broad body, large head, bead-like scales, heavy tail.",
    "European green lizard": "Long body, large head, rough scales, thick limbs, robust tail.",
    "chameleon": "Covered in scales, elongated body, zygodactylous feet, protruding eyes.",
    "Komodo dragon": "Large, long, muscular body with rough, scaly skin and sharp claws.",
    "Nile crocodile": "Long, V-shaped snout with a significant number of sharp teeth.",
    "American alligator": "Large, broad snout with upward-facing nostrils, thick armored skin.",
    "triceratops": "Three-horned face, large frill, quadrupedal body, sharp beak.",
    "worm snake": "Long, slender body with smooth scales and pointed tail.",
    "ring-necked snake": "Small size, smooth scales, ring around neck.",
    "eastern hog-nosed snake": "Upturned snout, thick body, oval-shaped head.",
    "smooth green snake": "Slender body, smooth scales, round pupils, and long tail.",
    "kingsnake": "Patterned, cylindrical body; scales; non-venomous; constrictor.",
    "garter snake": "Long, slender body with horizontal stripes.",
    "water snake": "Long, slim body, scales, no legs, swims in water.",
    "vine snake": "Slim body, pointed head, horizontal pupils.",
    "night snake": "Slender body, smooth scales, vertical pupils, triangular head.",
    "boa constrictor": "Long-bodied, lacks limbs, large scales, distinctive head shape.",
    "African rock python": "Long, muscular body with irregular, blotchy patterns.",
    "Indian cobra": "Hooded head, elliptical pupils, fangs, scale patterns.",
    "green mamba": "Long, slender body with a coffin-shaped head.",
    "sea snake": "Elongated body, paddle-like tail, scales, lacks external ears.",
    "Saharan horned viper": "Horn-like scales above eyes, elongated body, triangular head.",
    "eastern diamondback rattlesnake": "Large body, diamond patterns, rattle at tail end.",
    "sidewinder rattlesnake": "Diamond-shaped pattern, thin tail with rattling segments.",
    "trilobite": "Three-lobed body, exoskeleton, many-segmented, paired appendages.",
    "harvestman": "Long, segmented body with eight elongated legs.",
    "scorpion": "Segmented body, pincer-like pedipalps, stinging tail.",
    "yellow garden spider": "Large, orb-shaped web, distinctive zigzag pattern in the center.",
    "barn spider": "Large abdomen, spindly legs, orb-shaped web.",
    "European garden spider": "Large orb webs, prominent cross-shaped markings, bulbous abdomen.",
    "southern black widow": "Hourglass-shaped mark on underbelly, shiny body, comb foot.",
    "tarantula": "Large body, two body parts, eight legs, hairy.",
    "wolf spider": "Eight eyes arranged in three rows, robust body, hairy legs.",
    "tick": "Eight-legged, small, oval-shaped body, sharp mouthparts.",
    "centipede": "Long, segmented body with numerous pairs of legs.",
    "black grouse": "Large feathered tail, round body, stout beak, prominent wattles.",
    "ptarmigan": "Small body, feathered feet, rounded wings, and a short tail.",
    "ruffed grouse": "Fan-shaped tail, crest on head, feather covered legs.",
    "prairie grouse": "Fan-shaped, pointed tail; feather-covered legs; rounded wings.",
    "peafowl": "Large fan-like tail, crested head, long neck.",
    "quail": "Small body, plump shape, short-tail, and distinctive 'top-knot' feather.",
    "partridge": "Short, rounded head with stubby beak and stout body.",
    "african grey parrot": "Medium-sized, strong curved beak, end rounded tail.",
    "macaw": "Large beak, long tail, feathered crest, prominent circle around eyes.",
    "sulphur-crested cockatoo": "Crested head, hooked beak, large wings, and prominent eyes.",
    "lorikeet": "Small size, slender body, pointed tail, curved beak.",
    "coucal": "Long tail, thick curved beak, strong legs.",
    "bee eater": "Long, slender beak; pointed, streamlined wings; forked tail.",
    "hornbill": "Large, downward-curving beak with prominent casque on top.",
    "hummingbird": "Small size, long thin beak, rapid wing movement.",
    "jacamar": "Long bill, slender body, pointed tail, bristled mouth edges.",
    "toucan": "Large beak, feathered body, short neck, perched posture.",
    "duck": "Flat bill, webbed feet, short neck, and a round body.",
    "red-breasted merganser": "Crested head, thin pointed bill, serrated edges, elongated body.",
    "goose": "Long neck, webbed feet, large body, bill shape.",
    "black swan": "Long neck, flat beak, webbed feet, large wings.",
    "tusker": "Large curved tusks, long trunk, heavy-set body.",
    "echidna": "Small body, spiny coat, elongated snout, stubby tail.",
    "platypus": "Duckbill, webs on feet, flat tail, body like otter.",
    "wallaby": "Small-sized marsupial, large hind legs, long tail, small head.",
    "koala": "Furry body, large round ears, spoon-shaped nose, pouch, tree-climbing claws.",
    "wombat": "Small, robust body; short legs; broad head; large, round nose.",
    "jellyfish": "Bell-shaped body with long, tentacle-like appendages.",
    "sea anemone": "Tentacle-surrounded mouth, cylindrical body, adhesive foot.",
    "brain coral": "Appearance simulates cerebral convolutions, hard surface.",
    "flatworm": "Elongated, soft body with bilateral symmetry, no limbs.",
    "nematode": "Cylindrical body, smooth skin, elongated and unsegmented.",
    "conch": "Spiral-shaped shell, pointed apex, large, round opening.",
    "snail": "Spiral shell, slimy body, antennae with eyes, slow movement.",
    "slug": "Elongated, slimy body without a shell.",
    "sea slug": "Elongated, soft bodies with tentacles, often lack a shell.",
    "chiton": "Eight-plate shell, elongated bodies, and tentacles around mouth.",
    "chambered nautilus": "Spiral shell, numerous interior chambers, tentacles, and a siphon.",
    "Dungeness crab": "Hard shell, two large claws, long thin legs, oval carapace.",
    "rock crab": "Hard shell, two large claws, round body shape, many legs.",
    "fiddler crab": "One large claw, small body, sideways movement.",
    "red king crab": "Large size, long spindly legs, two claws, hard spiky shell.",
    "American lobster": "Large clawed, long antennaed, segmented body.",
    "spiny lobster": "Long, spiny antennae; hard exoskeleton; segmented body.",
    "crayfish": "Ten-legged, exoskeleton, segmented body, two large pincers.",
    "hermit crab": "Hard, coiled shell carried on back; long, soft abdomen; claws.",
    "isopod": "Exoskeleton, segmented body, seven pairs of legs.",
    "white stork": "Long legs, pointy beak, large wings, featherless underbelly.",
    "black stork": "Long, pointed beak; extended slender legs; large, broad wings.",
    "spoonbill": "Long, flat, spoon-shaped bill; tall, wading bird stature.",
    "flamingo": "Long neck, stick-like legs, curved beak, feathered body.",
    "little blue heron": "Medium-size wader, long neck, sharp bill, pointed head, thin legs.",
    "great egret": "Large bird, long S-curved neck, dagger-like bill, black legs and feet.",
    "bittern bird": "Long neck, pointed beak, stout body, stalk-like legs.",
    "crane bird": "Long legs, broad wings, elongated beak, slim body.",
    "limpkin": "Long, curved bill; large wading bird; white underwing patches.",
    "common gallinule": "Long-legged, long-toed, waterbird with a chicken-like bill.",
    "American coot": "Webbed feet, plump body, pointed bill, bald frontal shield.",
    "bustard": "Large, terrestrial bird with long legs and strong build.",
    "ruddy turnstone": "Small bird, pointed wedge-shaped beak, round body, short legs.",
    "dunlin": "Small wading bird with long, slightly drooping bill and black legs.",
    "common redshank": "Long legs, straight bill, white rump and wingbar.",
    "dowitcher": "Long-billed, straight beak and slightly upward-curving posture.",
    "oystercatcher": "Long, strong beak, sleek body, and webbed feet.",
    "pelican": "Large beak with pouch, webbed feet, long wings.",
    "king penguin": "Large body, long beak, upright stance, prominent belly.",
    "albatross": "Long wingspan, webbed feet, hooked beak, slender body.",
    "grey whale": "Large bodied, bumpy skin, narrow tapered head, no dorsal fin.",
    "killer whale": "Large dorsal fin, smooth rounded head, elongated body.",
    "dugong": "Large, torpedo-shaped body with a forked tail and paddle-like flippers.",
    "sea lion": "Large flippers, external ear flaps, long whiskers, streamlined body.",
    "Chihuahua": "Small size, apple-shaped skull, large eyes, and erect ears.",
    "Japanese Chin": "Compact body, broad face, large round eyes, feathered ears.",
    "Maltese": "Small size, long silky hair, button eyes, black nose, dropped ears.",
    "Pekingese": "Long, thick coat; short legs; flat, squashed face.",
    "Shih Tzu": "Long silky hair, short muzzle, large dark eyes.",
    "King Charles Spaniel": "Compact body, long ears, flat skull, large, round eyes.",
    "Papillon": "Erect ears, feathered tail arching over body, fine-boned.",
    "toy terrier": "Small size, short coat, pointed ears, compact body.",
    "Rhodesian Ridgeback": "Distinctive ridge of hair running along its back.",
    "Afghan Hound": "Long, silky hair; thin build; distinctive curled tail.",
    "Basset Hound": "Long droopy ears, short legs, elongated body.",
    "Beagle": "Short-legged, long-eared, square-muzzled, medium-sized hound.",
    "Bloodhound": "Long ears, thin body, wrinkled skin, distinctive droopy eyes.",
    "Bluetick Coonhound": "Sleek, muscular body; thin, floppy ears; distinctive hound-like face.",
    "Black and Tan Coonhound": "Long ears, muscular build, and deep-chested body.",
    "Treeing Walker Coonhound": "Tall, slender, muscular body with long, floppy ears.",
    "English foxhound": "Long, straight legs, large eyes, and characteristic high-set ears.",
    "Redbone Coonhound": "Deep-chest, thin waist, long drooping ears, slender muscular legs.",
    "borzoi": "Long snout, slender body, silky wavy fur, extremely tall.",
    "Irish Wolfhound": "Large breed, shaggy coat, long limbs, deep chest, gentle expression.",
    "Italian Greyhound": "Small, slim body with long, slender legs, pointed muzzle.",
    "Whippet": "Slim body, deep chest, long legs, and pointed face.",
    "Ibizan Hound": "Tall, lean build with long ears and wedge-shaped head.",
    "Norwegian Elkhound": "Medium-sized, thick furry coat, curled tail, squared body shape.",
    "Otterhound": "Long, shaggy coat; large nose; webbed feet; drooping ears.",
    "Saluki": "Long slender body, pointed face, deep chest, long silky hair.",
    "Scottish Deerhound": "Large, tall size, wiry coat, elongated head, very deep chest.",
    "Weimaraner": "Short-coated, muscular, with distinctive amber or blue eyes.",
    "Staffordshire Bull Terrier": "Muscular build, short snout, wide face, prominent cheek muscles.",
    "American Staffordshire Terrier": "Muscular build, short coat, broad head, pronounced cheek muscles.",
    "Bedlington Terrier": "Curly, sheep-like coat; slender, athletic build; distinct pointed ears.",
    "Border Terrier": "Compact, otter-like head, dense double coat, narrow and deep body.",
    "Kerry Blue Terrier": "Soft, dense, wavy coat; Square frame; Long head with beard.",
    "Irish Terrier": "Wiry coat, long head, small dark eyes, V-shaped ears.",
    "Norfolk Terrier": "Small, wiry coat, expressive eyes, pricked ears, strong build.",
    "Norwich Terrier": "Small size, erect ears, wiry coat, expressive eyes, compact build.",
    "Yorkshire Terrier": "Small size, long silky coat, high-set V-shaped ears.",
    "Wire Fox Terrier": "Short-legged, dense coat, prominent eyes, erect ears, spiky tail.",
    "Lakeland Terrier": "Small-sized, wiry coat, rectangular muzzle, V-shaped ears.",
    "Sealyham Terrier": "Medium-sized, wire-coated, with broad head and long, rectangular body.",
    "Airedale Terrier": "Medium-sized, square build, dense wavy coat, long straight muzzle.",
    "Cairn Terrier": "Small-sized, shaggy-coated, fox-like face with erect ears.",
    "Australian Terrier": "Small, rough-coated, with erect ears and bushy eyebrows.",
    "Dandie Dinmont Terrier": "Long body, large eyes, silky hair on top, short legs.",
    "Boston Terrier": "Short muzzle, erect ears, square proportioned body.",
    "Miniature Schnauzer": "Small size, bushy eyebrows, and distinctive beard.",
    "Giant Schnauzer": "Large size, wiry coat, bushy eyebrows and distinct beard.",
    "Standard Schnauzer": "Medium-sized, pronounced eyebrows and beard, wiry coat.",
    "Scottish Terrier": "Short-legged, compact body, long head, wiry coat.",
    "Tibetan Terrier": "Medium-sized dog with abundant hair, large dark eyes and feathered tail.",
    "Australian Silky Terrier": "Short silky coat, compact body, erect ears, high set tail.",
    "Soft-coated Wheaten Terrier": "Long, silky coat; square build; deep chest; large, dark eyes.",
    "West Highland White Terrier": "Small, deep-set eyes; erect ears; double coat; sturdy build.",
    "Lhasa Apso": "Long, silky fur; small stature; prominent eyes; heavy facial hair.",
    "Flat-Coated Retriever": "Sleek coat, medium-sized, strong muscular build, long head.",
    "Curly-coated Retriever": "Tight, water-resistant curls; slender, athletic body.",
    "Golden Retriever": "Medium-sized, thick coat, friendly expression, strong and muscular.",
    "Labrador Retriever": "Medium-sized, strong build, broad head, short dense coat, otter-like tail.",
    "Chesapeake Bay Retriever": "Medium-sized, muscular body; broad skull; medium-length, thick coat.",
    "German Shorthaired Pointer": "Short-haired coat, muscular body, long muzzle, floppy ears.",
    "Vizsla": "Medium-size, lean, muscular body, and distinctive velvety soft ears.",
    "English Setter": "Long coat, feathered tail, speckled pattern, floppy ears.",
    "Irish Setter": "Long silky hair, droopy ears, slender body, feathered tail.",
    "Gordon Setter": "Long silky coat, feathered tail, statuesque body.",
    "Brittany dog": "Medium-sized body, dense coat, floppy ears, distinctive spaniel face.",
    "Clumber Spaniel": "Medium-sized, stocky, long ears, thick double coat, droopy eyes.",
    "English Springer Spaniel": "Medium size, long ears, wavy coat, compact body, friendly expression.",
    "Welsh Springer Spaniel": "Medium size, long furry ears, docked tail, compact body.",
    "Cocker Spaniel": "Medium-sized, long ears, wavy-coated, cheerful expression.",
    "Sussex Spaniel": "Medium-sized, long body, dense coat, large ears, and expressive eyes.",
    "Irish Water Spaniel": "Curly coat, rat-like tail, topknot on head.",
    "Kuvasz": "Large build, thick coat, almond-shaped eyes, robust and muscular framed.",
    "Schipperke": "Small size, fox-like facials, pointed ears, thick double coat.",
    "Groenendael dog": "Long-haired, erect ears, square build, bushy tail.",
    "Malinois": "Short-haired, square body, athletic build, erect ears.",
    "Briard": "Long-haired, large ears, bushy eyebrows and beard.",
    "Australian Kelpie": "Medium-sized, pricked ears, almond-shaped eyes, athletic body.",
    "Komondor": "Long, corded coat resembling dreadlocks.",
    "Old English Sheepdog": "Long, shaggy coat, large size, bushy tail, dog breed.",
    "Shetland Sheepdog": "Small size, long dense coat, deep-set eyes, bushy mane.",
    "collie": "Long snout, bushy tail, rough or smooth dense coat.",
    "Border Collie": "Medium size, long coat, distinctive crouch stance, intense gaze.",
    "Bouvier des Flandres dog": "Thick coat, heavy bone structure, strong muscular build, expressive eyes.",
    "Rottweiler": "Medium-large size, robust build, strong jaws, prominent eyebrows.",
    "German Shepherd Dog": "Large-sized, erect ears, bushy tail, strong muscular build.",
    "Dobermann": "Medium size, short coat, muscular build, cropped ears, docked tail.",
    "Miniature Pinscher": "Small size, high-set ears, short coat, distinctive prancing gait.",
    "Greater Swiss Mountain Dog": "Large size, muscular build, short coat, and triangular ears.",
    "Bernese Mountain Dog": "Large-sized, heavy-set, long-haired, tri-coloured, with a sweet-natured expression.",
    "Appenzeller Sennenhund": "Medium-sized, compact build, with almond-shaped eyes and triangular ears.",
    "Entlebucher Sennenhund": "Medium size, short coat, muscular build, symmetrical markings.",
    "Boxer": "Short hair, strong muscular build, standing on hind legs.",
    "Bullmastiff": "Large-frame, broad skull, high-set ears, short muzzle.",
    "Tibetan Mastiff": "Large-sized, heavy bone structure, mane-like coat, broad head.",
    "French Bulldog": "Compact body, bat-like ears, short snout, muscular physique.",
    "Great Dane": "Large size, deep chest, long and slender body, square head.",
    "St. Bernard": "Large size, broad chest, hefty build, long, dense coat.",
    "husky": "Medium-size, thick coat, erect triangular ears, blue or multicolored eyes.",
    "Alaskan Malamute": "Large size, heavy fur coat, wolf-like appearance, erect ears.",
    "Siberian Husky": "Medium-sized, thick coat, blue or multi-colored eyes, erect ears.",
    "Dalmatian": "Spotted coat, floppy ears, athletic and lean body.",
    "Affenpinscher": "Short-nosed, wiry textured coat, bushy eyebrows and mustache.",
    "Basenji": "Short-haired, wrinkled forehead, curled tail, erect ears.",
    "pug": "Short-muzzled face, curled tail, compact square body.",
    "Leonberger": "Large breed, lion-like mane, muscular build, kind expression.",
    "Newfoundland dog": "Large size, thick double coat, webbed feet, strong muscular build.",
    "Great Pyrenees dog": "Large size, thick double coat, broad and muscular frame.",
    "Samoyed": "Fluffy, thick coat; erect ears; strong, muscular build.",
    "Pomeranian": "Small size, fluffy double coat, fox-like face, compact posture.",
    "Chow Chow": "Large lion-like mane, broad muzzle, almond-shaped eyes.",
    "Keeshond": "Medium-sized, dense double coat, plumed tail, fox-like face.",
    "brussels griffon": "Small, compact body, large eyes, short nose, high-set ears.",
    "Pembroke Welsh Corgi": "Short stature, elongated body, large ears, docked tail.",
    "Cardigan Welsh Corgi": "Short-legged, long body, large ears, fox-like face.",
    "Toy Poodle": "Small, curly coat, floppy ears, playful, proportioned body.",
    "Miniature Poodle": "Curly coat, small size, square body proportions, long ears.",
    "Standard Poodle": "Curly, dense fur; elegant, slender stature; long, thin muzzle.",
    "Mexican hairless dog (xoloitzcuintli)": "Hairless, bat-like ears, almond-shaped eyes, sleek body.",
    "grey wolf": "Large-bodied, pointed ears, bushy tail, elongated snout.",
    "Alaskan tundra wolf": "Large body size, elongated snout, thick fur, high-set eyes.",
    "red wolf or maned wolf": "Long legs, upright ears, bushy mane, elongated snout.",
    "coyote": "Elongated snout, bushy tail, pointed ears, lean body.",
    "dingo": "Medium-sized, lean body, bushy tail, pointed ears, long snout.",
    "dhole": "Elongated body, bushy tail, rounded ears, slender muzzle.",
    "African wild dog": "Large ears, lean frame, long legs, bushy tail.",
    "hyena": "Spotted coat, strong jaws, sloping back, large ears.",
    "red fox": "Small size, pointed ears, bushy tail, sharp snout.",
    "kit fox": "Small size, large ears, slender body, bushy tail.",
    "Arctic fox": "Small size, bushy tail, rounded ears, short muzzle.",
    "grey fox": "Small size, pointed ears, bushy tail, elongated snout.",
    "tabby cat": "Striped coat, round head, medium-sized, muscular body.",
    "tiger cat": "Striped body, feline structure, sharp claws, agile, prominent whiskers.",
    "Persian cat": "Long silky fur, flat round face, large round eyes.",
    "Siamese cat": "Short hair, almond-shaped eyes, and thin muscular body.",
    "Egyptian Mau": "Short coat, large ears, muscular body, expressive gooseberry-green eyes.",
    "cougar": "Large body, strong limbs, small head, long tail.",
    "lynx": "Short-tufted ears, long facial whiskers, stout body with large paws.",
    "leopard": "Large body, rosette spots, powerful build, long tail.",
    "snow leopard": "Large rosette-covered body, thick furry tail, small ears.",
    "jaguar": "Large body, round head, powerful jaws, compact ears, muscular build.",
    "lion": "Large mane, sharp claws, muscular body, tufted tail.",
    "tiger": "Striped fur, large body, sharp teeth, long tail.",
    "cheetah": "Long, slim body; small head; large nostrils; black tear marks.",
    "brown bear": "Large body, heavy-set, humped shoulders, long claws.",
    "American black bear": "Medium-size, short-tailed, rounded ears, long, straight muzzle.",
    "polar bear": "Large body, long neck, small ears, thick fur, powerful limbs.",
    "sloth bear": "Long, shaggy fur; elongated snout; long, curved claws.",
    "mongoose": "Small-sized, elongated body, pointed snout, non-retractile claws.",
    "meerkat": "Small body size, long, thin tail, prominent ears, upright stance.",
    "tiger beetle": "Elongated, slender body; large, bulging eyes; prominent mandibles.",
    "ladybug": "Dome-shaped body, small head, six legs, two wing cases.",
    "ground beetle": "Hard-shelled body, six legs, elongated head, large mandibles.",
    "longhorn beetle": "Long, slender body with long antennae, typically longer than body.",
    "leaf beetle": "Small, oval body with hardened, leaf-shaped wings.",
    "dung beetle": "Round body, six legs, long antennae, rolls dung into balls.",
    "rhinoceros beetle": "Large, horn-like protrusions on head, thick exoskeleton, robust body shape.",
    "weevil": "Elongated snout, boll-shaped body, antennae bent at 90 degrees.",
    "fly": "Two wings, compound eyes, six legs, elongated body.",
    "bee": "Striped body, antennae, wings, stinger, six legs.",
    "ant": "Six legs, two antennae, segmented body with a prominent abdomen.",
    "grasshopper": "Long hind legs, short antennae, body shaped for jumping.",
    "cricket insect": "Long antennae, hind legs specialized for jumping, flat body.",
    "stick insect": "Long, slender body mimicking a stick, leaf-like wings.",
    "cockroach": "Long antennae, flat oval body, six long legs, two pairs of wings.",
    "praying mantis": "Elongated body, triangular head, bulbous eyes, raptorial forelegs.",
    "cicada": "Large, transparent wings; elongated body; prominent compound eyes.",
    "leafhopper": "Winged, elongated body, hind legs for jumping.",
    "lacewing": "Long, delicate wings; large, prominent antennae.",
    "dragonfly": "Long body, two pairs of strong transparent wings, large eyes.",
    "damselfly": "Long, slender body; two pairs of similar-sized wings; large eyes.",
    "red admiral butterfly": "Large size, banded wings, unique scalloped edges.",
    "ringlet butterfly": "Wings shaped with rounded edges, tailed hindwings, patterned symmetry.",
    "monarch butterfly": "Patterned wings with veining, body with antennae and slender abdomen.",
    "small white butterfly": "Small-sized, delicate wings, often seen fluttering near flowers.",
    "sulphur butterfly": "Veined wings, small-to-medium size, clubbed antennae.",
    "gossamer-winged butterfly": "Delicate, thin wings with distinctive veining patterns.",
    "starfish": "Five arms radiating from a central disc, rough texture, ambulacral grooves.",
    "sea urchin": "Round body covered with long, sharp spines.",
    "sea cucumber": "Leathery skin, sausage shape, spiky or warty texture.",
    "cottontail rabbit": "Short fluffy tail, long ears, compact body, hind legs longer than front.",
    "hare": "Long ears, lean body, powerful hind legs.",
    "Angora rabbit": "Long, fluffy fur and large, upright ears.",
    "hamster": "Small, round body; short tail; large cheek pouches; whiskered face.",
    "porcupine": "Spiky quills, small paws, round body, sharp snout.",
    "fox squirrel": "Large size, bushy tail, sturdy body, sharp claws.",
    "marmot": "Short ears, large front teeth, chunky body, fur-covered tail.",
    "beaver": "Flat tail, long front teeth, small eyes, webbed hind feet.",
    "guinea pig": "Small body, large ears, short legs, round nose, dense furry coat.",
    "common sorrel horse": "Long face, muscular body, distinct arched neck, high withers.",
    "zebra": "Striped pattern, equine body, erect mane, tail tuft.",
    "pig": "Short snout, large ears, round body, curly tail.",
    "wild boar": "Long snout, tusks, coarse bristly fur, stocky and compact body.",
    "warthog": "Large head, tusks, warty facial protrusions, tough sparse hair.",
    "hippopotamus": "Large body, massive jaws, short legs, long tail, barrel-shaped torso.",
    "ox": "Large body, horned head, hoofed legs, prominent hump.",
    "water buffalo": "Large body, curved horns, aquatic habit, heavy build.",
    "bison": "Large hump, long shaggy hair, sharp horns, short tail.",
    "ram (adult male sheep)": "Curved heavyweight horns, robust build, unsplit hooves, woolly coat.",
    "bighorn sheep": "Curved, large horns; muscular bodies; sheep-like faces.",
    "Alpine ibex": "Curved, back-facing horns; muscular body; cloven hooves.",
    "hartebeest": "Long, narrow face; sharply-pointed, backward-curving horns; muscular, elongated body.",
    "impala (antelope)": "Slim body, long legs, lyre-shaped horns, high rear hump.",
    "gazelle": "Long slender legs, small heads, large eyes, and pointed horns.",
    "arabian camel": "Long curved neck, single large hump, long legs, elongated snout.",
    "llama": "Long neck, large ears, curved inward bottom teeth, woolly coat.",
    "weasel": "Slender body, long tail, short legs, sharp teeth.",
    "mink": "Small body size, dense fur, webbed feet, slender and elongated body.",
    "European polecat": "Long body, short legs, pointed snout, bushy tail.",
    "black-footed ferret": "Long, slim body with a short tail, large ears, rounded head.",
    "otter": "Webbed feet, dense fur, elongated body, small rounded ears",
    "skunk": "Small mammal, bushy tail, white stripes on back.",
    "badger": "Small body, short legs, long bushy tail, distinctive facial stripes.",
    "armadillo": "Hard bony plates, small head, long claws, and tiny eyes.",
    "three-toed sloth": "Three long claws on each limb, slow movement, tree-dwelling.",
    "orangutan": "Large, strong arms; broad chest; facial flange in mature males.",
    "gorilla": "Large, muscular body; broad chest; flat nose; prominent brow ridge.",
    "chimpanzee": "Opposable big toes, protruding lips, long arms, hair-covered body.",
    "gibbon": "Long arms, small body, no tail, humanoid face.",
    "siamang": "Long, elastic, throat-pouch; long, slender arms; hair body covering.",
    "guenon": "Long limbs, short tail, and sharp snout.",
    "patas monkey": "Long white mustache, tail longer than body, cheek pouches.",
    "baboon": "Large snout-like nose, big ears, heavy-bodied, long non-prehensile tail.",
    "macaque": "Long tail, prominent cheek pouches, fur-covered body.",
    "langur": "Long, thin tail; prominent brow ridge; compact body.",
    "black-and-white colobus": "Long cape-like fur and bushy tail, face surrounded by white hair.",
    "proboscis monkey": "Large nose, potbelly, webbed feet, long tail, prominent forehead.",
    "marmoset": "Small size, petite rounded ears, long tail, primate facial structure.",
    "white-headed capuchin": "Crested forehead, prehensile tail, small body size.",
    "howler monkey": "Large size, long tail, thick fur, noticeable vocal box.",
    "titi monkey": "Small size, long, white, bushy tail, and facemask-like markings.",
    "Geoffroy's spider monkey": "Long limbs, prehensile tail used as fifth hand.",
    "common squirrel monkey": "Small size, dense fur, large ears, long mobile tail",
    "ring-tailed lemur": "Long, striped tail; expressive face; large eyes; primate body.",
    "indri": "Short legs, dense fur, long snout, large eyes, lemur species.",
    "Asian elephant": "Large body, long trunk, smaller ears, two protruding tusks.",
    "African bush elephant": "Large ears, long curved tusks, and thick, wrinkled skin.",
    "red panda": "Small body, round face, long bushy tail, pointed ears.",
    "giant panda": "Large, round head with prominent ear patches, thick-fur-covered body.",
    "snoek fish": "Elongated body, pointed head, forked tail, full-length lateral line.",
    "eel": "Long, thin body, snake-like appearance, small sharp teeth.",
    "silver salmon": "Streamlined body, small scales, forked tail, soft-rayed dorsal fin.",
    "rock beauty fish": "Elongated body, scale-less skin, roundish tail, long dorsal fin.",
    "clownfish": "Striped pattern, paddle-like pectoral fins, oval-shaped body.",
    "sturgeon": "Elongated body, pointed snout, barbels near mouth, rows of bony plates.",
    "gar fish": "Long, slender body with elongated, beak-like jaws full of sharp teeth.",
    "lionfish": "Striped body, large fan-like pectoral fins, spiky venomous dorsal fins.",
    "pufferfish": "Inflatable body, prominent prickly spines, small fins and eyes.",
    "abacus": "Beaded strings on a rectangular frame, sliding mechanism.",
    "abaya": "Loose, full-length, flowing robe with long sleeves.",
    "academic gown": "Long, flowing robe, wide sleeves, worn for academic ceremonies.",
    "accordion": "Bellows-like structure, buttoned/keyboard sides, hand-held with straps.",
    "acoustic guitar": "Hollow body, six strings, long fretted neck, rounded sound hole.",
    "aircraft carrier": "Large flat-top structure, prominent control tower, runway for take-offs/landings.",
    "airliner": "Large wings, jet engines, elongated body with tail fin.",
    "airship": "Long, blimp-like body; propellers; gondola cabin beneath.",
    "altar": "Raised platform, religious symbols, candles or incense, ceremonial use.",
    "ambulance": "Rectangular shape, flashing lights on top, emergency medical symbol.",
    "amphibious vehicle": "Designed for land and water travel, with wheels and propellers.",
    "analog clock": "Circular face, numerical hours, moving hands (hour, minute, second).",
    "apiary": "Rectangular wooden structures, rows of hive boxes, flying bees.",
    "apron": "Tied waist, front covering, often comes with pockets.",
    "trash can": "Cylindrical or rectangular shape, hinged lid, often foot-operated.",
    "assault rifle": "Long barrel, detachable magazines, select-fire options.",
    "backpack": "Straps, zippers, compartments, typically rectangle shape.",
    "bakery": "Bread displays, cake stands, pastry cases, oven, dough mixer.",
    "balance beam": "Long, narrow horizontal beam raised from ground.",
    "balloon": "Round, inflated shape with attached narrow mouthpiece.",
    "ballpoint pen": "Cylindrical body, pointed tip, retractable or cap-protected.",
    "Band-Aid": "Adhesive strip, pad in center, flexible, typically rectangular.",
    "banjo": "Round body, long neck, fretted fingerboard, strings with tuners.",
    "baluster / handrail": "Vertical supports, curved or straight top, attached to steps.",
    "barbell": "Long straight rod with weighted disks at both ends.",
    "barber chair": "Classic design, high backrest, adjustable height, attached footrest, swivel function.",
    "barbershop": "Striped pole, leather chairs, mirrors, barber tools.",
    "barn": "Large structure, slanted roof, prominent double doors, typically rural.",
    "barometer": "Circular dial face, needle indicator, atmospheric pressure markings.",
    "barrel": "Cylindrical shape, flat top and bottom, metal or wooden bands.",
    "wheelbarrow": "Single wheel at front, two supporting legs, two handles at back.",
    "baseball": "Round, stitched seams, smaller than a softball, hand-held size.",
    "basketball": "Round shape, distinct grooves, inflated, used for dribbling/shooting.",
    "bassinet": "Small, enclosed, portable sleeping area for infants.",
    "bassoon": "Long, slender wooden body with curved, metal bell and numerous keys.",
    "swimming cap": "Tight fit, covers hair, rubberized material, streamlined shape.",
    "bath towel": "Rectangular shape, high absorbency, terry cloth material.",
    "bathtub": "Oval or rectangular shape, faucet, drain plug, deep basin.",
    "station wagon": "Longer body, spacious rear cargo area, hinged rear tailgate.",
    "lighthouse": "Tall structure, rotating light on top, cylindrical or conical shape.",
    "beaker": "Cylindrical shape, graduated markings, spout for pouring.",
    "military hat (bearskin or shako)": "Tall, cylindrical shape with a flat top, often with a plume or badge.",
    "beer bottle": "Cylindrical shape, narrow neck, cap on top, glass material.",
    "beer glass": "Tall, cylindrical shape, sometimes tapered, with a handle.",
    "bell tower": "Tall structure, often polygonal, housing bells, pointed roofs.",
    "baby bib": "Small, neckband, usually square or round, front coverage.",
    "tandem bicycle": "Two seats, two sets of pedals, single frame, double handlebars.",
    "bikini": "Two-piece, exposes midriff, skimpy top, and bottom coverage.",
    "ring binder": "Round metal rings, hard cover, opens/closes for inserting paper.",
    "binoculars": "Two connected telescopic tubes, adjustable focus wheel, neck strap.",
    "birdhouse": "Small, box-shaped, entry hole, perch, often elevated.",
    "boathouse": "Structure over water, typically docks or storage for boats.",
    "bobsleigh": "Sleek, tandem seating, metal runners, steering ropes, aerodynamic shape.",
    "bolo tie": "Central pendant, cord/string neckpiece, metal clasp/tips.",
    "poke bonnet": "Large brim, tied under chin, protrudes out in cone shape.",
    "bookcase": "Shelves, rectangular shape, vertical standing, used for book storage.",
    "bookstore": "Shelves of books, reading areas, cashier desk, book display stands.",
    "bottle cap": "Round, flat top, ridged edges, small, fits on bottle neck.",
    "hunting bow": "Curved structure, string attachment, narrow grip, arrow rest.",
    "bow tie": "Tied in a knot with two symmetrical loops and two trailing ends.",
    "brass memorial plaque": "Engraved lettering, metallic surface, commemorative inscription.",
    "bra": "Two cups connected by a band, adjustable straps over shoulders.",
    "breakwater": "Solid structure extended into water for wave disruption.",
    "breastplate": "Chest covering armor, often rigid and slightly contoured.",
    "broom": "Long handle, bristled bottom, used for sweeping.",
    "bucket": "Cylindrical shape, handle at top, open top with wide opening.",
    "buckle": "Metallic, rectangular or circular, consists of prong and frame.",
    "bulletproof vest": "Thick, heavy, protective front/back panels, adjustable straps.",
    "high-speed train": "Streamlined body, pantograph, multiple articulated carriages.",
    "butcher shop": "Meat cuts display, Butcher's tools, Refrigerated display case.",
    "taxicab": "Checkered pattern, rooftop light, rear car number, meter device.",
    "cauldron": "Round bottom, wide open top, handle on each side.",
    "candle": "Cylindrical shape, melting wax, attached wick, flame when lit.",
    "cannon": "Long cylindrical barrel, large rear base, mounted on wheels.",
    "canoe": "Long, narrow body with pointed ends, open top, typically seats inside.",
    "can opener": "Metal construction, rotating handle, sharp cutting wheel.",
    "cardigan": "Front opening, typically buttoned, long-sleeved knitwear.",
    "car mirror": "Reflective surface, adjustable angle, mounted outside car door.",
    "carousel": "Rotating platform with seats, often mimicking animals or vehicles.",
    "tool kit": "Variety of handheld devices, housed in a box, for specific tasks.",
    "cardboard box / carton": "Rectangular shape, four flat sides, flaps for closing/opening.",
    "car wheel": "Round, rubber object with metal rim, central axis for attachment.",
    "automated teller machine": "Rectangular shape, numeric keypad, cash dispenser slot.",
    "cassette": "Rectangular body, two spool hubs, central playback hole.",
    "cassette player": "Rectangular shape, buttons, tape deck, speaker grills, headphone jack.",
    "castle": "Turrets, drawbridge, fortified walls, moat, high towers.",
    "catamaran": "Twin hulls connected by a deck, no keel, thin central structure.",
    "CD player": "Compact design, buttons, disc slot, digital screen, portable size.",
    "cello": "Large, hollow wooden body, F-shaped sound holes, four strings.",
    "mobile phone": "Rectangular, thin, touchscreen, physical buttons (volume, power).",
    "chain": "Interconnected metal links forming a continuous line or strip.",
    "chain-link fence": "Interconnected metal wires forming diamond pattern.",
    "chain mail": "Interlocked metal rings forming a flexible armor.",
    "chainsaw": "Long handle, serrated metal cutting chain, mechanical motor body.",
    "storage chest": "Rectangular, sturdy structure with lid, often has handles, lockable.",
    "chiffonier": "Tall, slim structure with multiple drawers, often with elegant handles.",
    "bell or wind chime": "Cylindrical shape, clapper inside, hanging string, creates sound.",
    "china cabinet": "Glass doors, shelves inside, tall structure, decorative woodwork.",
    "Christmas stocking": "Long sock shape, fluffy cuff, hangable loop, often decorated.",
    "church": "Steeples, cross symbols, large entry doors, stained glass windows.",
    "movie theater": "Large screen, rows of seats, projector, concession stand.",
    "cleaver": "Broad, heavy blade; short handle; straight cutting edge.",
    "cliff dwelling": "Houses built into cliffs, visible natural rock backdrop.",
    "cloak": "Long, loose garment, typically hooded, worn over regular clothing.",
    "clogs": "Slip-on design, wooden soles, rounded toe, optional heel strap.",
    "cocktail shaker": "Cylindrical shape, lid with strainer, tight seal cap.",
    "coffee mug": "Cylindrical shape, handle on side, flat bottom, open top.",
    "coffeemaker": "Carafe, power switch, water reservoir, filter basket, warming plate.",
    "spiral or coil": "Curved structure with continuous winding or looping pattern.",
    "combination lock": "Rotary dial, numbered interface, compact cylindrical shape.",
    "computer keyboard": "Rectangular, keys layout, alphanumeric symbols, function buttons.",
    "candy store": "Shelves of sweets, candy jars, lollipop displays, checkout counter.",
    "container ship": "Large hull, stacked shipping containers, long flat deck.",
    "convertible": "Retractable roof, two doors, sleek design.",
    "corkscrew": "Spiral metal rod, handle at top, pointed end.",
    "cornet": "Conical shape, three piston valves, small, flared bell end.",
    "cowboy boot": "High shaft, angled heel, pointed toe, elaborate stitching.",
    "cowboy hat": "Wide brim, high crowned, often with a buckled band.",
    "cradle": "Curved base, high sides, often with a hood, for rocking babies.",
    "construction crane": "Tall structure, long horizontal jib, cabin at top, metal wires.",
    "crash helmet": "Hard shell, full-head coverage, chin strap, visor.",
    "crate": "Rectangular, rigid structure, slated or meshed walls, often made of wood.",
    "infant bed": "Small size, protective railings, often has a rocking feature.",
    "Crock Pot": "Round shape, lid on top, side handles, front control panel.",
    "croquet ball": "Hard, spherical, used in croquet game, unique size.",
    "crutch": "Long stick, arm-support with handle, padded rest under shoulder.",
    "cuirass": "Armor-type chest protection, often metallic, with contoured, fitted design.",
    "dam": "Large structure, controls water flow, often built across rivers.",
    "desk": "Flat surface, four legs, often contains drawers.",
    "desktop computer": "Monitor, keyboard, mouse, rectangular tower, various ports.",
    "rotary dial telephone": "Circular number dial, corded handset, no screen or buttons.",
    "diaper": "Rectangular shape, adjustable tabs, padded absorbent center.",
    "digital clock": "Numerical display, hour, minute, second indicators, rectangular shape.",
    "digital watch": "Digital display, wrist strap, buttons for settings.",
    "dining table": "Rectangular or round surface, multiple legs, flat and sturdy.",
    "dishcloth": "Rectangular, thin, woven texture, absorbent material.",
    "dishwasher": "Rectangular shape, control panel, interior racks, door with handle.",
    "disc brake": "Circular metal rotor, caliper with brake pads, mounting on wheel hub.",
    "dock": "Water adjacent structure, flat platform with potential connecting walkway.",
    "dog sled": "Harnessed dogs pulling a sled with a person riding.",
    "dome": "Curved, hemispherical, architectural structure.",
    "doormat": "Rectangular shape, textured surface, often with welcoming text.",
    "drilling rig": "Tall structure, rotating machinery, thick drilling pipes, platform base.",
    "drum": "Cylindrical shape, top and bottom surfaces, typically with sticks.",
    "drumstick": "Cylindrical shape, tapered end, typically made of wood.",
    "dumbbell": "Two weighted ends connected by a short bar.",
    "Dutch oven": "Heavy, lidded, cast-iron pot, with thick walls and flat bottom.",
    "electric fan": "Circular blades, protective cage, rotating head, pedestal/base.",
    "electric guitar": "Solid body, elongated neck, six steel strings, pickup selectors.",
    "electric locomotive": "Long body, large wheels, overhead electric wires, front cabin.",
    "entertainment center": "Multiple shelves, screen space, cabinet doors, compact design",
    "envelope": "Rectangular, flap closure, thin flat paper container.",
    "espresso machine": "Metallic body, large handle, spout for coffee output, control knobs.",
    "face powder": "Compact casing, flat product surface, often comes with applicator.",
    "feather boa": "Long, fluffy, lightweight, wrapped around neck.",
    "filing cabinet": "Vertical, multiple drawers, metal or wooden, rectangular, with handles.",
    "fireboat": "Water cannons, hull design, large deck, maritime equipment.",
    "fire truck": "Large ladder, water hoses, flashing lights, extended cab.",
    "fire screen": "Mesh panel design, incorporated handles, freestanding structure.",
    "flagpole": "Vertical structure, typically tall, with a mounted flag.",
    "flute": "Long, cylindrical body with holes and side-blown mouthpiece.",
    "folding chair": "Collapsible frame, portable, seat and backrest.",
    "football helmet": "Hard shell, facemask, interior padding, chinstrap, ear holes.",
    "forklift": "Compact vehicle, elevated fork, large back wheel, long-lasting batteries.",
    "fountain": "Water stream, sculptural structure, basin or pool at base.",
    "fountain pen": "Narrow, elongated shape with nib and ink reservoir.",
    "four-poster bed": "Four tall posts at each corner supporting a canopy.",
    "freight car": "Large, rectangular structure, on rail tracks, designed for cargo transport.",
    "French horn": "Large bell, multiple rotary valves, coiled circular shape.",
    "frying pan": "Round, flat bottom with high sloping sides and a long handle.",
    "fur coat": "Thick, fluffy, luxurious texture, typically long and layered.",
    "garbage truck": "Large vehicle, rear compacting unit, wide back opening for waste.",
    "gas mask or respirator": "Covering for nose and mouth, connected filters or air-purifying elements.",
    "gas pump": "Rectangular shape, hose, digital screen, keypad, fuel selector.",
    "goblet": "Tall stem, wide bowl, often fluted base.",
    "go-kart": "Small, open, four-wheeled vehicle with single seat and steering wheel.",
    "golf ball": "Small, round, hard, dimpled surface.",
    "golf cart": "Small, four wheels, open design, golf bag holder.",
    "gondola": "Long, flat-bottomed boat with high curved ends, single oar propelling.",
    "gong": "Round, flat surface with cylindrical body, rimmed edge, suspended.",
    "gown": "Long, flowing, usually floor length, often formal wear.",
    "grand piano": "Large, wing-shaped body, 88 keys, long strings inside.",
    "greenhouse": "Transparent structure, typically rectangular, with plants inside.",
    "radiator grille": "Metallic grid pattern, rectangular shape, front of vehicle placement.",
    "grocery store": "Shelves full of various products, shopping baskets/carts, product price tags.",
    "guillotine": "Blade attached to frame, operated by rope or handle mechanism.",
    "hair clip": "Slim, metal or plastic, hinge mechanism, used for securing hair.",
    "hair spray": "Aerosol can shape, nozzle top, labeled for hair use.",
    "half-track": "Tracks at rear, regular wheels at front, partially armored.",
    "hammer": "Long handle, heavy metal head, flat end, claw-like opposite end.",
    "hamper": "Rectangular or round, handled, lidded, woven or mesh design",
    "hair dryer": "Compact shape, switch buttons, cord, air vent, handle.",
    "hand-held computer": "Portable size, touchscreen interface, physical buttons, compact design.",
    "handkerchief": "Square or rectangular shape, thin fabric, folded edges.",
    "hard disk drive": "Rectangular shape, multiple ports, circular metal disk inside.",
    "harmonica": "Small rectangular shape, multiple air holes, handheld music instrument.",
    "harp": "Vertical, angular frame with multiple taut strings.",
    "combine harvester": "Large cutting bar front, grain chute, rotating threshing drum.",
    "hatchet": "Short handle, sharp blade tapering to a point.",
    "holster": "Designed to carry a handheld device, typically attached to a belt.",
    "home theater": "Large screen, surround sound speakers, theatre seating, projector.",
    "honeycomb": "Hexagonal cells pattern, connected together.",
    "hook": "Curved or angled end, typically sharp, used for catching or hanging.",
    "hoop skirt": "Circular, wide frame; extending outwards from waist to hem.",
    "gymnastic horizontal bar": "Long horizontal bar, two vertical supports, elevation for acrobatics.",
    "horse-drawn vehicle": "Wheeled structure, pulled by horses, equipped with seats.",
    "hourglass": "Two connected inverted cones, narrow middle, time tracking sands.",
    "iPod": "Compact, rectangular body, circular control wheel, small screen.",
    "clothes iron": "Flat surface, handle, temperature control knob, cord.",
    "carved pumpkin": "Hollow interior, cut-out facial features, lid on top.",
    "jeans": "Denim material, metal rivets, belt loops, five-pocket design.",
    "jeep": "Boxy body, round headlights, vertical-slot grille, large wheels.",
    "T-shirt": "Short sleeves, round neckline, typically no collar.",
    "jigsaw puzzle": "Interlocking pieces, varied shapes, image when complete.",
    "rickshaw": "Two-wheeled cart, pulled by person, passenger seating area.",
    "joystick": "Button-covered, handheld, central stick, directional pad.",
    "kimono": "Long, loose robe; wide sleeves; sash belt; traditional Japanese outfit.",
    "knee pad": "Circular padding, secured with straps, covers knee cap.",
    "knot": "Intersecting loops, tightened in center, used for binding.",
    "lab coat": "Knee-length, button front, long sleeves, collar, pocket details.",
    "ladle": "Long handle, deep bowl-shaped end, typically made of metal or plastic.",
    "lampshade": "Conical shape, light diffusion fabric, metal frame, top and bottom openings.",
    "laptop computer": "Rectangular, portable, has keyboard and screen, flip open design.",
    "lawn mower": "Rotating blades, handle, wheels, grass collection bag.",
    "lens cap": "Round, fits over camera lens, central knob for removal.",
    "letter opener": "Slim, sharp end, flat handle, often metallic construction.",
    "library": "Shelves of books, reading areas, checkout desk, quiet ambiance.",
    "lifeboat": "Small, enclosed, buoyant boat with oar locks and rescue equipment.",
    "lighter": "Compact, ignition button, flame nozzle, fuel chamber.",
    "limousine": "Long structure, luxurious interior, privacy divider, chauffeur-driven.",
    "ocean liner": "Large size, multiple decks, funnels, and a streamlined hull.",
    "lipstick": "Cylindrical shape, twistable bottom, cap-covered, small size.",
    "slip-on shoe": "No laces, easy to put on, typically flat soled.",
    "lotion": "Bottle/container, pump/squeeze cap, liquid consistency.",
    "music speaker": "Circular or rectangular body, speaker grilles, volume control knobs.",
    "loupe magnifying glass": "Round, small handle, large convex lens.",
    "sawmill": "Large rotating saw blades, stacks of lumber, industrial machinery.",
    "magnetic compass": "Circular design, directional markings, needle pointing North.",
    "messenger bag": "Rectangular shape, long strap, flap closure, usually cross-body.",
    "mailbox": "Rectangular shape, door, flag indicator, post slot.",
    "tights": "Form-fitting, covers from waist to feet, often elastic.",
    "one-piece bathing suit": "Single garment covering torso and upper legs.",
    "manhole cover": "Circular, flat, typically features patterns or logos, heavy.",
    "maraca": "Hollow, oval-shaped body on a long, narrow handle, with internal beads.",
    "marimba": "Wooden bars arranged like keyboard, resonators below bars.",
    "mask": "Covers entire face, holes for eyes and mouth, strap for securing.",
    "matchstick": "Long, slender shape with sulfur tip at one end.",
    "maypole": "Tall pole with ribbons attached for dancing around.",
    "maze": "Complex network of paths, walls, entrance and exit points.",
    "measuring cup": "Graduated markings, handle, spout, cylindrical or conical shape.",
    "medicine cabinet": "Mirrored door, shelves inside, wall-mounted, typically in bathrooms.",
    "megalith": "Large, upright standing stones, often shaped and arranged by humans.",
    "microphone": "Cylindrical shape, grill pattern, long handle, wired or wireless.",
    "microwave oven": "Rectangular shape, button panel, clear door, interior rack.",
    "military uniform": "Structured design, epaulettes, badges, ribbons, and hats.",
    "milk can": "Cylindrical body, metal material, lid on top, handle.",
    "minibus": "Compact size, multiple seats, sliding side door, short wheelbase.",
    "miniskirt": "Short length, above the knee, fitted waistline.",
    "minivan": "Compact size, sliding side doors, three-row seating.",
    "missile": "Cylindrical body, cone-shaped nose, tail fins, propulsion nozzle.",
    "mitten": "Covered thumb, open-ended enclosure for four fingers.",
    "mixing bowl": "Round, deep, often with a flat bottom and wide rim.",
    "mobile home": "Compact structure, wheels attached, built-in living facilities.",
    "ford model t": "Curved cowl, high ground clearance, brass radiator.",
    "modem": "Rectangular box, multiple indicator lights, cable ports.",
    "monastery": "Large building, steeples, courtyards, cloisters, often in secluded areas.",
    "monitor": "Rectangular screen, stand or base, control buttons, thin borders.",
    "moped": "Small frame, two wheels, pedals, low-powered engine.",
    "mortar and pestle": "Bowl shape with rough interior, paired with a club-like tool.",
    "graduation cap": "Square board on top, attached tassel, skull-fitting crown.",
    "mosque": "Domes, minarets, crescent moon symbol, prayer hall, mihrab.",
    "mosquito net": "Mesh structure, often dome or rectangular shaped, designed to cover beds.",
    "vespa": "Circular headlights, compact design, single-cylinder engine, step-through platform.",
    "mountain bike": "Knobby tires, flat handlebars, sturdy frame, suspension system.",
    "tent": "Triangular shape, fabric material, zipped entrance, pitched on poles.",
    "computer mouse": "Rectangular or round, corded/cordless, left/right click buttons, scrolling wheel.",
    "mousetrap": "Spring mechanism, wooden base, metal bar, cheese bait holder.",
    "moving van": "Large size, boxy shape, rear loading doors, company logos.",
    "muzzle": "Cylindrical shape, straps for securing, covers animal's mouth.",
    "metal nail": "Long, thin, pointed at one end, flat head at other.",
    "neck brace": "Cervical support, adjustable straps, foam/plastic structure.",
    "necklace": "Circular, pendant-adorned, rests on collarbone.",
    "baby pacifier": "Small, button-shaped top, large shield, nub end.",
    "notebook computer": "Portable design, flat shape, keyboard, and foldable screen.",
    "obelisk": "Tall, thin, four-sided, tapering monument which ends in a pyramid-like shape.",
    "oboe": "Slender conical shape, double reed mouthpiece, silver keys.",
    "ocarina": "Elongated body, multiple finger holes, mouthpiece on side.",
    "odometer": "Circular dial, numerical measurements, and needle indicator.",
    "oil filter": "Cylindrical shape, metallic, multiple small perforations, central threaded hole.",
    "pipe organ": "Large structure, multiple pipes of varying sizes, keyboard controls.",
    "oscilloscope": "Rectangular screen, control knobs, input connectors, waveform display.",
    "overskirt": "Layered garment worn over a skirt or dress.",
    "bullock cart": "Two large wheels, wooden structure, pulled by oxen.",
    "oxygen mask": "Strap attached, covers nose and mouth, connected to oxygen supply.",
    "product packet / packaging": "Material texture, shape, labels, seals, closures, product info display.",
    "paddle": "Long, thin shape with a broad flat end, traditionally used for rowing.",
    "paddle wheel": "Circular structure with multiple paddles, rotates on central axis.",
    "padlock": "Metal body, U-shaped shackle, key or combination mechanism.",
    "paintbrush": "Long thin handle, bristles at one end.",
    "pajamas": "Long, loose-fitting, often button-front sleepwear.",
    "palace": "Grand structure, ornate architectural details, large entrance gates.",
    "pan flute": "Series of tubes increasing in length arranged in a row.",
    "paper towel": "Absorbent, rectangular, thin, often perforated, rolled on a tube.",
    "parachute": "Dome-shaped, long suspension lines, harness attachable, aerodynamic design.",
    "parallel bars": "Two horizontal bars aligned parallel on supportive stands.",
    "park bench": "Flat seat, backrest, typically made of wood or metal, outdoor installation.",
    "parking meter": "Vertical structure, coin slot, time display, parking instructions.",
    "railroad car": "Long, rectangular shape, multiple windows, wheels beneath, parallel metal tracks.",
    "patio": "Outdoor furniture, pavers, plants, umbrellas, BBQ grill.",
    "payphone": "Boxed structure, number keypad, corded handset, coin slot.",
    "pedestal": "Elevated base, typically column-like, supports statue or vase.",
    "pencil case": "Rectangular, zip closure, pocket-sized, holds writing utensils.",
    "pencil sharpener": "Compact, hand-crank or electric, pointed end hole, shaving container.",
    "perfume": "Bottle shape, spray nozzle, liquid visibility, brand label, compact size.",
    "Petri dish": "Circular, shallow, lidded, contains agar or media.",
    "photocopier": "Flat surface, buttons, paper feeder, output tray.",
    "plectrum": "Triangular shape, pointed tip, intended for string stroking.",
    "Pickelhaube": "Pointed top, front adorned with large emblem, leather or metal material.",
    "picket fence": "Vertical wooden boards evenly spaced with pointed tops.",
    "pickup truck": "Open cargo area, larger size, two or four-door cab, higher ground clearance.",
    "pier": "Extended structure over water for docking boats.",
    "piggy bank": "Curved body, coin slot on top, four stubby legs, snout, two ears.",
    "pill bottle": "Cylindrical shape, screw cap, labeling, contains small objects.",
    "pillow": "Rectangular or square shape, soft, consists of a fabric case and stuffing.",
    "ping-pong ball": "Small, spherical, lightweight, smooth, bouncy.",
    "pinwheel": "Spinning blades on a stick, assembling a windmill shape.",
    "pirate ship": "Sails, wooden decks, cannons, mast with crow's nest, skull flag.",
    "drink pitcher": "Large handle, spout for pouring, typically cylindrical body.",
    "block plane": "Small, wedge-shaped body with knob handle and adjustable blade.",
    "planetarium": "Domed ceiling, projection equipment, star and galaxy displays.",
    "plastic bag": "Thin, flexible, often rectangular shape, handle on top.",
    "plate rack": "Multiple slots or compartments, typically vertical, for holding plates.",
    "farm plow": "Large blade, heavy frame, often attached to tractor.",
    "plunger": "Long handle, rubber suction cup at one end.",
    "Polaroid camera": "Rectangular, pop-up viewfinder, instant film ejection slot.",
    "pole": "Long, thin, cylindrical shape, often vertically oriented.",
    "police van": "Large, barred windows; siren lights; marked 'POLICE'; robust design.",
    "poncho": "Loose, draped outer garment, often hooded, rectangular shape.",
    "pool table": "Rectangular flat platform, six pockets, green felt, long side rails.",
    "soda bottle": "Cylindrical shape, screw cap, elongated neck, carbonation.",
    "plant pot": "Circular shape, large opening at top, drainage hole at bottom.",
    "potter's wheel": "Round surface, central pivot, foot pedal, vertical rod.",
    "power drill": "Long handle, trigger switch, rotating chuck, various bits.",
    "prayer rug": "Rectangular shape, intricate designs, orientated towards Mecca.",
    "printer": "Input tray, output area, control panel, cartridge compartment.",
    "prison": "Barred windows, cell blocks, watchtowers, high walls, security fencing.",
    "projector": "Rectangular shape, lens on front, venting slots, control panel.",
    "hockey puck": "Circular, flat, solid, edges are rounded, thick.",
    "punching bag": "Cylindrical shape, suspended, filled with sand/air, used for boxing.",
    "purse": "Rectangular or round shape, shoulder or wrist strap, zipper closure, interior compartments.",
    "quill": "Long, thin structure with pointed tip, often used for writing.",
    "quilt": "Patterned fabric, stitched layers, square or rectangular shape.",
    "race car": "Aerodynamic shape, low ground clearance, spoiler at rear, number decals.",
    "racket": "Oval head, mesh-like strings, long handle.",
    "radiator": "Vertical or horizontal metal panels, heat emitting, control knobs.",
    "radio": "Circular knobs, antenna, speaker grid, frequency display.",
    "radio telescope": "Large dish-shaped antenna, rotating base, tall framework structure.",
    "rain barrel": "Cylindrical shape, lid on top, spigot near bottom, used for rainwater collection.",
    "recreational vehicle": "Compact living space on wheels with kitchen, sleep facilities.",
    "fishing casting reel": "Circular handle, metal body, spinning spool, adjustable drag knob.",
    "reflex camera": "Mirror system, interchangeable lenses, through-the-lens viewing.",
    "refrigerator": "Rectangular shape, door(s) on front, cooling unit, interior shelves, freezer compartment.",
    "remote control": "Button layout, small handheld size, infrared sensor.",
    "restaurant": "Tables, chairs, serving counter, menu board, food display.",
    "revolver": "Cylindrical chamber, long barrel, rotating mechanism.",
    "rifle": "Long barrel, shoulder stock, trigger, often has sight scopes.",
    "rocking chair": "Curved legs for rocking, high backrest, wide armrests.",
    "rotisserie": "Cylindrical design, rotating spit or rod, heating element.",
    "eraser": "Rectangular, rubbery texture, can remove pencil marks.",
    "rugby ball": "Oval shape, prominent stitches, larger ends compared to middle.",
    "ruler measuring stick": "Long, thin structure with marked measurements.",
    "sneaker": "Laces, rubber sole, ankle support, distinctive tread pattern.",
    "safe": "Heavy, box-like, key or combination lock, metallic.",
    "safety pin": "Metal, spring mechanism, pointed end, looped catch.",
    "salt shaker": "Small cylindrical container, perforated top, filled with white granules.",
    "sandal": "Open design, straps, exposed toes, flat or slight heel.",
    "sarong": "Long, wrapped fabric worn around waist or body.",
    "saxophone": "Curved body, single-reed mouthpiece, keys, conical bore.",
    "scabbard": "Long, slim protective sheath for a sword or blade.",
    "weighing scale": "Digital or analog display, numbers, flat platform, adjustment knob.",
    "school bus": "Large size, multiple rows of seats, stop sign arm, front engine.",
    "schooner": "Two-masted sailing vessel with fore-and-aft rigging.",
    "scoreboard": "Numerical display, team names, horizontal/vertical layouts.",
    "CRT monitor": "Box-shaped, thick back, glass screen, heavy.",
    "screw": "Cylindrical body, helical ridge (thread), pointed or flat tip.",
    "screwdriver": "Metal rod, handle, flat or cross-tip end.",
    "seat belt": "Strap design, buckle mechanism, adjustable functionality",
    "sewing machine": "Threaded needle, foot pedal, bobbin, stitch patterns selector.",
    "shield": "Round or triangular, centro-symmetric, protective design with grasp/handle.",
    "shoe store": "Rows of footwear, shelves, registers, shoeboxes, try-on seats.",
    "shoji screen / room divider": "Paper-filled, wooden lattice, folding panels.",
    "shopping basket": "Handles, mesh or solid structure, usually circular or rectangular.",
    "shopping cart": "Wheeled frame, open container, handle for pushing.",
    "shovel": "Long handle, flat or pointed metal scoop at end.",
    "shower cap": "Elastic rim, waterproof material, dome-shaped cover for hair.",
    "shower curtain": "Water repellent, hanging hooks, tall, fabric or plastic material.",
    "ski": "Long, thin shape with pointed tips and bindings for boots.",
    "balaclava ski mask": "Covers entire head, exposes only eyes and/or mouth.",
    "sleeping bag": "Rectangular shape, zip closure, lightweight, portable, insulation material.",
    "slide rule": "Long, flat, with multiple rotating scales.",
    "sliding door": "Tracks on top and bottom, large horizontal movement.",
    "slot machine": "Reels with varying symbols, pull-lever, pay table.",
    "snorkel": "Tube shaped, mouthpiece, head strap, allows underwater breathing.",
    "snowmobile": "Track and skis layout, handlebars, shielded seating, engine housing.",
    "snowplow": "Large blade front, tracked or wheeled, enclosed cabin.",
    "soap dispenser": "Cylindrical shape, pump top, liquid containment, often wall-mounted.",
    "soccer ball": "Circular shape, pentagonal panels, stitch lines, inflated.",
    "sock": "Ankle to calf length, tubular, typically elastic, covers foot.",
    "solar thermal collector": "Flat or curved panel, glass cover, pipe network, sun-facing.",
    "sombrero": "Wide-brimmed, high pointed crown, with chin strap.",
    "soup bowl": "Round with deep interior, wide rim, handles optional.",
    "keyboard space bar": "Long horizontal key, bottom row, creates blank spaces.",
    "space heater": "Compact size, protective grill, control knobs, handheld, portable.",
    "space shuttle": "Winged shape, rocket engines, cargo bay doors, payload bay.",
    "spatula": "Flat, wide blade on a long handle, often flexible at the base.",
    "motorboat": "Hull design, outboard motor, control helm, propulsion propeller.",
    "spider web": "Intricate, interconnected, symmetrical, radial patterns, dew-dropped strands.",
    "spindle": "Cylindrical shape, pointed ends, rotates around an axis.",
    "sports car": "Low profile, sleek design, two doors, rear-wheel drive, high performance.",
    "spotlight": "Concentrated light beam, circular casing, mounted or handheld.",
    "stage": "Elevated platform, spotlight, curtain, microphone stand, backstage area.",
    "steam locomotive": "Large smokestack, cylindrical boiler, wheels linked by rods.",
    "through arch bridge": "Arch structure running directly through center of bridge.",
    "steel drum": "Circular, metal, resonant surface with areas for different pitches.",
    "stethoscope": "Tubular device, chest piece, earpieces, flexible tubing.",
    "scarf": "Long, narrow, wrapped around the neck.",
    "stone wall": "Rough, irregularly shaped, stacked stones.",
    "stopwatch": "Round dial, start/stop button, hand indicators, numerical markings.",
    "stove": "Flat top, knobs or buttons, rectangular shape, vent or burner grid.",
    "strainer": "Mesh or perforated structure, handle, bowl or cone-shaped.",
    "tram": "Rectangular body, rails, overhead electric wires, multiple doors, passenger seats.",
    "stretcher": "Long, narrow structure with handles, often foldable, for carrying persons.",
    "couch": "Rectangular form, cushioned seating, typically holds multiple people, has armrests.",
    "stupa": "Dome-shaped, multi-tiered structure with spire at top.",
    "submarine": "Cylindrical body, conning tower, propeller at the rear, torpedo tubes.",
    "suit": "Structured silhouette, lapels, matching trousers, button-down closure.",
    "sundial": "Circular dial, hour lines, gnomon casting shadow.",
    "sunglasses": "Two tinted lenses, connected by a frame, ear handles.",
    "sunscreen": "Bottle/tube packaging, liquid/cream form, sun symbol, SPF numbers.",
    "suspension bridge": "Long vertical cables, supporting towers, flat roadway.",
    "mop": "Long handle, flat or round absorbent head, used for cleaning.",
    "sweatshirt": "Long-sleeved, loose, thick fabric, often with a hood.",
    "swim trunks / shorts": "Short length, loose fitting, quick-drying material, elastic waistband.",
    "swing": "Curved seat suspended by chains or ropes, open structure, movement capability.",
    "electrical switch": "Rectangular or circular shape, toggle or rocker mechanism, wall-mounted.",
    "syringe": "Cylindrical body, sharp needle tip, plunger handle.",
    "table lamp": "Base with support, elongated neck, light bulb, lampshade on top.",
    "tank": "Dome-shaped turret, caterpillar tracks, long protruding cannon.",
    "tape player": "Rectangular shape, cassette slot, play/stop buttons, speaker grid.",
    "teapot": "Round body, lid on top, curved spout, attached handle.",
    "teddy bear": "Soft texture, button eyes, short snout, fluffy body, small ears.",
    "television": "Rectangular screen, control buttons, antenna, remote control compatible.",
    "tennis ball": "Round, fuzzy texture, rubber material, high elasticity.",
    "thatched roof": "Layered, overlapping straw/reed coverage, steeply pitched.",
    "front curtain": "Hangs top-front of stage, opens sideways or vertically.",
    "thimble": "Small, dome-shaped with a hard exterior, and small perforations.",
    "threshing machine": "Large rotating drum, metallic teeth for separating, conveyor belt.",
    "throne": "High back, armrests, ornate detailing, elevated platform.",
    "tile roof": "Interlocking, flat or curved shapes, overlapping layers.",
    "toaster": "Rectangular shape, slots on top, lever on side, heating elements inside.",
    "tobacco shop": "Cigar display cases, pipes, humidors, lighter displays.",
    "toilet seat": "Oval or round shape, hinge system, smooth surface.",
    "torch": "Cylindrical shape, handheld, light-emitting end.",
    "totem pole": "Vertical structures with symbolic carvings stacked sequentially.",
    "tow truck": "Large crane hook, flatbed or lift, towing and recovery equipment.",
    "toy store": "Shelves filled with toys, checkout counter, playful decor.",
    "tractor": "Large tires, prominent front grill, rear hitch, exposed engine.",
    "semi-trailer truck": "Large rectangular cargo area, elongated cab, six or more wheels.",
    "tray": "Flat surface, raised edges, rectangular or round shape.",
    "trench coat": "Long length, button-front, wide lapels, belted waist.",
    "tricycle": "Three wheels, handlebars, small seat, pedal-powered.",
    "trimaran": "Three-hulled structure with a larger central hull.",
    "tripod": "Three adjustable legs, mount for camera/equipment, collapsible.",
    "triumphal arch": "Large, monumental structure, typically three-arched, with ornate designs.",
    "trolleybus": "Overhead electric wires, pole connectors, large passenger vehicle.",
    "trombone": "Long slide, bell-shaped front, curved and hollow tubing.",
    "hot tub": "Circular or rectangular shape, bubbling water, seats inside, control panel.",
    "turnstile": "Rectangular frame, rotating arms/bar, entry-exit mechanism.",
    "typewriter keyboard": "Rectangular keys, parallel rows and alphanumeric characters.",
    "umbrella": "Curved handle, waterproof fabric canopy, collapsible metal spokes.",
    "unicycle": "Single wheel, saddle, pedals, no handlebars.",
    "upright piano": "Vertical form, compact size, high positioned keys.",
    "vacuum cleaner": "Long handle, dust bag or canister, suction nozzle.",
    "vase": "Tall, narrow neck, wide base, often hollow.",
    "vaulted or arched ceiling": "High, curved structure often with ribbed or grooved detail.",
    "velvet fabric": "Soft, thick, short piled, smooth and shiny surface.",
    "vending machine": "Rectangular shape, front product display, buttons, dispensing slot.",
    "vestment": "Religious insignia, elaborate designs, long, flowing fabrics.",
    "viaduct": "Raised structure, multiple arches, supports transportation.",
    "violin": "Curved body, long neck, four strings, f-holes, scroll at top.",
    "volleyball": "Round shape, leather texture, interlocked panels, inflated.",
    "waffle iron": "Rectangular or round, grid pattern plates, handle, hinge mechanism.",
    "wall clock": "Circular shape, numbered dial, two or three hands.",
    "wallet": "Rectangular shape, zip or snap closure, internal compartments for cards and cash.",
    "wardrobe": "Doors, shelves, hanging rods, typically rectangular shape.",
    "military aircraft": "Streamlined shape, wings, tail fins, jet engines, weaponry mounts.",
    "sink": "Faucet, drain hole, basin shape, often paired with counter.",
    "washing machine": "Cylindrical body, front/top load door, control panel, rotating drum.",
    "water bottle": "Cylindrical shape, cap/lid, narrow opening, liquid container.",
    "water jug": "Cylindrical body, handle on side, spout for pouring.",
    "water tower": "Cylindrical structure, elevated, water storage, typically conical roof.",
    "whiskey jug": "Cylindrical shape, round handle, cork or cap closure, often glazed.",
    "whistle": "Cylindrical shape, small hole at top, attached keyring, mouthpiece for blowing.",
    "hair wig": "Synthetic or human hair, different lengths, styles, and cap construction.",
    "window screen": "Mesh structure, surrounding frame, transparency, rectangular shape.",
    "window shade": "Rectangular shape, adjustable covering, attached to window frame.",
    "Windsor tie": "Wide triangular knot, symmetrical structure, perfect for spread collar.",
    "wine bottle": "Cylindrical shape, tapered neck, corked top.",
    "airplane wing": "Sleek, tapered shape with a flat bottom and curved top.",
    "wok": "Round bottom, high sides, long handle.",
    "wooden spoon": "Long handle, rounded scoop, made of wood.",
    "wool": "Textured, fluffy, fibrous, and warm appearance.",
    "split-rail fence": "Parallel rails, interlocking connections, spaced-out wooden posts.",
    "shipwreck": "Submerged structure, weathered wood, marine growth, broken hull parts.",
    "sailboat": "Mast with sails, hull, rudder, and keel.",
    "yurt": "Circular shape, conical roof, latticed walls, central smoke hole.",
    "website": "Interactive elements, text content, hyperlinks, and multimedia displays.",
    "comic book": "Illustrated characters, speech bubbles, sequential panels.",
    "crossword": "Grid of squares, horizontal and vertical word spaces.",
    "traffic or street sign": "Rectangular or octagonal, pole-mounted, symbol/text inclusion.",
    "traffic light": "Three stacked circular lights in vertical alignment.",
    "dust jacket": "Protective, removable cover over a book's binding.",
    "menu": "Lists of items, often food/drinks, frequently with prices.",
    "plate": "Flat, circular, with raised edge.",
    "guacamole": "Creamy texture, served in a bowl, often includes visible diced ingredients.",
    "consomme": "Clear, broth-like soup, often garnished with herbs/meat/vegetables.",
    "hot pot": "Circular basin, varied food ingredients, central heating element.",
    "trifle": "Layered dessert with cream and sponge cake, often in a glass.",
    "ice cream": "Conical, smooth texture, stacked spherical form.",
    "popsicle": "Stick protruding from frozen, elongated, cylindrical shape.",
    "baguette": "Long, thin, crispy crust, soft interior.",
    "bagel": "Round, hole in center, thick, doughy texture, shiny crust.",
    "pretzel": "Twisted knot shape, hard and glossy texture, salt speckled.",
    "cheeseburger": "Bun, patty, cheese, lettuce, tomato, onion, pickles.",
    "hot dog": "Cylindrical shape, exposed filling, bun wrapped, typically garnished.",
    "mashed potatoes": "Soft, creamy texture with small, irregular lumps.",
    "cabbage": "Round, layered leaves, firm texture, stalk at base.",
    "broccoli": "Compact, tree-like shape with dense, clustered buds.",
    "cauliflower": "Curled, dense clusters on a thick central stalk.",
    "zucchini": "Cylindrical shape, smooth skin, firm texture, small seeds inside.",
    "spaghetti squash": "Oblong shape, ribbed surface, with hard, thick skin.",
    "acorn squash": "Oval shape, ribbed skin, top and bottom slightly tapered.",
    "butternut squash": "Bell-shaped, ribbed surface, with thick, straight neck.",
    "cucumber": "Long, cylindrical shape with bumpy skin.",
    "artichoke": "Globe-like shape, layers of overlapping leaves, and a thick, edible stem.",
    "bell pepper": "Smooth, round shape with indented stem and internal seeds.",
    "cardoon": "Large, thistle-like heads with arching, spikey leaves.",
    "mushroom": "Cap shape, stem length, gill structure, presence of ring.",
    "Granny Smith apple": "Medium-sized, round shape, dense texture, slightly rough skin.",
    "strawberry": "Small, heart-shaped, tiny exterior seeds, capped with green leaves.",
    "orange": "Round shape, small size, rugged texture, stem end.",
    "lemon": "Round shape, textured surface, prominent ends, citrus segments inside.",
    "fig": "Oval-shaped, patterned skin, has a small opening at bottom.",
    "pineapple": "Spiky texture, cylindrical shape, leafy crown on top.",
    "banana": "Long, curved shape with a peelable skin and pointed ends.",
    "jackfruit": "Large, oblong shape with bumpy, hard exterior.",
    "cherimoya (custard apple)": "Heart-shaped, scales-like skin, creamy-textured pulp, large black seeds.",
    "pomegranate": "Round shape, numerous seeds, thick rind, juicy inner arils.",
    "hay": "Dried, bundled stalks with a rough, textured surface.",
    "carbonara": "Creamy texture, pasta strands, bacon pieces, egg yolk, grated cheese",
    "chocolate syrup": "Viscous texture, Pourable, Often packaged in squeeze bottles.",
    "dough": "Soft, malleable texture, often round, with visible kneading marks.",
    "meatloaf": "Shape of a loaf, textured surface, appears dense.",
    "pizza": "Round shape, thin crust, cheese topping, triangle slices.",
    "pot pie": "Crust-covered, filling visible through slits, typically circular shape.",
    "burrito": "Cylindrical shape, wrapped in tortilla, visible fillings, often foil-covered.",
    "red wine": "Bottle shape, cork closure, and grape cluster imagery.",
    "espresso": "Small portion, thick consistency, crema on top.",
    "tea cup": "Round body, small handle, flat bottom, typically comes with saucer.",
    "eggnog": "Creamy texture, served in a glass, often garnished with nutmeg.",
    "mountain": "Peaked shape, high elevation, rocky terrain, snow-capped top.",
    "bubble": "Round, transparent, filled with air or gas.",
    "cliff": "Steep, vertical rock face with varying heights and rugged texture.",
    "coral reef": "Biodiverse underwater ecosystem with varied shapes and sizes of organisms.",
    "geyser": "Erupting water and steam, cone or pool-like formation.",
    "lakeshore": "Presence of water body adjacent to land, often peaceful or calm.",
    "promontory": "Steep cliffs or crags extending over water or land.",
    "sandbar": "Visible strip of land, surrounded by water, typically at river mouths.",
    "beach": "Sandy stretches, waves, seashells, palm trees, sun umbrellas.",
    "valley": "Long, narrow, usually between hills or mountains, river often at bottom.",
    "volcano": "Cone shape, smoke plume, molten lava, and craters.",
    "baseball player": "Uniform, cap, holding bat, cleats, gloves.",
    "bridegroom": "Formal suit, tie, boutonniere, often seen with a bride.",
    "scuba diver": "Diving suit, oxygen tank, diving mask, fins, depth gauge.",
    "rapeseed": "Umbrella-shaped flower clusters, elongated seed pods.",
    "daisy": "Central disk of florets surrounded by radiating petals.",
    "yellow lady's slipper": "Orchid shape, slipper-like pouch, twisted petals.",
    "corn": "Long cylindrical shape, husk-wrapped, rows of kernels.",
    "acorn": "Cap-shaped lid, smooth hard shell, oval shape.",
    "rose hip": "Pear-shaped, usually red, contains many small, hard seeds.",
    "horse chestnut seed": "Rounded, glossy texture, with a distinct, rough, lighter-colored scar.",
    "coral fungus": "Branching or clustered growth, varying cap shapes, lacks gills.",
    "agaric": "Cap with gills underneath, stalk with a ring, umbrella-shaped.",
    "gyromitra": "Cap shaped like a brain, stem is thick and short.",
    "stinkhorn mushroom": "Cylindrical stalk, cap covered with a foul-smelling gel.",
    "earth star fungus": "Star-shaped with a puffball-like center surrounded by pointed rays.",
    "hen of the woods mushroom": "Clustered, large fronds with a flared, leaf-like shape.",
    "bolete": "Cap with pores underneath, central thick stem, growing from soil.",
    "corn cob": "Long, cylindrical shape with many small, round kernels arranged in rows.",
    "toilet paper": "Cylindrical roll, perforated squares, soft-textured, absorbent."
}