{
    "pink primrose": "Five-petaled, cup-shaped blooms with a prominent yellow center.",
    "hard-leaved pocket orchid": "Compact cluster of intricate, overlapping, rigid-textured petals.",
    "canterbury bells": "Bell-shaped, clustered blooms, long stems, serrated leaves.",
    "sweet pea": "Delicately ruffled petals, pendulous clusters, butterfly-like shape.",
    "english marigold": "Compact, dense petals in a globular, daisy-like form.",
    "tiger lily": "Large, recurved petals with prominent stamens and speckles.",
    "moon orchid": "Broad, fleshy leaves; roundish, overlapping petals and a hooded column",
    "bird of paradise": "Exotic shape with crane-like blooming structure, long beak-like sepal.",
    "monkshood": "Hooded bloom shape, clustered inflorescences, five distinct petal sections.",
    "globe thistle": "Spherical flower heads with spiky, elongated petals, and prickly foliage.",
    "snapdragon": "Tubular blossoms, dragon face-like opening with two lips.",
    "colt's foot": "Heart-shaped leaves, dandelion-like fluffy seeds, clustered flowers.",
    "king protea": "Large, plush, cup-shaped flowers with prominent central boss.",
    "spear thistle": "Pointed leaves with spine-tipped lobes, large globular flower heads.",
    "yellow iris": "Tall, slender leaves with three large, drooping petals.",
    "globe-flower": "Spherical bloom with wave-like petal arrangement.",
    "purple coneflower": "Cone-shaped center with long, drooping, slender petals.",
    "peruvian lily": "Trumpet-shaped blooms, spotted throat, lanceolate leaves, six-petaled.",
    "balloon flower": "Globe-shaped buds blooming into star-like petals.",
    "giant white arum lily": "Large, waxy, funnel-shaped spathe with prominent central spadix.",
    "fire lily": "Umbrella-shaped cluster of funnel-form blooms, elongated leaves.",
    "pincushion flower": "Star-shaped flowers with fringed petals and a pincushion-like center.",
    "fritillary": "Bell-shaped, checkered pattern, nodding head on slender stem.",
    "red ginger": "Elongated conical inflorescences, waxy bracts, and glossy foliage.",
    "grape hyacinth": "Bulbous shape, dense spike of bell-shaped flowers, thin wiry foliage.",
    "corn poppy": "Papery petals, black cross-shaped stamen center, delicate and solitary.",
    "prince of wales feathers": "Three feather-like petals arranged in an upward-facing trident.",
    "stemless gentian": "Low-growing, ovate foliage, funnel-shaped, lack of stems.",
    "artichoke": "Globe-shaped bloom with layered, spiky, overlapping leaves.",
    "sweet william": "Clustered, fringed petals with light-catching, velvety texture.",
    "carnation": "Ruffled, layered petals with a prominent, centralized calyx.",
    "garden phlox": "Clustered blooms on tall stems with five-pointed petals.",
    "love in the mist": "Lace-like foliage enclosing round, balloon-shaped buds.",
    "mexican aster": "Long, narrow leaves with daisy-like, single-layered petals.",
    "alpine sea holly": "Thistle-like blooms, silvery-green foliage, cone-shaped inflorescence.",
    "ruby-lipped cattleya": "Broad petals, central lip like structure, delicate veined lines.",
    "cape flower": "Five petal structure forming star-like blooms, succulent foliage.",
    "great masterwort": "Star-shaped clusters with delicate lace-like leaves.",
    "siam tulip": "Star-shaped blooms, group-grown on tall slender stalks.",
    "lenten rose": "Five-petaled blooms, leathery leaves, bell-shaped, nodding flowers.",
    "barbeton daisy": "Daisy-like blooms, elongated disc florets, broad lanceolate leaves.",
    "daffodil": "Six petal-shaped tepals surrounding a trumpet-shaped corona.",
    "sword lily": "Tall spikes featuring large, sword-shaped blooms with ruffled edges.",
    "poinsettia": "Broad-pointed leaves surrounding small, clustered, cup-shaped buds.",
    "bolero deep blue": "Velvety petals with a unique bell shape, clustered bloom form.",
    "wallflower": "Clusters of small, four-petaled flowers with elongated, straight stalks.",
    "marigold": "Petals radiate from central disk; mostly flat, dense layering.",
    "buttercup": "Globular petals, heart-shaped leaves, cup-like flower structure.",
    "oxeye daisy": "Oxeye daisy: Perennial with flat, round, white-rimmed centers and ray-like petals.",
    "common dandelion": "Toothed leaves, spherical seed heads, and hollow stalks.",
    "petunia": "Funnel-shaped, wide mouth, often veined petals.",
    "wild pansy": "Heart-shaped petals in triate arrangement, subtly whiskered face.",
    "primula": "Rosette-shaped leaves with bell or star-shaped clustered blooms.",
    "sunflower": "Large, round center with surrounding petals in radial symmetry.",
    "pelargonium": "Distinctive rounded leaves with unique banded/sectioned petal structure.",
    "bishop of llandaff": "Elongated shape, serrated leaves, unique 'pom-pom' blossom structure.",
    "gaura": "Tall, slender stems with butterfly-like blossoms clustered at top.",
    "geranium": "Round leaf clusters with five-petaled, symmetrically clustered flowers.",
    "orange dahlia": "Petals arranged in dense layers forming a rounded, symmetrical bloom.",
    "pink-yellow dahlia": "Multi-layered petals, rounded bloom with a dense, ball-like center.",
    "cautleya spicata": "Slender spike-shaped growth, shield-like leaf base, hairy fruit capsules.",
    "japanese anemone": "Five petalled flowers with a central ring of prominent stamens.",
    "black-eyed susan": "Cone-shaped center surrounded by petal-like rays.",
    "silverbush": "Silverbush blooms showcase star-shaped petals with silvery foliage.",
    "californian poppy": "Silky petals, cup-shaped, saucer-like foliage with branched stems.",
    "osteospermum": "Daisy-like flowers with spoon-shaped petals and central disc florets.",
    "spring crocus": "Long slender leaves, teardrop buds on thin stalks.",
    "bearded iris": "Tall, sword-like foliage with drooping, hair-like beard on petals.",
    "windflower": "Delicate, bell-shaped blooms on slender, swaying stems.",
    "tree poppy": "Large, four-petaled blooms with prominent central stamens.",
    "gazania": "Daisy-like shape with symmetrical petals, central disk, hairy leaves.",
    "azalea": "Clustered blooms, funnel-shaped, often with patterned markings.",
    "water lily": "Floating, star-shaped blooms with waxy, rounded leaves.",
    "rose": "Thorny stem, layered petals spiraling from center.",
    "thorn apple": "Spiked capsule fruits, large trumpet-shaped blooms, serrated leaves.",
    "morning glory": "Funnel-shaped blossoms, heart-shaped leaves, and winding tendrils.",
    "passion flower": "Circular arrangement of stamens, three-dimensional, intricate detailing.",
    "lotus": "Large, plate-shaped leaves with multi-layered, rounded petals.",
    "toad lily": "Star-shaped flowers with speckled patterns and recurved petal tips.",
    "anthurium": "Heart-shaped, glossy leaves with a prominent spadix.",
    "frangipani": "Five-petaled, spiral arrangement, waxy, star-shaped flowers.",
    "clematis": "Clematis - Vine-climbing, features large, star-shaped, four-petal blooms.",
    "hibiscus": "Large, trumpet-shaped flowers with prominent stamens.",
    "columbine": "Spur-like back, bell-shaped flowers, layered petal arrangement.",
    "desert-rose": "Thick succulent leaves, star-shaped clustered blooms, inflated basal stem.",
    "tree mallow": "Large, five-petaled flowers with woody stems and deeply lobed leaves.",
    "magnolia": "Large, fragrant blossoms with spirally arranged, broad petals.",
    "cyclamen": "Heart-shaped leaves, upswept petals, elongated stamen.",
    "watercress": "Round leaves with scalloped edges, clusters of small four-petal flowers.",
    "canna lily": "Broad, tropical leaves with large, asymmetrical, trumpet-shaped blooms.",
    "hippeastrum": "Large, funnel-shaped blooms on tall, leafless stalks.",
    "bee balm": "Bee balm flaunts tubular, crown-like blossoms atop lacy foliage.",
    "ball moss": "Airborne, ball-shaped clusters with overlapping scale-like leaves.",
    "foxglove": "Tall stalks hosting clusters of bell-shaped, drooping blossoms.",
    "bougainvillea": "Thorny vine structure with paper-like, bract-surrounded flowers.",
    "camellia": "Glossy leaves, round form, thick petals in layered symmetry.",
    "mallow": "Five-petaled, heart-shaped leaves, tall stems, clustered blooms.",
    "mexican petunia": "Tall stem, trumpet-shaped blooms, elongated leaves, cluster arrangement.",
    "bromelia": "Sword-shaped leaves and unique pineapple-like flower formations.",
    "blanket flower": "Daisy-like form with petal tips often notched or fringed.",
    "trumpet creeper": "Vine-like growth, tubular blossoms, pendulous cluster arrangement.",
    "blackberry lily": "Six-petaled blossoms with leopard-like speckles, erect capsule shape seedpods."
}