{
    "abyssinian": "Short-haired, muscular body, almond-shaped eyes, large pointed ears.",
    "american bulldog": "Large, muscular body, broad head, short coat, powerful jaw.",
    "american pit bull terrier": "Medium-sized, muscular build, broad skull, prominent cheeks, short coat.",
    "basset hound": "Short-legged, droopy ears, wrinkled skin, long body.",
    "beagle": "Small-bodied breed, broad head, longer ears, square-tapered muzzle.",
    "bengal": "Striped coat, wide-set eyes, large ears, muscular body.",
    "birman": "Medium-sized, silky fur, round blue eyes, semi-longhair, roman-shaped profile.",
    "bombay": "Short-haired, medium-sized, muscular body, round head, large eyes.",
    "boxer": "Medium-sized, muscular build, short hair, square muzzle, broad chest.",
    "british shorthair": "Sturdy body, broad face, dense coat, round eyes, medium-sized ears.",
    "chihuahua": "Small size, apple-shaped head, large eyes, erect ears.",
    "egyptian mau": "Spotted coat, large almond eyes, muscular body.",
    "english cocker spaniel": "Compact body, long ears, expressive eyes, feathered legs and tail.",
    "english setter": "Medium-sized, feathered coat, oval-shaped eyes, long ears.",
    "german shorthaired": "Medium-sized, sleek bodied, distinctively docked tail, broad muzzle.",
    "great pyrenees": "Large, majestic, thick double-coated fur, plume tail, bear-like appearance.",
    "havanese": "Small, curly-haired dog with a springy gait and expressive eyes.",
    "japanese chin": "Small size, broad face, large eyes, and abundant, straight fur.",
    "keeshond": "Medium-sized, dense-coated, fox-faced with plume tail, spectacles markings.",
    "leonberger": "Large, robust dog with a lion-like mane and distinctive rectangular build.",
    "maine coon": "Large size, tufted ears, bushy tail, prominent cheekbones.",
    "miniature pinscher": "Small, robust body with cropped ears and a docked tail.",
    "newfoundland": "Large size, thick double coat, broad head, and strong muscular build.",
    "persian": "Long-haired, flat-faced, round-headed feline with large eyes.",
    "pomeranian": "Small, fluffy coat, fox-like face, erect ears, plumed tail.",
    "pug": "Compact body, large eyes, wrinkly face, distinctive curly tail.",
    "ragdoll": "Ragdoll: Large, semi-longhaired cats, muscular with striking blue eyes.",
    "russian blue": "Short dense fur, medium-sized body, fine bone structure, round eyes.",
    "saint bernard": "Large breed, barrel chest, expressive eyes, protruding lower lip.",
    "samoyed": "Fluffy, thick double coat; smiling expression; upright ears.",
    "scottish terrier": "Compact body, short legs, wiry double coat, distinctive bushy eyebrows.",
    "shiba inu": "Small, alert ears, curly tail, compact, muscular frame.",
    "siamese": "Short-haired, almond-shaped eyes, slender body, large ears.",
    "sphynx": "Hairless, large ears, elongated body, wrinkled skin.",
    "staffordshire bull terrier": "Compact, muscular body with broad head and short muzzle.",
    "wheaten terrier": "Medium-sized, dense wavy coat, square build, prominent beard.",
    "yorkshire terrier": "Small dog with long, straight silky coat and docked tail."
}