{
    "2000 AM General Hummer SUV": "Boxy design, large tires, vertical windscreen, rugged grille.",
    "2012 Acura RL Sedan": "Sleek body, signature diamond pentagon grille, pronounced wheel arches.",
    "2012 Acura TL Sedan": "Sleek profile, distinctive angular lines, aggressive front grille.",
    "2008 Acura TL Type-S": "Sleek design, quad exhaust, distinctive front grille, sport-tuned.",
    "2012 Acura TSX Sedan": "Compact, sporty design with a striking front grille and slim headlights.",
    "2001 Acura Integra Type R": "Compact design, large rear wing, round headlights, hatchback styling.",
    "2012 Acura ZDX Hatchback": "Sloped roofline, shield-shaped grille, hidden rear door handles.",
    "2012 Aston Martin V8 Vantage Convertible": "Sleek convertible design, signature grille, elongated hood and twin exhausts.",
    "2012 Aston Martin V8 Vantage Coupe": "Sculpted, aerodynamic body, distinctive front grille, twin-exhausts, sleek headlights.",
    "2012 Aston Martin Virage Convertible": "Sleek design, signature grille, soft-top roof, two-door layout.",
    "2012 Aston Martin Virage Coupe": "Sleek design, iconic grille, elongated headlights, flared rear arches.",
    "2008 Audi RS 4 Convertible": "Quad exhaust, flared fenders, grille-based 'RS' logo, soft-top roof.",
    "2012 Audi A5 Coupe": "Sleek profile, prominent grille, frameless windows, LED running lights.",
    "2012 Audi TTS Coupe": "Compact design, prominent wheel arches, assertive grille, twin exhausts.",
    "2012 Audi R8 Coupe": "Low-profile, iconic side blades, oval exhaust outlets, LED headlights.",
    "1994 Audi V8 Sedan": "Quad headlights, flared wheel arches, and sleek, elongated body.",
    "1994 Audi 100 Sedan": "Sleek design, rectangular headlights, prominent grille, 4-door structure.",
    "1994 Audi 100 Wagon": "Rectangular headlights, station wagon body, rounded corners.",
    "2011 Audi TT Hatchback": "Compact design, rounded lines, large grille, and sleek roof.",
    "2011 Audi S6 Sedan": "Aggressive front grille, sleek body lines, dual exhaust outlets.",
    "2012 Audi S5 Convertible": "Sleek convertible design, prominent singleframe grille, quad exhaust outlets.",
    "2012 Audi S5 Coupe": "Prominent grille, sloped roofline, dual exhaust, sporty yet elegant design.",
    "2012 Audi S4 Sedan": "Compact design, prominent grille, sleek profile, quad exhaust outlets.",
    "2007 Audi S4 Sedan": "Compact design, dual exhausts, sporty grille, bold angular headlights.",
    "2012 Audi TT RS Coupe": "Aggressive hexagonal grille, prominent wheel arches, sporty dual exhausts.",
    "2012 BMW ActiveHybrid 5 Sedan": "Streamlined body, hybrid-specific alloys, ActiveHybrid badging, LED accent lights.",
    "2012 BMW 1 Series Convertible": "Compact design, retractable soft-top, distinctive kidney grille, round headlamps.",
    "2012 BMW 1 Series Coupe": "Compact body, unique kidney grille, long hood, sporty two-door design.",
    "2012 BMW 3 Series Sedan": "Sleek design, distinct twin-kidney grille, elegant LED headlights.",
    "2012 BMW 3 Series Wagon": "Sleek silhouette, unique elongated shape, distinctive front grille, twin-circle headlights.",
    "2007 BMW 6 Series Convertible": "Aerodynamic design, soft-top roof, large dual kidney grille.",
    "2007 BMW X5 SUV": "Sleek design, prominent kidney grill, angular headlights, robust shape.",
    "2012 BMW X6 SUV": "Sleek, aerodynamic design with a robust, coupe-like silhouette.",
    "2012 BMW M3 Coupe": "Angular body, four-door, dual exhaust, large kidney grille, sleek profile.",
    "2010 BMW M5 Sedan": "Aggressive body styling, dual kidney grille, quad exhaust outlets.",
    "2010 BMW M6 Convertible": "V-shaped hood, soft-top convertible, twin-kidney grille, quad exhaust pipes.",
    "2012 BMW X3 SUV": "Sporty compact design, sloping roofline, distinctive kidney grilles.",
    "2012 BMW Z4 Convertible": "Retractable hardtop, sleek profile, dual exhaust, aerodynamic contours.",
    "2012 Bentley Continental Supersports Conv. Convertible": "Sharp body lines, high-performance wheels, large grille, luxurious interior.",
    "2009 Bentley Arnage Sedan": "Iconic twin headlamps, pronounced bonnet, luxurious sedan body style.",
    "2011 Bentley Mulsanne Sedan": "Distinctive round headlamps, imposing wide grille, and elegant curves.",
    "2012 Bentley Continental GT Coupe": "Sleek design, pronounced haunches, distinctive matrix grille, ellipsoidal headlights.",
    "2007 Bentley Continental GT Coupe": "Twin-circular headlights, large mesh grille, muscular rear haunches.",
    "2007 Bentley Continental Flying Spur Sedan": "Quad elliptical headlights, dominant grille, twin-oval exhaust.",
    "2009 Bugatti Veyron 16.4 Convertible": "Oval front grille, quad-turbo engine, curvy streamlined body, horseshoe headlights.",
    "2009 Bugatti Veyron 16.4 Coupe": "Quad-turbocharged engine, horseshoe grille, sweeping arc body design.",
    "2012 Buick Regal GS": "Sleek design, prominent grille, sporty alloy wheels, distinctive headlamps.",
    "2007 Buick Rainier SUV": "Boxy silhouette, prominent grille, angular headlights, roof rails.",
    "2012 Buick Verano Sedan": "Compact, chrome accents, streamlined body, distinct grille, sleek headlamps.",
    "2012 Buick Enclave SUV": "Sleek contour, chrome accents, three-row space, signature waterfall grille.",
    "2012 Cadillac CTS-V Sedan": "Bold aerodynamic design, vertical LED headlights, distinctive V-shaped grille.",
    "2012 Cadillac SRX SUV": "Angular body, prominent grille, vertical head and tail lights.",
    "2007 Cadillac Escalade EXT Crew Cab": "Large grille, boxy shape, truck bed, prominent wheel arches.",
    "2012 Chevrolet Silverado 1500 Hybrid Crew Cab": "Rectangular grille, extended cab, muscular wheel arches, hybrid-badge.",
    "2012 Chevrolet Corvette Convertible": "Low-slung profile, removable roof panel, iconic quad tail lights.",
    "2012 Chevrolet Corvette ZR1": "Aggressive stance, wide-body, exposed carbon-fiber roof, distinct vented hood.",
    "2007 Chevrolet Corvette Ron Fellows Edition Z06": "Signature wide fenders, aerodynamic profile, distinctive Z06 badging.",
    "2012 Chevrolet Traverse SUV": "Sleek design, bold grille, swept-back headlights, prominent wheel arches.",
    "2012 Chevrolet Camaro Convertible": "Distinctive grille, muscular shape, soft-top convertibility.",
    "2010 Chevrolet HHR SS": "Retro-styled compact wagon, high stance, large grille, pronounced fenders.",
    "2007 Chevrolet Impala Sedan": "Sleek design, dual-port grille, round tail lamps, large wheelbase.",
    "2012 Chevrolet Tahoe Hybrid SUV": "Square body, smooth lines, hybrid badge, prominent grille, large windows.",
    "2012 Chevrolet Sonic Sedan": "Compact, four-door, prominent grille, angular headlights, aerodynamic design.",
    "2007 Chevrolet Express Cargo Van": "Boxy shape, double rear doors, sliding side door, high roof.",
    "2012 Chevrolet Avalanche Crew Cab": "Crew cab, short bed, distinctive midgate folding feature.",
    "2010 Chevrolet Cobalt SS": "Sporty coupe design, prominent rear spoiler, and distinctive SS badges.",
    "2010 Chevrolet Malibu Hybrid Sedan": "Sleek design, prominence hybrid badge, dual port grille, angular headlights.",
    "2009 Chevrolet TrailBlazer SS": "Bulky stance, aggressive grille, SS badge, sporty rims, large exhaust.",
    "2012 Chevrolet Silverado 2500HD Regular Cab": "Rectangular grille, rugged body, extended cab, prominent wheel arches.",
    "2007 Chevrolet Silverado 1500 Classic Extended Cab": "Extended cab, traditional truck bed, rugged grille, rectangular headlights.",
    "2007 Chevrolet Express Van": "Boxy shape, high roof, extended-body passenger van.",
    "2007 Chevrolet Monte Carlo Coupe": "Two-door, sporty design, signature dual-tiered grille, sleek profile.",
    "2007 Chevrolet Malibu Sedan": "Mid-size, four-door, sleek body design, large grille, rounded headlights.",
    "2012 Chevrolet Silverado 1500 Extended Cab": "Extended cab, rounded wheel arches, broad grille, prominent headlights.",
    "2012 Chevrolet Silverado 1500 Regular Cab": "Compact two-door structure, rugged styling, prominent front grille.",
    "2009 Chrysler Aspen SUV": "Boxy body, large grille, elevated height, three-row seating.",
    "2010 Chrysler Sebring Convertible": "Retractable soft-top, curvaceous body, unique grille design, sporty headlights.",
    "2012 Chrysler Town and Country Minivan": "Stoic boxy design, large windows, signature Chrysler grille, sliding doors.",
    "2010 Chrysler 300 SRT-8": "Bold grille, sleek body, dual-exhaust, large alloy wheels.",
    "2008 Chrysler Crossfire Convertible": "Compact design, distinctive boat-tail rear, and sleek crosshair grille.",
    "2008 Chrysler PT Cruiser Convertible": "Retro-styled compact car with a convertible roof, high-roofed design.",
    "2002 Daewoo Nubira Wagon": "Compact design, sleek roofline, distinctive front grille, 5-door layout.",
    "2012 Dodge Caliber Wagon": "Compact-size, five-door hatchback, boxy shape with high beltline.",
    "2007 Dodge Caliber Wagon": "Boxy shape, crosshair grille, unique rear door configuration.",
    "1997 Dodge Caravan Minivan": "Boxy body, side sliding doors, short nose, tall stance.",
    "2010 Dodge Ram Pickup 3500 Crew Cab": "Massive grille, prominent hood bulge, flared fenders, quad headlights.",
    "2009 Dodge Ram Pickup 3500 Quad Cab": "Prominent wheel flares, dual rear wheels, and a broad hood.",
    "2009 Dodge Sprinter Cargo Van": "Long wheelbase, high roof, sliding side doors, panel-style rear doors.",
    "2012 Dodge Journey SUV": "Bold crosshair grille, sculpted fender flares, aggressive stance.",
    "2010 Dodge Dakota Crew Cab": "Rectangular shape, large grille, prominent wheel arches, crew cab configuration.",
    "2007 Dodge Dakota Club Cab": "Extended cab, sturdy boxy design, prominent grille, shorter truck bed.",
    "2008 Dodge Magnum Wagon": "Bold boxy design, prominent grille, elongated roofline.",
    "2011 Dodge Challenger SRT8": "Bold grille, sleek lines, assertive hood design, muscular profile.",
    "2012 Dodge Durango SUV": "Boxy design, elevated stance, three-row seating layout.",
    "2007 Dodge Durango SUV": "Boxy design, prominent grille, robust wheel arches, high ground clearance.",
    "2012 Dodge Charger Sedan": "Sleek profile, aggressive grille, hunched shoulders, prominent wheel arches.",
    "2009 Dodge Charger SRT-8": "Sleek design, large hood scoop, prominent rear spoiler, dual exhausts.",
    "1998 Eagle Talon Hatchback": "Sleek body, sharp edges, two doors, rear hatchback, round headlights.",
    "2012 FIAT 500 Abarth": "Compact design, pronounced wheel arches, dual exhaust pipes.",
    "2012 FIAT 500 Convertible": "Compact, vintage design, unique ragtop, circular headlights, and chrome detailing.",
    "2012 Ferrari FF Coupe": "Four-seat grand tourer, sleek design, scalloped side panels, large grille.",
    "2012 Ferrari California Convertible": "Retractable hardtop, sleek lines, iconic prancing horse emblem.",
    "2012 Ferrari 458 Italia Convertible": "Low-profile, swept-back design with a retractable hardtop roof.",
    "2012 Ferrari 458 Italia Coupe": "Sleek design, aerodynamic contours, dual exhaust, flared wheel arches.",
    "2012 Fisker Karma Sedan": "Solar-panel roof, exotic styling, dual exhaust tips, 22-inch wheels.",
    "2012 Ford F-450 Super Duty Crew Cab": "Large grille, robust body, dual rear wheels, extended crew cab.",
    "2007 Ford Mustang Convertible": "Retro-styled, two-door, soft-top, sporty grille, muscular wheel arches.",
    "2007 Ford Freestar Minivan": "Seven-seater, dual-sliding doors, square body, short hood, high roofline.",
    "2009 Ford Expedition EL SUV": "Extended length, boxy frame, prominent grille, large wheel arches.",
    "2012 Ford Edge SUV": "Angular design, bold grille, sleek lines, athletic stance.",
    "2011 Ford Ranger SuperCab": "Compact pickup, rectangular grille, side-hinged rear doors.",
    "2006 Ford GT Coupe": "Mid-engine two-seater, stream-lined body, vented hood, large rear spoiler.",
    "2012 Ford F-150 Regular Cab": "Boxy structure, horizontal single-bar grille, sturdy wheel arches.",
    "2007 Ford F-150 Regular Cab": "Boxy silhouette, large front grille, two-door body, robust bed area.",
    "2007 Ford Focus Sedan": "Compact size, large headlamps, prominent grille, high rear deck.",
    "2012 Ford E-Series Wagon Van": "Rectangular body, prominent grille, elongated headlamps, windowed cargo area.",
    "2012 Ford Fiesta Sedan": "Compact body, trapezoidal front grille, pronounced wheel arches.",
    "2012 GMC Terrain SUV": "Bold grille, squared-off wheel arches, robust body lines.",
    "2012 GMC Savana Van": "Large body, rectangular shape, distinct sliding side doors.",
    "2012 GMC Yukon Hybrid SUV": "Large, boxy build; unique hybrid badge; vertical tail lamps.",
    "2012 GMC Acadia SUV": "Bold grille, angular headlights, squareish profile, distinctive wheel arches.",
    "2012 GMC Canyon Extended Cab": "Extended cab, compact pickup, prominent wheel arches.",
    "1993 Geo Metro Convertible": "Compact, two-door, retractable fabric roof, rectangular headlights.",
    "2010 HUMMER H3T Crew Cab": "Rugged exterior, signature grille, box-shaped cabin, high-ground clearance.",
    "2009 HUMMER H2 SUT Crew Cab": "Bold grille, boxy frame, short truck bed, large tire mounts.",
    "2012 Honda Odyssey Minivan": "Sleek design, sliding doors, spacious cabin, distinct front grille.",
    "2007 Honda Odyssey Minivan": "Angular body, sliding rear doors, elevated roofline, prominent grille.",
    "2012 Honda Accord Coupe": "Two-door design, sleek profile, aggressive front fascia.",
    "2012 Honda Accord Sedan": "Sleek body, distinct broad headlights, dual exhaust, traditional grille.",
    "2012 Hyundai Veloster Hatchback": "Three-door design, unique glass hatch, asymmetrical styling.",
    "2012 Hyundai Santa Fe SUV": "Angular silhouette, bold front grille, prominent wheel arches.",
    "2012 Hyundai Tucson SUV": "Compact, sharp edges, curvy roofline, hexagonal grille, sporty wheel design.",
    "2012 Hyundai Veracruz SUV": "Sleek body, three-row seating, distinctive grille, large headlamps.",
    "2012 Hyundai Sonata Hybrid Sedan": "Curvy silhouette, hybrid badge, hexagonal grille, unique alloy wheels.",
    "2007 Hyundai Elantra Sedan": "Compact design, curvy hood, prominent grille, oval-shaped headlights.",
    "2012 Hyundai Accent Sedan": "Compact design, sleek lines, round headlights, and modest grille.",
    "2012 Hyundai Genesis Sedan": "Sleek design, large grille, angular headlights, high beltline.",
    "2012 Hyundai Sonata Sedan": "Sleek profile, bold front grille, curved roofline, sculpted hood.",
    "2012 Hyundai Elantra Touring Hatchback": "Compact frame, sloping roofline, large rear cargo hatch, prominent wheel arches.",
    "2012 Hyundai Azera Sedan": "Distinctive large grille, flowing curves, and wraparound tail lights.",
    "2012 Infiniti G Coupe IPL": "Sleek design, distinctive sporty stance, aggressive front fascia.",
    "2011 Infiniti QX56 SUV": "Large, bold grill, higher stance, unique curving window lines.",
    "2008 Isuzu Ascender SUV": "Boxy design, high ground clearance, bold grille, rooftop racks.",
    "2012 Jaguar XK XKR": "Sleek design, rounded headlights, large grille, distinctive hood vents.",
    "2012 Jeep Patriot SUV": "Boxy structure, seven-slot grille, rounded headlamps, rugged body-style.",
    "2012 Jeep Wrangler SUV": "Iconic round headlights, seven-slot grille, rugged boxy design.",
    "2012 Jeep Liberty SUV": "Boxy shape, prominent wheel arches, vertical-sided grille, angular windows.",
    "2012 Jeep Grand Cherokee SUV": "Boxy design, large grille, squared-off wheel arches, athletic stance.",
    "2012 Jeep Compass SUV": "Boxy design, seven-slot grille, round headlights, roof rails.",
    "2008 Lamborghini Reventon Coupe": "Aerodynamic angular design, distinctive wedge shape, aggressive front fascia.",
    "2012 Lamborghini Aventador Coupe": "Sharp-edge design, upward-opening doors, aggressive front, sleek aerodynamics.",
    "2012 Lamborghini Gallardo LP 570-4 Superleggera": "Angular design, large air intakes, aggressive spoiler, and center exhaust.",
    "2001 Lamborghini Diablo Coupe": "Sharp edges, elongated profile, scissor doors, large air intakes.",
    "2012 Land Rover Range Rover SUV": "Boxy profile, large grille, distinctive headlamps, luxurious interior.",
    "2012 Land Rover LR2 SUV": "Compact, boxy design, unique front grille, robust wheel arches.",
    "2011 Lincoln Town Car Sedan": "Boxy design, chrome detailing, comfortable spacious interior.",
    "2012 MINI Cooper Roadster Convertible": "Compact, two-seater, convertible top, unique roadster body style.",
    "2012 Maybach Landaulet Convertible": "Convertible, prominent radiator grille, iconic twin headlamps.",
    "2011 Mazda Tribute SUV": "Compact frame, prominent grille, angular headlights, rugged body styling.",
    "2012 McLaren MP4-12C Coupe": "Swooping lines, distinctive side air intakes, low-slung aerodynamic profile.",
    "1993 Mercedes-Benz 300-Class Convertible": "Classic boxy shape, prominent grille, retractable soft-top roof.",
    "2012 Mercedes-Benz C-Class Sedan": "Sporty elegance, distinct grille, smooth body lines, LED accents.",
    "2009 Mercedes-Benz SL-Class Coupe": "Retractable hardtop, long hood, compact rear, two-seat luxury.",
    "2012 Mercedes-Benz E-Class Sedan": "Sleek design, prominent grille, twin headlamps, elongated rear.",
    "2012 Mercedes-Benz S-Class Sedan": "Sleek design, prominent logo, dual-exhaust, panoramic sunroof, LED lights.",
    "2012 Mercedes-Benz Sprinter Van": "Boxy shape, tall stance, large side sliding doors.",
    "2012 Mitsubishi Lancer Sedan": "Sharp-edged front design, hood scoop, sporty body, compact sedan shape.",
    "2012 Nissan Leaf Hatchback": "Compact design, unique bug-eyed headlights, smooth rounded shape.",
    "2012 Nissan NV Passenger Van": "Rugged design, high roofline, large windows, versatile seating layout.",
    "2012 Nissan Juke Hatchback": "Compact design, high wheel arches, prominent front grille, unique headlights.",
    "1998 Nissan 240SX Coupe": "Compact sporty design, sleek lines, low-profile, rounded front lights.",
    "1999 Plymouth Neon Coupe": "Compact two-door design, rounded edges, prominent headlights, small rear spoiler.",
    "2012 Porsche Panamera Sedan": "Four-door coupe silhouette, sporty aesthetics, elongated hood.",
    "2012 Ram C/V Cargo Van Minivan": "Boxy design, sliding doors, large cargo space, minimal windows.",
    "2012 Rolls-Royce Phantom Drophead Coupe Convertible": "Suicide doors, teak deck, brushed-steel hood, oversized front grill.",
    "2012 Rolls-Royce Ghost Sedan": "Elegant design, Spirit of Ecstasy ornament, large signature grille.",
    "2012 Rolls-Royce Phantom Sedan": "Iconic Pantheon grille, Spirit of Ecstasy, elongated hood, opulent interior.",
    "2012 Scion xD Hatchback": "Compact design, prominent grille, five-door hatchback, rectangular headlights.",
    "2009 Spyker C8 Convertible": "Low-profile, open-top, ten-spoke alloy wheels, signature aerodynamic design.",
    "2009 Spyker C8 Coupe": "Aerodynamic low-profile, butterfly doors, pronounced rear diffuser, large side air intakes.",
    "2007 Suzuki Aerio Sedan": "Compact design, unique rounded front, large headlights, high roofline.",
    "2012 Suzuki Kizashi Sedan": "Sporty profile, honeycomb grille, curvy body lines, bold headlamps.",
    "2012 Suzuki SX4 Hatchback": "Angular frame, compact design, elevated roofline, five-door hatchback.",
    "2012 Suzuki SX4 Sedan": "Compact design, pronounced wheel arches, steeply raked windshield.",
    "2012 Tesla Model S Sedan": "Sleek curvature design, distinctive grill-less front, panoramic roof, large touchscreen.",
    "2012 Toyota Sequoia SUV": "Large body, boxy design, prominent grille, high ground clearance.",
    "2012 Toyota Camry Sedan": "Midsize, sleek body, angular headlights, prominent grille, 4-doors.",
    "2012 Toyota Corolla Sedan": "Compact design, prominent grilles, sleek headlights, and round taillights.",
    "2012 Toyota 4Runner SUV": "Rugged body, high ground clearance, boxy shape, prominent wheel arches.",
    "2012 Volkswagen Golf Hatchback": "Compact design, squared-off rear, prominent wheel arches, sporty silhouette.",
    "1991 Volkswagen Golf Hatchback": "Compact design, round headlights, prominent grille, boxy rear end.",
    "2012 Volkswagen Beetle Hatchback": "Rounded shape, extended bonnet, two-door, compact, iconic tail lift.",
    "2012 Volvo C30 Hatchback": "Compact, unique rear-end design, glass hatch door, two-door setup.",
    "1993 Volvo 240 Sedan": "Boxy body, rectangular headlights, protruding bumpers, upright windscreen.",
    "2007 Volvo XC90 SUV": "Angular body, bold grille, prominent wheel arches, three-row seating.",
    "2012 smart fortwo Convertible": "Compact two-seater, convertible roof, short hood, tall body stance."
}