{
    "abbey": "Gothic architecture, arched windows, cross-shaped layout, towering spires.",
    "airplane cabin": "Rows of seats, overhead compartments, narrow aisles.",
    "airport terminal": "Long corridors, check-in counters, large waiting areas, flight information boards.",
    "alley": "Narrow passage, flanked by buildings, with possibly uneven pavement.",
    "amphitheater": "Semicircular, tiered seating arrangement overlooking a central stage.",
    "amusement arcade": "Bright lights, electronic machines, prize displays, coin slots.",
    "amusement park": "Large rides, concession stands, crowds, festive decorations.",
    "anechoic chamber": "Sound-absorbing walls, echo-free, heavily insulated, angular surfaces.",
    "outdoor apartment building": "Multiple units, exterior entrances, shared outdoor spaces.",
    "indoor apse": "Semicircular, domed structure; architectural reliefs; altar-focused.",
    "aquarium": "Enclosed space, water-filled, various aquatic life, decorative objects.",
    "aqueduct": "Elevated structure, arches, channel for transporting water.",
    "arch": "Curved structure, supports weight, often found in buildings/bridges.",
    "archive": "Rows of documents or boxes, organized on stacked shelves.",
    "outdoor arrival gate": "Open space, signage, crowd, transportation, luggage, structural design.",
    "art gallery": "Walls adorned with framed paintings, sculptures, and exhibit displays.",
    "art school": "Canvas displays, easels, paintbrushes, palette, sculpture stands.",
    "art studio": "Easels, canvases, brushes, palette, sculpting tools, art supplies.",
    "assembly line": "Conveyor belts, machinery, workers, repetitive processes, uniform products.",
    "outdoor athletic field": "Open space, grass, lined markings, goal posts, spectator seating.",
    "public atrium": "Large open space, glass ceilings, indoor trees, communal seating.",
    "attic": "Sloping ceiling, wooden beams, stored items, small windows.",
    "auditorium": "Large stage, rows of seats, spotlights, high ceiling, curtains.",
    "auto factory": "Assembly lines, machines, unfinished vehicles, workers in overalls.",
    "badlands": "Eroded terrains, deep ravines, steep cliffs, no vegetation.",
    "indoor badminton court": "Enclosed space, badminton net, rackets, shuttlecocks, wooden flooring.",
    "baggage claim": "Conveyor belts, luggage, arrival boards, travelers, rectangular hall.",
    "shop bakery": "Assorted pastries display, bakery equipment, bread shelves, counter.",
    "exterior balcony": "Open space, railing or balustrade, outdoor furniture, city/building view.",
    "interior balcony": "Overlooking inner space, enclosed railing, higher indoor vantage point.",
    "ball pit": "Overflowing area filled with numerous small, round play objects.",
    "ballroom": "Large space, mirrored walls, polished floors, chandeliers, dance area.",
    "bamboo forest": "Tall, slender stalks closely packed, leafy canopies, often shadowy.",
    "banquet hall": "Large room, long tables, chairs, podium, grand chandeliers.",
    "bar": "Counter, stools, shelves with bottles, dim lighting.",
    "barn": "Large structure, farm setting, sliding doors, haylofts, pitched roofs.",
    "barndoor": "Large double doors, hinges, mounted on rustic wood structure.",
    "baseball field": "Diamond layout, four bases, pitcher's mound, and backstop.",
    "basement": "Low ceiling, cluttered space, structural pillars, and minimal natural light.",
    "basilica": "Large open central space, curved dome, multiple columns.",
    "outdoor basketball court": "Open space, concrete surface, hoop with backboard, marked lines.",
    "bathroom": "Fixed fixtures like sink, toilet, shower/tub, and tiles.",
    "batters box": "Rectangular area, home plate, chalk lines, adjacent to pitcher's mound.",
    "bayou": "Slow-moving, watery landscape with abundant vegetation and swamp trees.",
    "indoor bazaar": "Crowded stalls, diverse goods, overhead signboards, indoor setting.",
    "outdoor bazaar": "Stalls, crowd, variety of goods, open-air setting, bustling atmosphere.",
    "beach": "Sandy terrain, wave interactions, seashells, and seaside vegetation.",
    "beauty salon": "Mirrors, chairs, hairstyling tools, cosmetics, salon stations.",
    "bedroom": "Bed, bedside tables, wardrobe, pillows, comforter, and lamp.",
    "berth": "Structured sleeping spaces, typically found on trains or ships.",
    "biology laboratory": "Microscopes, lab coats, test tubes, specimen slides, biological models.",
    "indoor bistro": "Compact dining setup, quaint decor, enclosed intimate space.",
    "boardwalk": "Wooden planks, ocean views, railings, benches, shops, pedestrians.",
    "boat deck": "Watercraft, railing structures, deck furniture, mast, and cabin structures.",
    "boathouse": "Structure on water, typically shelters boats or watercraft.",
    "bookstore": "Shelves packed with books, reading areas, literary posters.",
    "indoor booth": "Enclosed space, commercial displays, partition walls, promotional signage.",
    "botanical garden": "Abundance of plant varieties, organized layout, walkways, benches.",
    "indoor bow window": "Curved window protrusion, indoor view, typically multi-paned.",
    "outdoor bow window": "Extended window projection, rounded shape, multi-paned, often flanked by casements.",
    "bowling alley": "Long lanes, pins at end, glossy wooden floors, ball return machines.",
    "boxing ring": "Square canvas with ropes, corner posts, gloves, fighters, referee.",
    "indoor brewery": "Large stainless steel tanks, bar area, brewing equipment.",
    "bridge": "Arching or straight structure spanning over water, road, or valley.",
    "building facade": "Structured exterior, windows, doors, distinctive architectural details.",
    "bullring": "Circular arena, gateways, spectator seats, central sandy area.",
    "burial chamber": "Enclosed space, tombstones, sarcophagi, intricate carvings, somber atmosphere.",
    "bus interior": "Seats in rows, overhead luggage racks, handrails, and aisle.",
    "butchers shop": "Meat cuts display, hanging sausages, butcher's counter, chopping tools.",
    "butte": "Flat-topped, steep-sided, isolated hill with a small summit.",
    "outdoor cabin": "Wooden structure, rustic design, surrounded by nature elements.",
    "cafeteria": "Rows of tables and chairs, counters with food, people dining.",
    "campsite": "Tents, campfire, outdoor furniture, surrounded by nature.",
    "campus": "Open spaces, educational buildings, pathways, greenery, sport facilities.",
    "natural canal": "Water path, surrounded by vegetation, cutting through natural landscapes.",
    "urban canal": "Cityscape with waterways, bordered by buildings and walkways.",
    "candy store": "Shelves packed with various sweet treats, jars and scoops.",
    "canyon": "Deep, narrow valleys with steep rocky walls and a river.",
    "backseat car interior": "Rearview mirror, seat belts, headrests, and cup holders.",
    "frontseat car interior": "Steering wheel, dashboard, rearview mirror, seats, gear shift.",
    "carrousel": "Rotating platform with seats, often in forms of horses or carriages.",
    "indoor casino": "Gaming tables, slot machines, cards, chips, and dealers.",
    "castle": "Large, fortified structure with towers, gates, and high walls.",
    "catacomb": "Underground network of ancient, narrow tunnels with human skeletal remains.",
    "indoor cathedral": "Large arches, high ceilings, ornate decorations, stained glass windows.",
    "outdoor cathedral": "Open space, natural elements, spiritual symbols, and structural grandeur.",
    "indoor cavern": "Enclosed space, stalactites, stalagmites, rocky surfaces, low natural light.",
    "cemetery": "Gravestones, crosses, mausoleums, memorial plaques, manicured lawns.",
    "chalet": "Wooden structure, steep roof, overhanging eaves, rustic appearance.",
    "cheese factory": "Industrial machinery, cheese wheels, stainless steel vats.",
    "chemistry lab": "Lab equipment, glassware, periodic table, safety gear, chemicals.",
    "indoor chicken coop": "Enclosed space, roosting bars, nesting boxes, mesh walls.",
    "outdoor chicken coop": "Enclosed area with henhouse, wire fencing, and perches for roosting.",
    "childs room": "Toys, small-sized furniture, educational materials, cartoon themes.",
    "indoor church": "Arched ceilings, pews, stained glass windows, and altar.",
    "outdoor church": "Open sky, religious structure, natural environment, seating arrangement.",
    "classroom": "Desks in rows, chalkboard, teacher's desk, educational posters.",
    "clean room": "Spotless surfaces, sterile equipment, uniformed personnel, orderly arrangement.",
    "cliff": "Steep vertical rock face, harsh terrain, high elevation.",
    "indoor cloister": "Enclosed corridor, arches, column supports, religious art/details.",
    "closet": "Compact space filled with shelves, hangers, and stored garments.",
    "clothing store": "Racks of clothing, fitting rooms, cash registers, display mannequins.",
    "coast": "Waves meet land, shorelines bordered by water and terrestrial area.",
    "cockpit": "Cluster of various control mechanisms, dashboard displays and seat(s).",
    "coffee shop": "Tables, chairs, bar counter, coffee machines, cups, and pastries.",
    "computer room": "Rows of desks with monitors, keyboards, mice, and cable wires.",
    "conference center": "Large room, stage, projector screen, audience chairs, podium.",
    "conference room": "Large table, chairs, projector, whiteboard, telecommunication devices.",
    "construction site": "Heavy machinery, unfinished structures, workers with helmets, scaffolding.",
    "control room": "Multiple screens, switches, dials, control panels, and operator stations.",
    "outdoor control tower": "Tall structure, numerous antennas, panoramic windows, landing strips nearby.",
    "corn field": "Tall stalks, closely spaced, large leafy plants, cone-shaped fruit clusters.",
    "corral": "Fenced area for enclosing livestock, commonly horses or cattle.",
    "corridor": "Long, narrow space with doors on either side, leading somewhere.",
    "cottage garden": "Rustic structures, abundant mixed plantings, informally arranged.",
    "courthouse": "Large entrance, pillars, steps, symbol scales of justice.",
    "courtroom": "Wooden furniture, gavel, flags, witness stand, judge's bench",
    "courtyard": "Open outdoor space surrounded by walls or buildings.",
    "exterior covered bridge": "Wooden structure, open sides, overhead roof, spanning over water.",
    "creek": "Narrow waterway, surrounded by nature, typically rocky or pebbled.",
    "crevasse": "Deep, narrow fissures in glacier or ice fields.",
    "crosswalk": "Parallel lines intersecting pedestrian path on roads.",
    "office cubicle": "Partitioned workspace with desk, chair, and computer.",
    "dam": "Large structure, water containment, flowing or still water.",
    "delicatessen": "Display of assorted meats, cheeses, pickles, and breads.",
    "dentists office": "Dental chair, overhead light, dental instruments, examination mirror.",
    "sand desert": "Dune formations, sparse vegetation, expansive and sandy.",
    "vegetation desert": "Sparse vegetation, vast sandy expanses, rocky terrain.",
    "indoor diner": "Tables, chairs, eating utensils, food, people dining, cozy ambiance.",
    "outdoor diner": "Al fresco seating, tables with umbrellas, portable heaters, string lights.",
    "home dinette": "Furniture-filled space with dining setup and homely ambience.",
    "vehicle dinette": "Compact space, seating and table, located inside a vehicle.",
    "dining car": "Tables, seats, meal carts, overhead luggage racks, train windows.",
    "dining room": "Table set with chairs, overhead lights, serving furniture.",
    "discotheque": "Flashing lights, dance floor, DJ booth, mirrored balls, bar counters.",
    "dock": "Water body, boats or ships, piers, cranes, containers.",
    "outdoor doorway": "Open space, exposed entryway, usually connected to building.",
    "dorm room": "Bunk beds, desks, small kitchenette, personal items, compact space.",
    "driveway": "A path for vehicles leading to a house or garage.",
    "outdoor driving range": "Open space, golf balls, tees, golf clubs, artificial turf mats.",
    "drugstore": "Shelves filled with medicine, personal care products, and pharmaceuticals.",
    "electrical substation": "High-voltage equipment, tall pylons, thick cables, insulation devices.",
    "door elevator": "Vertical movement, enclosed space, panel buttons, sliding metal doors.",
    "interior elevator": "Enclosed space, vertical movement mechanisms, control panel, doors.",
    "elevator shaft": "Vertical passage, mechanical cables/ropes, metal doors, small confined space.",
    "engine room": "Machinery, control panels, pipes, gauges, and metallic surfaces.",
    "indoor escalator": "Stair-like moving machinery, enclosed environment, handrails on sides.",
    "excavation": "Large open area, heavy-duty equipment, dug up earth, unearthed layers.",
    "indoor factory": "Robotic arms, conveyor belts, machinery and enclosed structures.",
    "fairway": "Open landscape, manicured grass, golf hole markers, sand traps.",
    "fastfood restaurant": "Counter service, menu boards, seating area, branded packaging.",
    "cultivated field": "Regular rows of crops on flat or gently sloping land.",
    "wild field": "Untamed vegetation, varied terrain, absence of human-made structures.",
    "fire escape": "Metal structure, stairs, platforms, railing, attached to buildings.",
    "fire station": "Large garage doors, fire trucks, fireman pole, water hoses.",
    "indoor firing range": "Enclosed space, firearms, targets, shooting lanes, safety equipment.",
    "fishpond": "Water body filled with aquatic life, often surrounded by vegetation.",
    "indoor florist shop": "Variety of plants, bouquet arrangements, vases, counter, indoor setup.",
    "food court": "Multiple food stalls, communal seating area, diverse cuisine displays.",
    "broadleaf forest": "Dense trees with wide, flat leaves and thick undergrowth.",
    "needleleaf forest": "Evergreen trees with thin, sharp leaves densely packed.",
    "forest path": "Dense trees, fallen leaves, intertwining roots, uneven terrain.",
    "forest road": "Tree-lined pathway, dense foliage, uneven terrain, natural solitude.",
    "formal garden": "Symmetrically arranged plants, manicured lawns, geometric paths.",
    "fountain": "Water spouting, often surrounded by sculptures or basins.",
    "galley": "Long, narrow space with rows of benches, oars, and sails.",
    "game room": "Console systems, gaming chairs, display screens, ambient lighting, accessories.",
    "indoor garage": "Enclosed space, vehicles, storage items, concrete floors, garage doors.",
    "garbage dump": "Piles of waste, discarded items, dumpsters, and scavengers.",
    "gas station": "Fuel pumps, vehicle service areas, convenience store.",
    "exterior gazebo": "Open structure, roofed, garden setting, standalone, decorative architecture.",
    "indoor general store": "Shelves filled with diverse goods, cashier counter, closed environment.",
    "outdoor general store": "Camping gear, hiking equipment, and nature-themed decor.",
    "gift shop": "Shelves filled with assorted gifts, wrapping papers, and greeting cards.",
    "golf course": "Vast manicured lawns, sand pits, flags marking holes.",
    "indoor greenhouse": "Plants in enclosed glass structure, interior climate control elements.",
    "outdoor greenhouse": "Transparent structure, plants inside, often with exterior framing.",
    "indoor gymnasium": "Basketball courts, exercise equipment, mirrored walls, high ceilings.",
    "indoor hangar": "Large enclosed space, airplane storage, high ceilings, metal structures.",
    "outdoor hangar": "Large open structure, usually for storing aircrafts, unenclosed walls.",
    "harbor": "Water body with boats, docks, and surrounding infrastructure.",
    "hayfield": "Open landscape filled with short-stalked crops, often baled in stacks.",
    "heliport": "Open area with large H or helipad markings, and landing lights.",
    "herb garden": "Variety of plants, terracotta pots, distinct labels, organized layout.",
    "highway": "Multiple lanes, road signs, vehicles, guardrails, and dividing lines.",
    "hill": "Sloping landscapes, distinct elevations, often not as high as mountains.",
    "home office": "Desk, computer, chair, shelves with books, stationary items.",
    "hospital": "Wide hallways, medical equipment, white lab coats, signage, beds.",
    "hospital room": "Bed, medical equipment, privacy curtain, patient's table.",
    "hot spring": "Steamy water, naturally occurring pools, surrounding rocks.",
    "outdoor hot tub": "Steamy water, tub enclosure, seating area, visible jets.",
    "outdoor hotel": "Open setting, temporary structures, exposed to natural landscapes.",
    "hotel room": "Beds, nightstands, television, mini fridge, and private bathroom.",
    "house": "Rectangular structure, roofs, windows, doors, and chimneys.",
    "outdoor hunting lodge": "Rustic architecture, wildlife motifs, mounted trophies, cozy fireplace.",
    "ice cream parlor": "Frozen treat displays, service counter, tables or booths, toppings station.",
    "ice floe": "Large, floating ice chunks in open water.",
    "ice shelf": "Large, flat, thick floating bodies of solid ice.",
    "indoor ice skating rink": "Enclosed area, glossy ice surface, skate marks, boundary walls, skaters.",
    "outdoor ice skating rink": "Open space surrounded by barriers, smooth icy surface, people skating.",
    "iceberg": "Large floating body of ice, often exhibiting visible peaks and slopes.",
    "igloo": "Dome-shaped structure made of compacted, stacked snow blocks.",
    "industrial area": "Large buildings, machinery, warehouses, smokestacks, and heavy equipment.",
    "outdoor inn": "Rustic structures, natural surroundings, terrace seating, recreational facilities.",
    "islet": "Small, isolated landform surrounded by water.",
    "indoor jacuzzi": "Circular tub, streaming water jets, tiled surrounds, enclosed space.",
    "indoor jail": "Bars, isolated cells, handcuffs, guard towers, uniformed personnel.",
    "jail cell": "Bars, small space, confined, secure, minimal furnishings, solitary.",
    "jewelry shop": "Shiny gemstones, elegant displays, mirror reflections, luxurious accessories.",
    "kasbah": "Fortified village with earthen buildings, high walls and narrow lanes.",
    "indoor kennel": "Enclosed space, wire or plastic walls, pet bedding, food/water bowls.",
    "outdoor kennel": "Enclosed space, wire mesh, exception for sunlight, shelter area, for pets.",
    "kindergarden classroom": "Small chairs, educational toys, alphabet charts, student artwork.",
    "kitchen": "Appliances, countertops, cabinets, utensils, stove, sink.",
    "kitchenette": "Compact area with appliances, cabinets, and countertop for food preparation.",
    "outdoor labyrinth": "Winding paths, high walls, geometric patterns, open sky.",
    "natural lake": "Surrounded by land, filled with fresh water, often harboring wildlife.",
    "landfill": "Piled waste, heavy machinery, irregular topography, birds overhead.",
    "landing deck": "Flat surface, marked lines, safety barriers, aircraft parking spaces.",
    "laundromat": "Rows of washing machines, dryers, folding tables, detergent dispensers.",
    "lecture room": "Chairs and desks aligned, chalkboard or projector at front.",
    "indoor library": "Shelves of books, reading tables, quiet zones, librarian desk.",
    "outdoor library": "Open-air bookshelves, seating arrangements, surrounded by nature.",
    "outdoor lido deck": "Open-air pool, lounge chairs, cocktail bar, nautical-themed decor.",
    "lift bridge": "Elevated roadway, movable deck, counterweights, water underneath.",
    "lighthouse": "Tall structure, circular shape, top light, surrounded by water.",
    "limousine interior": "Luxurious upholstery, spacious legroom, private partition, ambient lighting.",
    "living room": "Furniture like sofas, coffee table, television, often carpeted.",
    "lobby": "Large space, front desk, seating area, elevator or staircase access.",
    "lock chamber": "Enclosed space, doors at both ends, embedded in waterway structure.",
    "locker room": "Lockers, benches, showers, gym equipment, mirrors.",
    "mansion": "Large structure, multiple rooms, grand exterior, luxurious interiors.",
    "manufactured home": "Single-level structure, lightweight materials, off-site factory construction.",
    "indoor market": "Stalls, variety of goods, overhead lighting, enclosed structure.",
    "outdoor market": "Stalls, variety of goods, open-air setting, crowd, vendors.",
    "marsh": "Waterlogged terrain, dense aquatic vegetation, mud-like ground.",
    "martial arts gym": "Training equipment, mats, punching bags, mirrors and combat rings.",
    "mausoleum": "Large stone edifice, often ornate, housing burial chambers.",
    "medina": "Narrow alleyways, walled enclosures, bustling markets, historic buildings.",
    "water moat": "Circular or linear body of water surrounding fortified structure.",
    "outdoor monastery": "Open spaces, religious structures, serene environment, natural elements.",
    "indoor mosque": "Prayer rugs alignment, mihrab niche, minbar pulpit, Islamic calligraphy.",
    "outdoor mosque": "Open space, Islamic architectural elements, prayer mats, minarets.",
    "motel": "Single or two-story buildings, individual rooms with exterior entrances.",
    "mountain": "High elevation, rocky terrain, typically peaked or ridge-like.",
    "mountain snowy": "High peaks covered in snow, lack of vegetation, harsh terrain.",
    "indoor movie theater": "Large screen, tiered seating, projection equipment, dim lighting.",
    "indoor museum": "Artifacts display, informational panels, showcase cabinets, and controlled lighting.",
    "music store": "Instruments, record racks, sheet music, headphones, cashier counter.",
    "music studio": "Instruments, recording equipment, soundproof walls, mixer console.",
    "outdoor nuclear power plant": "Large domed structures, cooling towers, high-voltage power lines.",
    "nursery": "Crib, stuffed animals, toys, baby essentials, changing station.",
    "oast house": "Conical roof, round or square structure, vent on top.",
    "outdoor observatory": "Open space, telescopes, star charts, domed structures.",
    "ocean": "Vast water body, wave patterns, marine life presence, horizon line.",
    "office": "Desks, chairs, computers, file cabinets, stationery items.",
    "office building": "Tall structure, multiple windows, revolving doors, concrete or glass exteriors.",
    "outdoor oil refinery": "Large steel structures, pipes, smokestacks, storage tanks.",
    "oilrig": "Large industrial structure, oil drilling over water body.",
    "operating room": "Sterile environment, surgical equipment, operating table, overhead lights.",
    "orchard": "Rows of trees with visible fruits or blossoms.",
    "outdoor outhouse": "Small, stand-alone structure for sanitation, often wood, with door.",
    "pagoda": "Multi-tiered, eaved towers with upward curving roofs.",
    "palace": "Large structures, ornate details, symmetrical architecture, opulent interiors.",
    "pantry": "Shelves filled with food items, storage containers, appliances.",
    "park": "Mixture of trees, open spaces, benches and walking paths.",
    "indoor parking garage": "Enclosed space, multiple parked cars, clear lane markings, concrete pillars.",
    "outdoor parking garage": "Open space, multiple parked vehicles, marked lanes, boundary walls.",
    "parking lot": "Rows of marked spaces for vehicle accommodation and pathways.",
    "parlor": "High ceilings, ornate furnishings, large windows, chandeliers.",
    "pasture": "Open land with grass, often used for grazing livestock.",
    "patio": "Outdoor space, often paved, for dining or recreation adjacent to residence.",
    "pavilion": "Open structure, supported by pillars, commonly with a dome roof.",
    "pharmacy": "Shelves filled with medications, counter with cash register, pharmacy signs.",
    "phone booth": "Enclosed structure, glass windows, telephone, privacy partition, and lighting.",
    "physics laboratory": "Complex scientific equipment, charts, and safety gear arrangement.",
    "picnic area": "Outdoor setting with picnic tables, grills, and trash cans.",
    "indoor pilothouse": "Enclosed space, steering equipment, navigational charts, marine themed decor.",
    "outdoor planetarium": "Open sky, celestial projections, nature-infused seating arrangement.",
    "playground": "Outdoor space with swings, slides, climbing frames, and sandpit.",
    "playroom": "Toys scattered, miniature furniture, child-friendly decor, play mats.",
    "plaza": "Open space, surrounded by buildings, often with public seating.",
    "indoor podium": "Lectern, multiple chairs, spotlight, stage, and backdrop.",
    "outdoor podium": "Open-air setting, elevated speaker's stand, audience seating arrangement.",
    "pond": "Water body surrounded by land, may contain aquatic plants/animals.",
    "establishment poolroom": "Billiard tables, cues, chalk, scoreboards, hanging lights.",
    "home poolroom": "Billiards table, cues, ball rack, chalk, high stools, lighting.",
    "outdoor power plant": "Large machinery, towering smoke stacks, high-tension power lines.",
    "promenade deck": "Open area on ship's upper level for leisurely walking.",
    "indoor pub": "Bar stools, tables, counter, drinks display, dart board.",
    "pulpit": "Raised platform, mostly found in churches, for public speaking.",
    "putting green": "Grass surface, golf ball, hole, flag, golf club.",
    "racecourse": "Track shape, starting gates, grandstands, turf or dirt surfaces.",
    "raceway": "Curved tracks, grandstands, safety barriers, starting/finishing lines.",
    "raft": "Inflatable structure, elongated shape, paddles, often seen on water.",
    "railroad track": "Parallel metal rails on regularly spaced wooden or concrete ties.",
    "rainforest": "Dense vegetation, large trees, abundant wildlife, high humidity, waterfalls.",
    "reception": "Furnished desk, waiting chairs, receptionist, sign-in area, informational brochures.",
    "recreation room": "Indoor space with gaming equipment, leisure seating, and entertainment appliances.",
    "residential neighborhood": "Houses close together, lawns, driveways, sidewalks, street signs.",
    "restaurant": "Tables, chairs, serving counters, menus, cutlery, and food displays.",
    "restaurant kitchen": "Cooking equipment, food ingredients, chefs, countertops.",
    "restaurant patio": "Outdoor seating, umbrella-covered tables, string lights, potted plants.",
    "rice paddy": "Terraced fields, water-filled plots, dense stalk clusters.",
    "riding arena": "Fenced area, horse tracks, jumps, spectator stands, sandy surface.",
    "river": "Flowing water, lined with vegetation or rocky terrain.",
    "rock arch": "Natural stone formation, shaped like an overhead bridge.",
    "rope bridge": "Suspended pathway, narrowly built, with wooden planks and side cables.",
    "ruin": "Dilapidated structures, fragmented walls, visible debris, aged and overgrown.",
    "runway": "Long straight path, marked lines, airplane landing/takeoff area.",
    "sandbar": "Elongated landform in water, below or above the water surface.",
    "sandbox": "Enclosed area, loose granular material, and play structures.",
    "sauna": "Wooden benches, steam, heated rocks, towel racks.",
    "schoolhouse": "Large building, multiple windows, playground equipment, bell or clock tower.",
    "sea cliff": "Steep vertical drop, adjacent to large body of water.",
    "server room": "Rows of electronic equipment, cables, cooling systems, and server racks.",
    "shed": "Small structure, usually wooden, for storage or work activities.",
    "shoe shop": "Rows of various styles of footwear displayed on shelves.",
    "shopfront": "Store signage, displayed merchandise, large windows, entrance door.",
    "indoor shopping mall": "Covered retail spaces, multiple stores, corridors, escalators/elevators.",
    "shower": "Water spray, showerhead, tiled walls, soap dispensers.",
    "skatepark": "Ramps, railings, half-pipes, flat and concave surfaces.",
    "ski lodge": "Mountainous setting, wooden structure, large fireplace, ski equipment.",
    "ski resort": "Snowy slopes, ski lifts, lodges, skiers, and snowboards.",
    "ski slope": "Steep incline, snow-covered, ski tracks, lift systems, mountainous backdrop.",
    "sky": "Open expanse, cloud formations, sunlight or moon visibility.",
    "skyscraper": "Tall building with multiple stories and flat architectural design.",
    "slum": "Densely packed, makeshift housing with visible disrepair.",
    "snowfield": "Wide expanses of untouched, smooth surface with frosty texture.",
    "squash court": "Four walled room with marked floor for racket sport.",
    "stable": "Wooden structures, hay bales, horse stalls, saddles, bridles.",
    "baseball stadium": "Diamond-shaped field, bleachers, scoreboard, infield dirt, outfield grass.",
    "football stadium": "Oval turf field, goal posts, stadium seating, boundary lines.",
    "indoor stage": "Enclosed space, stage setup, lighting systems, audience seating arrangement.",
    "staircase": "Ascending/descending steps with railing, often connects different levels.",
    "street": "Paved surface, buildings, vehicles, pedestrian walkways, streetlights.",
    "subway interior": "Seats in rows, poles, doors, overhead handles, digital signs.",
    "platform subway station": "Linear platforms, railway tracks, overhead signage, benches.",
    "supermarket": "Shelves packed with goods, shopping carts, check-out counters.",
    "sushi bar": "Counter with displayed fresh seafood, sushi chefs, sushi mat, chopsticks.",
    "swamp": "Waterlogged land, dense vegetation, often muddy with varied wildlife.",
    "indoor swimming pool": "Enclosed water area, lane markers, diving boards, spectator seats.",
    "outdoor swimming pool": "Open sky, water body surrounded by tiles, lounge chairs.",
    "indoor synagogue": "Jewish symbols, Torah Ark, Bimah, Menorah, Star of David.",
    "outdoor synagogue": "Open space with Jewish religious symbols and seating arrangements.",
    "television studio": "Cameras, control panels, stage lights, and broadcasting equipment.",
    "east asia temple": "Ornate architecture, wide courtyards, towering pagodas, dragon statues.",
    "south asia temple": "Elaborate carvings, domed structures, rising towers and spiritual symbols.",
    "indoor tennis court": "Enclosed space, net in middle, rectangular court, racquets, tennis balls.",
    "outdoor tennis court": "Netted rectangle court, racket sport players, lined boundaries.",
    "outdoor tent": "Portable shelter structure, typically canvas, with support poles.",
    "indoor procenium theater": "Stage framed by arch, curtains, seating rows, and theatrical props.",
    "indoor seats theater": "Rows of seats, stage, curtains, lights, aisle.",
    "thriftshop": "Assorted used goods, organized clutter, mixture of eras and styles.",
    "throne room": "Opulent decor, regal seating, grand chandeliers, lofty ceilings, ornate details.",
    "ticket booth": "Windowed structure, service counter, signage, ticketing equipment.",
    "toll plaza": "Multiple lanes with booths, barriers, and vehicle movement.",
    "topiary garden": "Sculpted plants, intricate greenery designs, geometrically shaped hedges.",
    "tower": "High structure, typically conical or cylindrical, with multiple levels.",
    "toyshop": "Shelves filled with various toys, playsets and themed decorations.",
    "outdoor track": "Open space, racing lanes, surrounding bleachers, starting blocks.",
    "train railway": "Parallel tracks, locomotives, carriages, platforms, overhead wires.",
    "platform train station": "Rail tracks, platform signs, benches, waiting passengers, covered shelters.",
    "tree farm": "Rows of evenly spaced, similar-sized trees grown for harvest.",
    "tree house": "Elevated structure nestled among branches, wooden, adventure-playhouse look.",
    "trench": "Long, narrow, deep ground depression, often for protection or drainage.",
    "coral reef underwater": "Abundant marine life amidst intricate, layered rocky structures.",
    "utility room": "Storage shelves, washer-dryer, cleaning supplies, tools, and appliances.",
    "valley": "Sloping sides meeting at a narrow base, often with watercourse.",
    "van interior": "Seats arrangement, steering wheel, dashboard, cargo area, rear-view mirror.",
    "vegetable garden": "Raised beds, various plant species, garden tools, fences, dirt paths.",
    "veranda": "Open-air gallery, roofed, attached to building exterior.",
    "veterinarians office": "Examination tables, animal cages, medical equipment, and pet posters.",
    "viaduct": "Elevated bridge, multiple arches, traverses landscapes or waterways.",
    "videostore": "Shelves of movies, posters, checkout counter, viewing screens.",
    "village": "Rural homes, farmland, small roads, dense trees, low-rise structures.",
    "vineyard": "Rows of grapevines, often on hill slopes, with supporting trellises.",
    "volcano": "Conical mountain, smoke or ash plumes, molten lava flow.",
    "indoor volleyball court": "Hard surface floor, net divider, high-ceiling, boundary lines.",
    "outdoor volleyball court": "Sand or grass field, net in the middle, marked boundaries.",
    "waiting room": "Chairs alignment, magazines, reception desk, signage, digital screens.",
    "indoor warehouse": "Stacked items, vertical shelves, large indoor space, artificial lighting.",
    "water tower": "Tall structure, cylindrical shape, large top storage container.",
    "block waterfall": "Stepped structure, continuous flowing water over flat surfaces.",
    "fan waterfall": "Tiered cascades spreading out in a fan-like formation.",
    "plunge waterfall": "Vertical water flow, steep drop, often into deep basin.",
    "watering hole": "Predominant liquid surface, gathering wildlife, natural vegetation borders.",
    "wave": "Cresting form with rhythmically undulating, repetitive movement.",
    "wet bar": "Inbuilt counter, sink, storage for alcohol, glassware and accessories.",
    "wheat field": "Endless rows of tall stalks, topped with grain heads.",
    "wind farm": "Array of large turbines, spinning blades, open landscapes.",
    "windmill": "Rotating blades, tall structure, often in rural landscapes.",
    "barrel storage wine cellar": "Rows of cylindrical barrels, stacked horizontally, in cool, dim space.",
    "bottle storage wine cellar": "Rows of bottles, stacked horizontally in cool, dim lighting.",
    "indoor wrestling ring": "Squared space, ropes on sides, padded mat surface, corner posts.",
    "yard": "Open outdoor space, typically grassy, bordered by buildings or fences.",
    "youth hostel": "Bunk beds, lockers, shared facilities, informal gathering areas."
}