{
    "Apply Eye Makeup": "Usage of brushes around the eyes with cosmetic products.",
    "Apply Lipstick": "Holds tube near mouth, moves it around lips with precision.",
    "Archery": "Drawn bowstring, one-eyed aim, arrow notch, straight standing stance.",
    "Baby Crawling": "Infant on all fours, alternating limb movement, forward motion.",
    "Balance Beam": "Individual balancing steadily on a narrow, elongated platform.",
    "Band Marching": "Uniformed individuals moving in formation with musical instruments.",
    "Baseball Pitch": "Wind-up motion followed by a strong, overhand throw.",
    "Basketball": "Dribbling, shooting, jumping, with a spherical object.",
    "Basketball Dunk": "Player leaping high, arm extended, forcefully slamming ball into hoop.",
    "Bench Press": "Laying flat, barbell lifted with both hands, arms extended.",
    "Biking": "Rider straddling a bicycle, pedalling and steering handlebars.",
    "Billiards": "Two hands gracefully guiding a long, slender cue to strike ball.",
    "Blow Dry Hair": "Person directing hot air onto wet hair with a handheld device.",
    "Blowing Candles": "Bent posture, puckered lips, brief wind, extinguished candle flames.",
    "Body Weight Squats": "Bending knees, lowering hips, as if sitting on invisible chair.",
    "Bowling": "Bent posture, swinging arm, sliding foot, releasing spherical object.",
    "Boxing Punching Bag": "Strong, swift arm movements aimed at a fixed target.",
    "Boxing Speed Bag": "Quick, rhythmic punches towards a small, suspended bag.",
    "Breast Stroke": "Arms sweeping outwards, legs performing a frog-like kick.",
    "Brushing Teeth": "Hand movements near mouth with toothbrush, repeated scrubbing motion.",
    "Clean And Jerk": "Lifter hoists weight overhead, transitioning through squat position.",
    "Cliff Diving": "Leap off high edge, body tucks, extends into dive towards water.",
    "Cricket Bowling": "Player runs up, delivers ball overarm with straight arm swing.",
    "Cricket Shot": "Bat swings forward, bent knees, stationary foot pivot.",
    "Cutting In Kitchen": "Hands manipulating a tool, swiftly dividing material on a surface.",
    "Diving": "Body bent, arms forward, plunging into water elegantly.",
    "Drumming": "Rapid rhythmic hand movements striking cylindrical objects.",
    "Fencing": "Lunging or retreating with an extended arm, holding thin sword.",
    "Field Hockey Penalty": "Player striking ball with stick in structured, penalty area.",
    "Floor Gymnastics": "Acrobatic movements performed on floor mat, often involving flips.",
    "Frisbee Catch": "Character extends arm, leaps, catches disc mid-air.",
    "Front Crawl": "Arms alternate back and forth with flutter-kicking legs.",
    "Golf Swing": "Coordinated rotation of hips and shoulders, followed by fluid arm swing.",
    "Haircut": "Snipping scissors around head, fallen hair, and a transformed look.",
    "Hammering": "Firm grip, rhythmic arm motion, repeated downward strikes.",
    "Hammer Throw": "Character swings arm in a circular motion; launches object.",
    "Handstand Pushups": "Inverted stance, body vertical, pushing off ground with hands.",
    "Handstand Walking": "Inverted body, hands as 'feet', alternating hand movement forward.",
    "Head Massage": "Hands rhythmically applying pressure on scalp and around temples.",
    "High Jump": "Body propels upwards, legs bend and tuck mid-air.",
    "Horse Race": "Rampant galloping, raised tails, and swift, determined movement.",
    "Horse Riding": "Mounted individual, rhythmic galloping motion, reins in hands.",
    "Hula Hoop": "Circular swinging movement around the waist.",
    "Ice Dancing": "Graceful, synchronized movements on ice with a dance partner.",
    "Javelin Throw": "Long extended arm, body hinged at waist, single forward stride.",
    "Juggling Balls": "Hands in swift, circular motion keeping multiple balls airborne.",
    "Jumping Jack": "Rapid, alternating arm-leg extension in a star-shaped pattern.",
    "Jump Rope": "Arms arc, body bounces, ropes sweep under and over.",
    "Kayaking": "Guiding paddle-propelled watercraft with alternating side strokes.",
    "Knitting": "Hands rhythmically moving, intertwining yarn with two pointy needles.",
    "Long Jump": "Extended legs, arched body, arms reaching forward in mid-air.",
    "Lunges": "One leg stepping forward with knee bent, other leg stationary behind.",
    "Military Parade": "Marching in unison, showcasing discipline and precision.",
    "Mixing": "Hands repeatedly merging varied materials in a container.",
    "Mopping Floor": "Grasping a long handle, vigorous back-and-forth sweeping motion.",
    "Nunchucks": "Dual-handled weapon swung in fluid, circular movements.",
    "Parallel Bars": "Two-handed grasp, legs swinging or hovering in the air.",
    "Pizza Tossing": "Hands cyclically spinning dough above head.",
    "Playing Cello": "Sitting, bent legs, one arm arched, the other gliding bow.",
    "Playing Daf": "Hands rhythmically striking a large, circular framed drum.",
    "Playing Dhol": "Vigorously swinging arms, rhythmic drum hits with sticks.",
    "Playing Flute": "Character's lips poised, fingers agilely manipulating flute's keys.",
    "Playing Guitar": "Strumming strings, fretting along neck, body posture with instrument.",
    "Playing Piano": "Hands rhythmically striking keys, body swaying to the composed melody.",
    "Playing Sitar": "Seated performer gracefully strumming lengthy, multi-stringed Indian instrument.",
    "Playing Tabla": "Rapid hand movements striking rounded percussion instrument.",
    "Playing Violin": "Character holds violin under chin, bowing strings rhythmically.",
    "Pole Vault": "Runner launches over bar with aid of a long pole.",
    "Pommel Horse": "Gymnast performs circular, swinging maneuvers with legs spread wide.",
    "Pull Ups": "Arms bent, body lifted, chin above bar.",
    "Punch": "Fist clenched, arm back, then snapped forward quickly.",
    "Push Ups": "Body lowered and raised using arm strength, torso straight.",
    "Rafting": "Balanced body, paddling motions, floating on water surface.",
    "Rock Climbing Indoor": "Scaling vertical structures using artificial hand and foot holds",
    "Rope Climbing": "Character grasping, pulling upward, feet pushing against rope.",
    "Rowing": "Body leans, arms extend and pull, synchronized with oar movement.",
    "Salsa Spin": "Quick pivot on one foot, other leg swings around in rotation.",
    "Shaving Beard": "Hand motion towards face, shaving tool, removal of facial hair.",
    "Shotput": "Bent arm, low crouch, forward release with high trajectory.",
    "Skate Boarding": "Crouched stance, feet on board, oscillating balance, rapid movement.",
    "Skiing": "Person sliding downhill on two narrow, flat-bottomed boards.",
    "Skijet": "Propulsive movement on water surface with high-speed aquatic jumps.",
    "Sky Diving": "Body in free-fall, arms spread wide, legs slightly bent.",
    "Soccer Juggling": "Player keeps ball airborne using feet, knees, and head.",
    "Soccer Penalty": "Player kicks ball, goalkeeper attempts block, crowd watches anxiously.",
    "Still Rings": "Arms outstretched, body suspended, displaying strength and balance.",
    "Sumo Wrestling": "Large bodies, grappling stance, forceful pushing or throwing.",
    "Surfing": "Riding wave stance on board, arms balancing, ocean spray around.",
    "Swing": "Arcing motion, high to low, associated with forceful impact.",
    "Table Tennis Shot": "Swift arm swing, fast wrist flick, body leaning forward.",
    "Tai Chi": "Harmonious fluid movements mimicking natural flow and balance.",
    "Tennis Swing": "Racket rear, body twist, followed by forceful arm extension.",
    "Throw Discus": "End-over-end rotation, extended arm release, spinning body motion.",
    "Trampoline Jumping": "Body funnels upward in spiralling motion, performing aerial flips.",
    "Typing": "Fingers rapidly striking keyboard keys, eyes focused on the screen.",
    "Uneven Bars": "Swinging motion with grip changes on two different-height bars.",
    "Volleyball Spiking": "Player leaps, arm pulled back then swiftly strikes ball mid-air.",
    "Walking With Dog": "Human moving with leash-connected canine by their side.",
    "Wall Pushups": "Person inclines towards wall using arms for support and push-offs.",
    "Writing On Board": "Character's hand moving swiftly, chalk or marker leaving marks.",
    "Yo Yo": "Up and down bouncing movement, similar to a yo-yo's action."
}