{
    "banded": "Characterized by repetitively uniform horizontal or vertical patterns.",
    "blotchy": "Uneven distribution of color intensity across a surface.",
    "braided": "Interwoven strands forming a complex, yet consistent pattern.",
    "bubbly": "Emits light, airy, effervescent sensations upon interaction.",
    "bumpy": "Uneven surface causing irregular physical sensations upon contact.",
    "chequered": "Pattern alternates between two distinct, non-overlapping areas.",
    "cobwebbed": "Characterized by intricate, web-like interconnectedness and complexity.",
    "cracked": "Fragmented pattern due to breakage or distress.",
    "crosshatched": "Characterized by intersecting lines forming a distinct, repetitive pattern.",
    "crystalline": "Distinct by its unvarying, repeating atomic structure.",
    "dotted": "Dotted class: prominent in tactile perception via raised points.",
    "fibrous": "Characterized by long, thin, intertwining strands or fibers.",
    "flecked": "Presents varying elements in a diffuse, dispersed manner.",
    "freckled": "Densely scattered natural spots causing uneven pigment distribution.",
    "frilly": "Characterized by elaborate ruffles or decorations.",
    "gauzy": "Lightweight, thin, often slightly transparent.",
    "grid": "Regular, repeating intersections of horizontal and vertical lines.",
    "grooved": "Characterized by linear indentations or channels on surface.",
    "honeycombed": "Characterized by interconnected empty spaces in a repeated pattern.",
    "interlaced": "Characterized by crosswise intertwined threads or elements.",
    "knitted": "Interlaced yarns creating an elastic and warm material.",
    "lacelike": "Interconnected patterns offering intricate detail and delicacy.",
    "lined": "Characterized by continuous, longitudinally aligned elements.",
    "marbled": "Marbled connotes an intertwined, irregular pattern of differing elements.",
    "matted": "Density and intertwining of elements causing a flat surface.",
    "meshed": "Interlaced structure enhancing tactility and durability.",
    "paisley": "Complex arrangements of teardrop-shaped motifs, abstract kaleidoscopic designs.",
    "perforated": "Characterized by a series of holes or openings throughout.",
    "pitted": "Characterized by depth-varied, intersectional hollows or cavities.",
    "pleated": "Characterized by folded or crease-like patterns.",
    "polka-dotted": "Patterned with large, equally spaced, repeating dots.",
    "porous": "Allows passage of liquids/gases due to numerous tiny holes.",
    "potholed": "Characterized by irregularities and disruptions on the surface.",
    "scaly": "Characterized by overlapping, usually hard segments.",
    "smeared": "Presence of dispersed or spread out elements within a composition.",
    "spiralled": "Pattern repeats in a winding, continuous circular motion.",
    "sprinkled": "Randomly dispersed elements across a surface.",
    "stained": "Stained implies an unintended alteration or mark due to foreign substances.",
    "stratified": "Characterized by distinct horizontal layers.",
    "striped": "Consistent pattern of alternating, parallel bands.",
    "studded": "Emphasizes tactile experience with defined, protruding elements.",
    "swirly": "Distinctly random and complex pattern layout, offering dynamic movement feel.",
    "veined": "Features linear patterns resembling a network of vessels or leaves.",
    "waffled": "Characterized by a pattern of repeated squares, typically indented.",
    "woven": "Interlaced threads providing strength and flexibility.",
    "wrinkled": "Characterized by irregular surfaces or patterns, not smooth.",
    "zigzagged": "Characterized by frequent directional changes, not straight or uniform."
}