{
    "707-320": "Intercontinental range with two turbofan engines.",
    "727-200": "High fuel efficiency with advanced noise reduction technology.",
    "737-200": "Equipped with powerful, noise-prone low-bypass turbojet engines.",
    "737-300": "Equipped with high-bypass turbofan engines for fuel efficiency.",
    "737-400": "Shorter fuselage and higher passenger capacity than other 737 models.",
    "737-500": "Shorter fuselage variant of classic 737 series.",
    "737-600": "Shortest fuselage among Boeing 737 Next Generation series.",
    "737-700": "Short to medium range, single aisle, twin-engine jetliner.",
    "737-800": "Advanced fuel efficiency with two CFM56-7B27 engines.",
    "737-900": "Longest variant in Boeing's 737 Next Generation series.",
    "747-100": "First wide-body, twin-aisle airliner in commercial aviation.",
    "747-200": "Unique upper-deck lounge, greater fuel capacity for longer range",
    "747-300": "Equipped with a S-duct tail engine.",
    "747-400": "Longest range of any standard body airliner.",
    "757-200": "Twin-engine, narrow-body jetliner with longest range in 757 family.",
    "757-300": "Longest single-aisle twinjet aircraft in production globally.",
    "767-200": "Extended range with twin-engine efficiency.",
    "767-300": "Extended range with winglets for increased fuel efficiency.",
    "767-400": "Extended range and increased seating capacity over earlier models.",
    "777-200": "Longest range capability in the Boeing 777 series.",
    "777-300": "Extended body for increased passenger capacity.",
    "A300B4": "Four-engine wide-body airliner, highest passenger capacity in A300 series.",
    "A310": "First twin-engine widebody to get ETOPS certification.",
    "A318": "Shortest fuselage length in Airbus A320 family.",
    "A319": "Maximum range of 3,700 nautical miles on a single fueling.",
    "A320": "Unique digital fly-by-wire flight control system.",
    "A321": "Features under-wing mounted engines with digital fly-by-wire controls.",
    "A330-200": "Long-haul range with high fuel efficiency.",
    "A330-300": "Extended range with twin-engine efficiency.",
    "A340-200": "Long-range, twin-aisle cabin, lower deck holds passenger facilities.",
    "A340-300": "Long-range, four-engine wide-body commercial passenger jet airliner.",
    "A340-500": "Ultra-long-range capabilities, highest fuel capacity among A340s.",
    "A340-600": "Longest fuselage length in A340 family.",
    "A380": "Largest passenger capacity in commercial aviation.",
    "ATR-42": "Propulsion by twin turboprop engines.",
    "ATR-72": "ATR-72: Unique twin-turboprop regional airliner with high fuel efficiency.",
    "An-12": "Four turboprop engines with contra-rotating propellers.",
    "BAE 146-200": "Equipped with unique high-wing, four-engine noise reduction system.",
    "BAE 146-300": "Equipped with four turbofan engines for short, steep approach landings.",
    "BAE-125": "BAE-125 boasts exceptional short runway performance for its class.",
    "Beechcraft 1900": "Equipped with dual Pratt & Whitney PT6A turboprop engines.",
    "Boeing 717": "Short-haul, twin-engine jet, highest efficiency in its class.",
    "C-130": "Four-engine turboprop military transport capabilities.",
    "C-47": "Dakota, Workhorse of WWII, Capable of Carrying 6000lbs Cargo.",
    "CRJ-200": "Short-haul reach with exceptional fuel efficiency.",
    "CRJ-700": "Short to mid-range flights, dual-class seating cabin configuration.",
    "CRJ-900": "Longest range in Bombardier's regional jet category.",
    "Cessna 172": "High-wing, four-seat, single-engine light aircraft.",
    "Cessna 208": "Equipped with single turboprop engine for efficient performance.",
    "Cessna 525": "Equipped with FJ44 engines for increased speed and range.",
    "Cessna 560": "Unique twin-jet propulsion for greater speed and efficiency.",
    "Challenger 600": "Long range, wide-bodied corporate jet with low operating costs.",
    "DC-10": "DC-10 features three-engine design for long distance flights.",
    "DC-3": "DC-3: Revolutionized air transport with its speed and long-range capabilities.",
    "DC-6": "Four-engine propeller-driven strategic airlifter.",
    "DC-8": "DC-8: First commercial jetliner to exceed speed of sound.",
    "DC-9-30": "DC-9-30 features a rear-mounted twin-engine configuration.",
    "DH-82": "DH-82 features a unique tandem, open-cockpit layout.",
    "DHC-1": "DHC-1 is notable for its ability to perform STOL (Short Takeoff and Landing).",
    "DHC-6": "Short takeoff and landing (STOL) capabilities.",
    "DHC-8-100": "Turboprop engine with high-wing and T-tail design.",
    "DHC-8-300": "Short-haul flights with high frequency, turboprop engine.",
    "DR-400": "Fixed tricycle undercarriage, four-seat light aircraft.",
    "Dornier 328": "High speed turboprop with Short Take-Off and Landing capabilities.",
    "E-170": "Enhanced fuel efficiency with dual-engine design.",
    "E-190": "E-190 features a fly-by-wire control system, unique in its category.",
    "E-195": "Extended range with fuel-efficient, low-emission turbofan engines.",
    "EMB-120": "Twin-turboprop regional airliner with short-to-medium range capability.",
    "ERJ 135": "Tail-mounted engines and longer range capabilities.",
    "ERJ 145": "Advanced digital avionic system with twin Rolls-Royce engines.",
    "Embraer Legacy 600": "Range of 3,400 nautical miles with 13 passengers.",
    "Eurofighter Typhoon": "Capstone of multirole agility, superior kinetics, and supersonic speed.",
    "F-16A/B": "Single-engine supersonic multirole fighter aircraft.",
    "F/A-18": "Twin-engine, supersonic, all-weather multirole combat jet capability.",
    "Falcon 2000": "Transcontinental range with advanced flight control technology.",
    "Falcon 900": "Three-engine configuration for long-range intercontinental flights.",
    "Fokker 100": "Unique T-tail and Rolls-Royce Tay turbofan engines design.",
    "Fokker 50": "Powered by two Pratt & Whitney Canada turboprop engines.",
    "Fokker 70": "Advanced low-weight, fuel-efficient regional jet technology.",
    "Global Express": "Ultra-long-range flight capacity with optimal speed efficiency.",
    "Gulfstream IV": "Long-range jets with fast cruise speeds & fuel efficiency.",
    "Gulfstream V": "Transcontinental range without refueling: 6,500 nautical miles.",
    "Hawk T1": "Advanced tandem cockpit training and light attack aircraft.",
    "Il-76": "Equipped with unique 4-engine turbofans configuration.",
    "L-1011": "Three-engine design, located in rear fuselage and wings.",
    "MD-11": "MD-11 features a tri-jet configuration for extended range capability.",
    "MD-80": "Rear-mounted engines for improved noise reduction in cabin.",
    "MD-87": "Rear-mounted engines and T-tail configuration.",
    "MD-90": "MD-90 utilizes advanced International Aero Engines V2500 turbofans.",
    "Metroliner": "Twin-engine, high-speed, pressurized commuter and regional aircraft.",
    "Model B200": "Equipped with unique dual turboprop engines for efficient performance.",
    "PA-28": "Single-engine, tricycle landing gear, low-wing, aerial aircraft.",
    "SR-20": "Single-engine with advanced avionic technology",
    "Saab 2000": "Longest range among turboprop airliners.",
    "Saab 340": "Equipped with a twin-turboprop engines for short-haul flights.",
    "Spitfire": "Spitfire: Renowned for exceptional performance during World War II.",
    "Tornado": "Variable-sweep wing for optimal performance at various speeds.",
    "Tu-134": "Rear-mounted engines and a glazed-nose design for navigator position.",
    "Tu-154": "Triple-engine design for optimal efficiency and performance.",
    "Yak-42": "Three-engined rear-mounted jet configuration."
}