{
    "apple pie": "Sweet, baked dessert with a fruit filling, typically apples.",
    "baby back ribs": "Smoked pork ribs with a tangy-sweet BBQ sauce.",
    "baklava": "Layered pastry dessert, sweetened with syrup or honey.",
    "beef carpaccio": "Thinly sliced raw beef, often served with a vinaigrette.",
    "beef tartare": "Raw meat dish, often seasoned and served with accompaniments.",
    "beet salad": "Prepared with roasted or boiled beets, often paired with goat cheese.",
    "beignets": "Deep-fried dough served with generous dusting of powdered sugar.",
    "bibimbap": "Korean dish of mixed ingredients served over rice.",
    "bread pudding": "Savory or sweet dish made of stale bread soaked in liquid.",
    "breakfast burrito": "Filled with eggs, meat, and cheese, traditionally wrapped in tortilla.",
    "bruschetta": "Garlic-infused, grilled bread topped with diced tomatoes and basil.",
    "caesar salad": "Romaine lettuce tossed with croutons, parmesan, and Caesar dressing.",
    "cannoli": "Tube-shaped Italian pastry filled with sweet, creamy filling.",
    "caprese salad": "Tomatoes, mozzarella, basil, olive oil, and balsamic glaze.",
    "carrot cake": "Moist cake baked with grated carrots and typically spiced.",
    "ceviche": "Ceviche is raw seafood marinated in citrus juices, typically lemon or lime.",
    "cheese plate": "Assortment of diverse cheeses, often served with accompaniments.",
    "cheesecake": "Rich, creamy dessert with a crumbly crust, often sweetened.",
    "chicken curry": "Spicy, aromatic, stewed chicken in a fragrant curry sauce.",
    "chicken quesadilla": "Filled with cheese and chicken, folded in a tortilla.",
    "chicken wings": "Marinated and cooked chicken segment, often served with dipping sauce.",
    "chocolate cake": "Rich, sweet flavor with a moist, dense texture.",
    "chocolate mousse": "Fluffy, chilled dessert with rich chocolaty flavor.",
    "churros": "Sweet fried dough, often cinnamon-sugar coated, Spanish origins.",
    "clam chowder": "Creamy soup with clams, potatoes, onions, and celery.",
    "club sandwich": "Three bread layers, typically filled with chicken, bacon, lettuce, tomato.",
    "crab cakes": "Flavorful crab meat formed into a patty and pan-fried.",
    "creme brulee": "Caramelized sugar crust over creamy custard base.",
    "croque madame": "Ham and cheese sandwich topped with a fried egg.",
    "cup cakes": "Sweet, individual-serving cakes, often frosted and varied flavors.",
    "deviled eggs": "Hard-boiled eggs filled with creamy, often tangy yolk mixture.",
    "donuts": "Deep-fried, sweet, circular dough often filled or topped.",
    "dumplings": "Filled pockets of dough, often boiled or steamed.",
    "edamame": "Edamame: Immature soybeans, traditionally steamed in their pods.",
    "eggs benedict": "Poached eggs atop ham, English muffin, covered in hollandaise sauce.",
    "escargots": "Edible snails traditionally served in French cuisine.",
    "falafel": "Deep-fried chickpea balls with Middle Eastern spices.",
    "filet mignon": "Premium tender cut of beef, typically lean and small.",
    "fish and chips": "Deep-fried, traditional British meal, served with salt and vinegar.",
    "foie gras": "Luxuriously rich, creamy texture with deep, delicate flavor.",
    "french fries": "Fried, thin potato strips often seasoned with salt.",
    "french onion soup": "Caramelized onions in a beef broth, topped with melted cheese.",
    "french toast": "Eggy, sweet bread, pan-fried, often topped with syrup.",
    "fried calamari": "Battered, deep-fried squid rings, often served with marinara.",
    "fried rice": "Stir-fried mixture of rice, vegetables, and often meat or seafood.",
    "frozen yogurt": "Cold, creamy dessert made by fermenting dairy product with bacteria.",
    "garlic bread": "Distinctly flavored with garlic, often buttery, served as side dish.",
    "gnocchi": "An Italian pasta made from potato, semolina, or wheat flour.",
    "greek salad": "Feta cheese, olives, and fresh vegetables tossed in olive oil.",
    "grilled cheese sandwich": "Melted cheese between toasted bread slices.",
    "grilled salmon": "Rich, oily flavor with smooth, firm texture; cooked over fire.",
    "guacamole": "Mexican dip made primarily from ripe avocados.",
    "gyoza": "Japanese dumplings, typically filled with minced meat and vegetables.",
    "hamburger": "Stacked ingredients between two pieces of bread.",
    "hot and sour soup": "Tangy and spicy flavor, traditionally filled with various ingredients.",
    "hot dog": "Sausage served in a long, soft bread roll.",
    "huevos rancheros": "Mexican dish of eggs on tortillas with salsa and refried beans.",
    "hummus": "Mashed chickpeas blended with tahini, lemon juice, and garlic.",
    "ice cream": "Cold, sweet treat typically consumed for dessert.",
    "lasagna": "Layered pasta dish, often with cheese and tomato sauce.",
    "lobster bisque": "Smooth, creamy soup created using lobster shells and cognac.",
    "lobster roll sandwich": "Served cold, chunks of lobster meat mixed with light sauce, in a bun.",
    "macaroni and cheese": "Cheese-enriched, soft pasta in a creamy sauce.",
    "macarons": "Sweet, delicate almond meringue-based confections with ganache or jam filling.",
    "miso soup": "Japanese broth made from miso paste and dashi stock.",
    "mussels": "Edible marine bivalves with strong, dark hinged shells.",
    "nachos": "Layered and baked dish with corn chips, cheese, and toppings.",
    "omelette": "Beaten eggs cooked until set, often folded around fillings.",
    "onion rings": "Fried, crispy rings of sliced onion.",
    "oysters": "Edible, marine bivalves known for their unique, briny flavor.",
    "pad thai": "Stir-fried rice noodle dish, often served with tofu or shrimp.",
    "paella": "Spanish rice dish cooked in a flat, shallow pan.",
    "pancakes": "Fluffy, flat, round griddlecake known for sweet, indulgent taste.",
    "panna cotta": "An Italian dessert made of sweetened cream thickened with gelatin.",
    "peking duck": "Roasted duck with thin, crispy skin and tender meat, Beijing recipe.",
    "pho": "Vietnamese soup featuring broth, rice noodles, and herbs.",
    "pizza": "Traditionally topped with tomato sauce and cheese, baked flat.",
    "pork chop": "Marinated and cooked cut from a pig's loin or shoulder.",
    "poutine": "Canadian dish consisting of fries, cheese curds, and gravy.",
    "prime rib": "Slow-roasted, tender beef cut from the primal rib section.",
    "pulled pork sandwich": "Slow-cooked pork, shredded and often served with barbecue sauce.",
    "ramen": "Japanese noodle soup with meat or vegetable broth, often flavored with soy or miso.",
    "ravioli": "Stuffed pasta with various fillings, typically square shape.",
    "red velvet cake": "Sweet, tangy flavor with rich cream cheese frosting.",
    "risotto": "Risotto is a creamy, often cheesy, Italian rice dish.",
    "samosa": "Triangular, stuffed with spiced vegetables or meat, deep-fried.",
    "sashimi": "Raw, thinly sliced seafood or meat, traditionally Japanese.",
    "scallops": "Tender, sweet marine taste with a slightly soft texture.",
    "seaweed salad": "Unique umami taste with a crisp, slightly chewy texture.",
    "shrimp and grits": "Savory seafood served with creamy, corn-based porridge.",
    "spaghetti bolognese": "Slow-cooked ragu sauce paired with long, thin pasta.",
    "spaghetti carbonara": "Made with egg, cheese, pancetta, and pepper.",
    "spring rolls": "Filled and rolled appetizer, often fried, prevalent in Asian cuisine.",
    "steak": "Tender, juicy meat piece, often cooked by grilling or broiling.",
    "strawberry shortcake": "Sweet, layered dessert featuring strawberries and whipped cream.",
    "sushi": "Raw fish and rice roll, often consumed with wasabi and soy.",
    "tacos": "Filled with various ingredients, folded inside a tortilla.",
    "takoyaki": "Japanese ball-shaped snack filled with diced octopus.",
    "tiramisu": "An Italian dessert featuring layers of coffee-soaked ladyfingers and mascarpone cream.",
    "tuna tartare": "Raw diced tuna with seasonings, served uncooked.",
    "waffles": "Grid-patterned with a crisp exterior and fluffy interior."
}