{
    "abyssinian": "Affectionate, playful, with a quiet, gentle temperament.",
    "american bulldog": "Exceptionally strong, fearless, and versatile working dog breed.",
    "american pit bull terrier": "Exceptionally strong and agile with a tenacious temperament.",
    "basset hound": "Exceptionally keen sense of smell, second only to the Bloodhound.",
    "beagle": "Exceptionally keen sense of smell, second only to Bloodhounds.",
    "bengal": "Bengal breed: Exceptionally active and playful with a wild-like demeanor.",
    "birman": "Birman: Known for quiet, gentle, companionable nature.",
    "bombay": "Bombay pets are known for their sociable and affectionate nature.",
    "boxer": "Boxers are known for their energetic, playful, and good-natured temperament.",
    "british shorthair": "Known for distinct robust health and calm, easygoing temperament.",
    "chihuahua": "Chihuahuas are known for their exceptional loyalty to a single owner.",
    "egyptian mau": "Known for their exceptionally fast running speed.",
    "english cocker spaniel": "Exceptionally sociable and affectionate with high energy levels.",
    "english setter": "Exceptionally friendly and gentle temperament.",
    "german shorthaired": "Highly energetic with intense bird-chasing instinct.",
    "great pyrenees": "Gentle and confident, known for their nurturing temperament.",
    "havanese": "Exceptionally sociable and interactive with humans and dogs alike.",
    "japanese chin": "Japanese Chins are known for their cat-like personality traits.",
    "keeshond": "Keeshond: Energetic, friendly, quick learners and extremely attached to family.",
    "leonberger": "Remarkably gentle temperament, especially affectionate with children.",
    "maine coon": "Maine Coons are known for their distinctive chirping vocalizations.",
    "miniature pinscher": "Renowned for boundless energy and assertive nature.",
    "newfoundland": "Exceptional swimming ability due to webbed feet.",
    "persian": "Renowned for their gentle, calm and affectionate temperament.",
    "pomeranian": "Known for their eager-to-please and vivacious personality.",
    "pug": "Pugs are known for their exceptional clingy, affectionate personality.",
    "ragdoll": "Ragdolls are known for their docile and calm temperament.",
    "russian blue": "Known for their gentle, quiet, and reserved nature.",
    "saint bernard": "Exceptional rescue instincts and high altitude adaptability.",
    "samoyed": "Samoyeds are known for their friendly and gentle temperament.",
    "scottish terrier": "Known for their independent, quick-tempered yet intelligent personality.",
    "shiba inu": "Shiba Inu: Known for boldness, good-natured, alert, and confident temperament.",
    "siamese": "Siamese are known for their loud, low-pitched, persistent vocalization.",
    "sphynx": "Sphynx breed is famous for being hairless and extremely affectionate.",
    "staffordshire bull terrier": "Exceptionally courageous with an obedient and intelligent demeanor.",
    "wheaten terrier": "Wheaten Terriers are known for their playful and energetic temperament.",
    "yorkshire terrier": "Exceptionally spirited and determined small-sized dog breed."
}