{
    "abbey": "Religious site where monks or nuns reside and worship.",
    "airplane cabin": "Enclosed space designed for air travel comfort and safety.",
    "airport terminal": "Hub for airplane departures and arrivals, passenger services provided.",
    "alley": "Narrow pathway between buildings, often for pedestrians only.",
    "amphitheater": "Used for performances with audience surrounding the stage.",
    "amusement arcade": "A place for coin-operated entertainment and games.",
    "amusement park": "Experience centered on thrill and fun, typically with rides",
    "anechoic chamber": "Absorbs sound waves, virtually no echoes or reverberations.",
    "outdoor apartment building": "Multiple residential units within an external shared space.",
    "indoor apse": "Architectural feature typically found in religious buildings.",
    "aquarium": "A location specifically designed for housing and displaying aquatic life.",
    "aqueduct": "A structure conveying water over long distances.",
    "arch": "Characterized by a curved structure providing passage or support.",
    "archive": "Preservation and storage of historical documents or materials.",
    "outdoor arrival gate": "Entrance point for those coming from outdoor locations.",
    "art gallery": "A space dedicated to showcasing various forms of artistic work.",
    "art school": "Focused on nurturing creative and artistic skills development.",
    "art studio": "A space dedicated for creating and displaying artistic works.",
    "assembly line": "Sequential process for mass-producing a single product.",
    "outdoor athletic field": "Area specifically designed for organized outdoor sports activities.",
    "public atrium": "Large public space for socializing and relaxation within buildings.",
    "attic": "Storage area, typically located under the roof of a house.",
    "auditorium": "A space specifically designed for large group performances or gatherings.",
    "auto factory": "Production line for assembling automobiles",
    "badlands": "Erosion-intensive terrain with minimal vegetation and harsh conditions.",
    "indoor badminton court": "Enclosed space designed specifically for playing badminton.",
    "baggage claim": "Area for passengers to retrieve their checked luggage.",
    "shop bakery": "Aroma of fresh bread and sweet pastries baking.",
    "exterior balcony": "Outdoor space attached to building, usually accessible from inside.",
    "interior balcony": "Indoor space overlooking lower-level sections of the same structure.",
    "ball pit": "Filled with soft balls for children's safe and fun play.",
    "ballroom": "Dedicated space for social dancing with live music.",
    "bamboo forest": "Dense collection of bamboo plants creating a unique, serene echo.",
    "banquet hall": "Designed for hosting large social gatherings or events.",
    "bar": "A place for alcohol consumption and social interaction.",
    "barn": "Structure usually used for storage and shelter in rural areas.",
    "barndoor": "Characterized by rural lifestyle related to agricultural settings.",
    "baseball field": "A designated area for playing the game of baseball.",
    "basement": "Underground space primarily used for storage or utilities.",
    "basilica": "Architectural structure primarily used for religious activities",
    "outdoor basketball court": "Used for playing basketball in open-air environment.",
    "bathroom": "Room specifically designed for personal hygiene activities.",
    "batters box": "Area where a baseball player stands to hit the ball.",
    "bayou": "Slow-moving, water-dominated environments rich in biodiversity.",
    "indoor bazaar": "Enclosed space featuring multiple vendors selling various goods.",
    "outdoor bazaar": "Open-air marketplace for buying and selling a variety of goods.",
    "beach": "Sound of crashing waves and the sensation of sand.",
    "beauty salon": "Offers services focused on personal aesthetic enhancement.",
    "bedroom": "A space primarily designated for rest or sleep.",
    "berth": "Reserved space for accommodation or parking in transportation.",
    "biology laboratory": "Experimentation and research on living organisms.",
    "indoor bistro": "Small venue serving food and drinks in an intimate setting.",
    "boardwalk": "Boardwalk: A pathway typically constructed alongside or over water.",
    "boat deck": "Location for steering and controlling a water-borne vessel.",
    "boathouse": "Structure designed for storing and protecting boats.",
    "bookstore": "A place specifically designated for buying various books.",
    "indoor booth": "Enclosed space typically utilized for individual or small group activities.",
    "botanical garden": "Collection of diverse plant species for scientific and educational purposes.",
    "indoor bow window": "Architectural design allowing more natural light indoors.",
    "outdoor bow window": "A window that protrudes outward, enhancing exterior architectural design.",
    "bowling alley": "Activity area specifically equipped for bowling games.",
    "boxing ring": "Site for regulated hand-to-hand combat sports events.",
    "indoor brewery": "Production and tasting of beer in an indoor setting.",
    "bridge": "Connects two points over an obstacle, often water.",
    "building facade": "Exterior interface between a building and the environment.",
    "bullring": "A venue dedicated to bullfighting events.",
    "burial chamber": "Designed for interment or entombment of the deceased.",
    "bus interior": "Presence of multiple seats arranged in rows for passenger transport.",
    "butchers shop": "Selling of raw meats and related products.",
    "butte": "A flat-topped elevated landform, isolated from surrounding terrain.",
    "outdoor cabin": "Exposure to nature and elements, providing rustic lifestyle experience.",
    "cafeteria": "A place for preparing, serving, and consuming food collectively.",
    "campsite": "Outdoor location designed for overnight stays in nature.",
    "campus": "Location of educational institutions with various learning facilities.",
    "natural canal": "Waterway naturally formed by geological and hydrological processes.",
    "urban canal": "Man-made waterway traversing through a city area.",
    "candy store": "Sells sweets and confections, often in decorative or festive packaging.",
    "canyon": "Deep, narrow valley with steep sides formed by weathering and erosion.",
    "backseat car interior": "Presence of rear seats, often indicative of passenger transport.",
    "frontseat car interior": "Presence of steering wheel and dashboard controls",
    "carrousel": "Rotating platform for amusement, often featuring horses.",
    "indoor casino": "Gambling activities in a confined indoor environment.",
    "castle": "Historical stronghold, often royal or noble residence.",
    "catacomb": "Underground burial site, historically for Christian rituals.",
    "indoor cathedral": "Unique acoustics enhanced by vast, high-structured architecture.",
    "outdoor cathedral": "Ambience of worship in nature's encompassing presence.",
    "indoor cavern": "Enclosed space, echoing sounds, cool temperature, often damp.",
    "cemetery": "Location specifically designated for burying the dead.",
    "chalet": "Alpine-influenced architecture often used for holiday homes.",
    "cheese factory": "Production site for converting milk into cheese.",
    "chemistry lab": "Conducting experiments with chemicals and scientific equipment.",
    "indoor chicken coop": "Designed for sheltering and rearing chickens indoors.",
    "outdoor chicken coop": "Area designated for housing and protecting live chickens.",
    "childs room": "Presence of toys, children's furniture, and playful atmosphere.",
    "indoor church": "Religious gathering location within a building.",
    "outdoor church": "Religious activities conducted in open-air settings.",
    "classroom": "Location for collective knowledge acquisition and interactive learning.",
    "clean room": "Strict control over environmental contaminants.",
    "cliff": "Steep elevation change with potential for significant fall.",
    "indoor cloister": "Structured enclosure within buildings, promoting solitude and reflection.",
    "closet": "Storage space specifically designed for apparel and accessories.",
    "clothing store": "Sells wearable items, focused predominantly on fashion and individual style.",
    "coast": "Presence of land meeting large expanses of water.",
    "cockpit": "Control center for piloting aircraft or spacecraft.",
    "coffee shop": "Serves a variety of coffee and often light meals.",
    "computer room": "Equipped with numerous computers and related technology.",
    "conference center": "Venue specifically designated for hosting large meetings, exhibitions.",
    "conference room": "A space designated for group meetings and discussions.",
    "construction site": "Presence of active building or infrastructure development.",
    "control room": "Centralized command and supervision of operations.",
    "outdoor control tower": "Coordinates outdoor activities and movements from a centralized point.",
    "corn field": "Cultivated for corn production, often in large, open expanses.",
    "corral": "Area specifically designated for confining and managing livestock.",
    "corridor": "A pathway connecting multiple rooms or areas.",
    "cottage garden": "Dominated by plants, often closely packed and informal arrangement.",
    "courthouse": "Place for judicial proceedings and legal matters resolution.",
    "courtroom": "Place where legal trials and judicial proceedings are conducted.",
    "courtyard": "Open, communal space within a building complex.",
    "exterior covered bridge": "Structure connecting two points, sheltered and exposed to outdoors.",
    "creek": "Characterized by flowing water in a narrow channel.",
    "crevasse": "Deep, long crack in glacier or ice sheet.",
    "crosswalk": "Area specifically designed for pedestrian road crossing.",
    "office cubicle": "Enclosed workspace in an office environment.",
    "dam": "Structure that controls, stores, or redirects water flow.",
    "delicatessen": "Sells specialty food items, often foreign or gourmet.",
    "dentists office": "Presence of dental equipment and professionals providing oral care.",
    "sand desert": "Extreme heat, lack of vegetation, and arid conditions.",
    "vegetation desert": "Low rainfall and sparse plant life.",
    "indoor diner": "Eating area within an enclosed space, typically a restaurant.",
    "outdoor diner": "Eating in an open-air setting, exposed to natural environment.",
    "home dinette": "Space for eating and socializing within a residential setting.",
    "vehicle dinette": "Combination of transportation and dining space functionality.",
    "dining car": "Area designated for eating and drinking on a moving train.",
    "dining room": "A space primarily used for consuming prepared meals.",
    "discotheque": "Loud music, dance ambiance, and social interaction.",
    "dock": "Location for loading, unloading, repair and mooring of vessels.",
    "outdoor doorway": "Access point between indoor setting and outdoor environment.",
    "dorm room": "Space shared for sleeping and studying in educational institutions.",
    "driveway": "Pathway specifically designed for vehicles towards private property.",
    "outdoor driving range": "Practice area for golfers to hit balls in open space.",
    "drugstore": "Sale of prescription and over-the-counter medication.",
    "electrical substation": "Area designated for manipulating and distributing electrical power.",
    "door elevator": "Transportation method vertically through floors in buildings",
    "interior elevator": "Transportation method within buildings across different levels.",
    "elevator shaft": "Vertical transportation channel in buildings.",
    "engine room": "Center for running and controlling machinery operations.",
    "indoor escalator": "Motorized staircase facilitating indoor vertical movement.",
    "excavation": "Active process of unearthing buried artifacts or geological structures.",
    "indoor factory": "Manufacturing processes happening within a closed venue.",
    "fairway": "Area in a golf course between the tee and the green.",
    "fastfood restaurant": "Quick service for pre-prepared or easily prepared food.",
    "cultivated field": "Area specifically prepared and used for growing crops.",
    "wild field": "Untamed natural landscape, free from human intervention or cultivation.",
    "fire escape": "Designed for emergency evacuation during fire incidents.",
    "fire station": "Emergency response center for firefighting and rescue operations.",
    "indoor firing range": "Place for practicing firearm shooting in a controlled environment.",
    "fishpond": "Location where aquatic animals are raised commercially.",
    "indoor florist shop": "Presence of various indoor plants and floral arrangements for sale.",
    "food court": "Variety of food vendors in a shared seating space.",
    "broadleaf forest": "Diverse plant species with leaves wider than conifers.",
    "needleleaf forest": "Dominance of evergreen, needle-leaved, coniferous trees.",
    "forest path": "Surrounded by trees, often used for hiking, walking, or leisure.",
    "forest road": "An unconstructed path surrounded by dense vegetation.",
    "formal garden": "Structured layout with controlled nature elements.",
    "fountain": "Water spouting or flowing into a basin for aesthetic purpose.",
    "galley": "A long, narrow kitchen in a restaurant or ship.",
    "game room": "Place specifically designed for playing games, often interactive.",
    "indoor garage": "Space specifically designed for storing and protecting vehicles indoors.",
    "garbage dump": "Presence of discarded waste materials and unpleasant odor.",
    "gas station": "Provides fuel and common convenience store items for travelers.",
    "exterior gazebo": "Outdoor structure for relaxation, entertainment, and shelter.",
    "indoor general store": "Stocks variety of household goods for daily needs indoors.",
    "outdoor general store": "Sells equipment and supplies for outdoor recreational activities.",
    "gift shop": "Location where various items are purchased for gifting.",
    "golf course": "Area specifically designed for playing golf.",
    "indoor greenhouse": "Controlled environment for plant growth inside a building.",
    "outdoor greenhouse": "Controlled environment for plant cultivation in outdoor settings.",
    "indoor gymnasium": "Sporting equipment usage in a closed, controlled environment.",
    "indoor hangar": "Enclosed location for storing and maintaining aircraft.",
    "outdoor hangar": "Storage space for vehicles, primarily aircraft, exposed to outside.",
    "harbor": "A place for ships to dock and load or unload goods.",
    "hayfield": "Place of commercial hay cultivation and storage.",
    "heliport": "Specifically designed for helicopter landing and takeoff.",
    "herb garden": "Presence of diverse aromatic plants for culinary or medicinal purposes.",
    "highway": "Designed for high-speed, unimpeded travel for multiple vehicles.",
    "hill": "Elevated landform, lower than a mountain, with sloping surfaces.",
    "home office": "Space specifically designed for conducting professional work at home.",
    "hospital": "Place dedicated to treating illnesses and injuries.",
    "hospital room": "Presence of medical equipment and focus on patient care.",
    "hot spring": "Natural geothermally heated water emanating from earth's crust.",
    "outdoor hot tub": "Presence of warm water for leisurely relaxation in open air.",
    "outdoor hotel": "Accommodation integrated with natural surroundings for an outdoor experience.",
    "hotel room": "A space specifically designated for temporary, overnight accommodation.",
    "house": "A place primarily designed for residential living and comfort.",
    "outdoor hunting lodge": "Activities focused on hunting and wilderness survival experiences.",
    "ice cream parlor": "Offering a variety of flavored frozen dairy products.",
    "ice floe": "A floating sheet of ice separated from its original ice formation.",
    "ice shelf": "Large, floating platform of glacier-derived ice on the ocean.",
    "indoor ice skating rink": "Enclosed space for ice-based skating activities.",
    "outdoor ice skating rink": "Presence of ice for recreational skating outdoors",
    "iceberg": "Massive floating body of fresh water from glacial origins.",
    "igloo": "Dome-shaped dwelling made from blocks of snow by Inuit.",
    "industrial area": "Characterized by intense manufacturing or tech-related activities.",
    "outdoor inn": "Open-air lodging with natural surroundings and adventurous activities.",
    "islet": "Small isolated land mass surrounded by water.",
    "indoor jacuzzi": "Water-filled tub with hydrotherapy features, indoors.",
    "indoor jail": "Confined space designed for confinement and correctional purposes.",
    "jail cell": "Confined space for holding individuals under legal detention.",
    "jewelry shop": "Sells precious stones and metals crafted into adornments.",
    "kasbah": "A fortified, traditional village or city area in North Africa.",
    "indoor kennel": "Area specifically designed for housing pets indoors",
    "outdoor kennel": "Enclosed area specifically for pets' outdoor activity.",
    "kindergarden classroom": "Presence of young children engaged in early learning activities.",
    "kitchen": "Place for preparing and cooking food.",
    "kitchenette": "Area specially designed for cooking and food preparation.",
    "outdoor labyrinth": "A maze-like space exposed to open air, navigated for leisure or challenge.",
    "natural lake": "Formed naturally by geological and environmental processes.",
    "landfill": "A place dedicated to waste disposal and management.",
    "landing deck": "Area used for aircrafts landing and taking-off on vessels.",
    "laundromat": "A place specifically equipped for public clothes washing.",
    "lecture room": "Place designed for learning through expert-led discussions.",
    "indoor library": "Quiet space dedicated to reading and study with book resources.",
    "outdoor library": "Reading and learning in a natural, open-air environment.",
    "outdoor lido deck": "Open-air, pool-centric, versatile recreational space on a ship.",
    "lift bridge": "Bridge with a movable segment for passing of tall vessels.",
    "lighthouse": "Guides maritime navigation with illuminating signals.",
    "limousine interior": "Luxury and privacy features designed for passenger comfort.",
    "living room": "Area primarily for socializing and relaxation within a home.",
    "lobby": "Area for waiting and transitioning between building's entrances/exits.",
    "lock chamber": "Facilitates movements of vessels between different water levels.",
    "locker room": "A space specifically designated for changing clothes post-exercise.",
    "mansion": "Large, luxurious dwelling, typically associated with wealth and prestige.",
    "manufactured home": "Pre-fabricated structure designed for permanent residential use.",
    "indoor market": "Enclosed space for buying and selling variety of goods.",
    "outdoor market": "Open-air space for buying and selling goods.",
    "marsh": "Wetland area filled with a variety of aquatic plants and wildlife.",
    "martial arts gym": "Practice and training space for combat skills and techniques.",
    "mausoleum": "A structure housing interred remains, typically of notable individuals.",
    "medina": "Historic Islamic city center with narrow, winding streets.",
    "water moat": "Surrounds structures for defense or aesthetic purposes.",
    "outdoor monastery": "Presence of religious practices in an open environment.",
    "indoor mosque": "Indoor space primarily used for Islamic prayer and worship.",
    "outdoor mosque": "Open-air place for Islamic worship and prayer activities.",
    "motel": "Temporary lodging designed for motorists, typically roadside.",
    "mountain": "High altitude terrain with diverse ecosystems and climates.",
    "mountain snowy": "High altitude, cold temperature, and often challenging accessibility.",
    "indoor movie theater": "Unique acoustics and controlled lighting for optimal film viewing.",
    "indoor museum": "Collection of artefacts displayed for public education and enjoyment.",
    "music store": "Selling various musical instruments and related accessories.",
    "music studio": "Creation and recording of musical compositions and performances.",
    "outdoor nuclear power plant": "Generates electricity utilizing nuclear reactions in an open environment.",
    "nursery": "Place for caring and nurturing young children or plants.",
    "oast house": "Specialized in drying hops for brewing beer.",
    "outdoor observatory": "Observation of natural phenomena in open-air settings.",
    "ocean": "Contains vast bodies of saltwater, rich in biodiversity.",
    "office": "Place for professional tasks, meetings and administrative work.",
    "office building": "Location utilized for professional or business activities.",
    "outdoor oil refinery": "Processing and conversion of crude oil into petroleum products.",
    "oilrig": "Extraction and processing site for underground oil reserves.",
    "operating room": "Site of surgical procedures, sterile environment crucial.",
    "orchard": "Presence of multiple fruit trees grown for harvest.",
    "outdoor outhouse": "Presence of a standalone, self-contained exterior toilet facility.",
    "pagoda": "Multi-tiered tower structure, often for Buddhist religious purposes.",
    "palace": "A location for royal residence or governance activities.",
    "pantry": "Storehouse for mainly food-related items in residential locations.",
    "park": "A place for outdoor recreation, relaxation, and nature appreciation.",
    "indoor parking garage": "Enclosed space for vehicle storage and protection.",
    "outdoor parking garage": "Area specifically designed for off-street vehicle storage.",
    "parking lot": "Area designated for vehicle storage and temporary immobilization.",
    "parlor": "A social gathering space for conversation and leisure activities.",
    "pasture": "Area primarily used for the grazing of livestock.",
    "patio": "Outdoor space primarily used for dining or recreation.",
    "pavilion": "A structure for relaxation and entertainment in public spaces.",
    "pharmacy": "Location where prescription drugs are dispensed.",
    "phone booth": "A space specifically designed for making telephone calls.",
    "physics laboratory": "Experimentation and application of physical principles.",
    "picnic area": "Outdoor space primarily used for al fresco dining and relaxation.",
    "indoor pilothouse": "Enclosed space for controlling indoor navigation and operations.",
    "outdoor planetarium": "Stargazing experience in an open-air environment.",
    "playground": "Area specifically designed for recreational activities, mostly for children.",
    "playroom": "Space designated for recreation and engaging in fun activities.",
    "plaza": "Public space for community gatherings and social activities.",
    "indoor podium": "Public speaking or presentation platform inside a building",
    "outdoor podium": "Open-air platform for public speaking events.",
    "pond": "Contains fresh or stagnant water in a small, natural basin.",
    "establishment poolroom": "Place for playing billiards or pool with others.",
    "home poolroom": "A space typically dedicated for billiard activities in a home.",
    "outdoor power plant": "Generation of electricity using natural environmental resources.",
    "promenade deck": "Open area for walking or relaxing on a ship.",
    "indoor pub": "Serves alcohol in a closed, communal setting.",
    "pulpit": "Associated with religious services and public speaking.",
    "putting green": "Place specifically designed for practicing golf putting strokes.",
    "racecourse": "Site for horse racing and betting activities.",
    "raceway": "A location for organized, competitive vehicle racing events.",
    "raft": "Floating transportation device generally used in recreational activities.",
    "railroad track": "Pathway for trains enabling smooth, long distance transportation.",
    "rainforest": "High biodiversity with warm, wet climate and dense vegetation.",
    "reception": "An event characterized by greeting and welcoming guests.",
    "recreation room": "A space specifically designed for leisure and entertainment activities.",
    "residential neighborhood": "Houses close together with shared communal amenities.",
    "restaurant": "Serving food and beverages for immediate consumption.",
    "restaurant kitchen": "Preparation and cooking of food for public consumption.",
    "restaurant patio": "Outdoor dining area associated with a restaurant.",
    "rice paddy": "Cultivation of rice in artificial water-filled fields.",
    "riding arena": "Place designed specifically for equestrian activities and training.",
    "river": "Constantly flowing body of water towards a sea or ocean.",
    "rock arch": "Natural bridge formation due to erosion and weathering",
    "rope bridge": "A bridge made from ropes, requiring careful balance to cross",
    "ruin": "Decayed structure due to abandonment or disaster.",
    "runway": "A location where aircraft take off and land.",
    "sandbar": "A shallow area in water bodies formed by deposited sediments",
    "sandbox": "A place of experimentation, creativity, and unrestricted play.",
    "sauna": "Characterized by high heat for relaxation and perspiration.",
    "schoolhouse": "Place of structured learning and knowledge acquisition.",
    "sea cliff": "High elevation adjacent to vast bodies of seawater",
    "server room": "High concentration of computing and networking equipment.",
    "shed": "Storage structure typically found in residential outdoor spaces.",
    "shoe shop": "Location where various types of footwear are sold.",
    "shopfront": "Area where goods, services are directly sold to customers.",
    "indoor shopping mall": "Enclosed space with multiple retail stores and food options.",
    "shower": "Presence of water and personal hygiene activity.",
    "skatepark": "Designed for skateboarding, BMX or rollerblading activities.",
    "ski lodge": "A location specifically designed for snow-based recreational activities.",
    "ski resort": "Location specifically designed for winter sports activities.",
    "ski slope": "Outdoor wintertime recreational activity location",
    "sky": "Continuous expanse, above earth, site of weather and flight.",
    "skyscraper": "Tallest habitable architectural structures in urban landscapes.",
    "slum": "High population density with poor living conditions.",
    "snowfield": "Cold, presence of snow, often uninhabited and quiet.",
    "squash court": "A playing area specifically designed for the sport of squash.",
    "stable": "Housing and caregiving space for domesticated livestock.",
    "baseball stadium": "Hosts baseball games with specific sporting facilities.",
    "football stadium": "Hosts football games with large crowd capacity.",
    "indoor stage": "Presence of live performances in a sheltered environment.",
    "staircase": "A structure for ascending and descending between different levels.",
    "street": "Public space for pedestrian and vehicular traffic flow.",
    "subway interior": "Presence of seats arranged linearly for public transportation.",
    "platform subway station": "Regular arrival and departure of subway trains.",
    "supermarket": "Place of purchasing daily groceries and household items.",
    "sushi bar": "Preparation and serving of raw fish with vinegared rice.",
    "swamp": "Wetland ecosystem housing diverse flora and fauna.",
    "indoor swimming pool": "Enclosed water area used for swimming activities.",
    "outdoor swimming pool": "Filled with water for recreational swimming activities outdoors.",
    "indoor synagogue": "Religious space for Jewish worship and congregational activities.",
    "outdoor synagogue": "Religious activities in open-air, predominantly Jewish setting.",
    "television studio": "Broadcasting live or pre-recorded programs to audiences.",
    "east asia temple": "Architectural style embodying significant religious and cultural beliefs.",
    "south asia temple": "Presence of religious elements specific to South Asian beliefs.",
    "indoor tennis court": "Specifically designed for playing tennis indoors",
    "outdoor tennis court": "Area specifically designed for playing tennis outdoors.",
    "outdoor tent": "Portable shelter utilized for camping or outdoor events.",
    "indoor procenium theater": "Specifically designed for live performance presentations.",
    "indoor seats theater": "Live performances presented in a closed, structured space.",
    "thriftshop": "Selling used or second-hand items at low cost.",
    "throne room": "Seat of power and decision-making for a monarchy.",
    "ticket booth": "Exchange of currency for event admission passes.",
    "toll plaza": "Collection point for road usage payments.",
    "topiary garden": "Artistic pruning and shaping of plants into sculptures.",
    "tower": "Tall structure for observation or communication purposes.",
    "toyshop": "Selling playthings primarily for children's entertainment.",
    "outdoor track": "Open space designed for running and athletic competitions.",
    "train railway": "Transportation channel involving tracks and locomotives.",
    "platform train station": "Transit hub for embarking and disembarking train passengers.",
    "tree farm": "Specialized for growing and nurturing various types of trees.",
    "tree house": "Elevated structure built among the branches of a tree.",
    "trench": "Long, narrow excavation below the ground level.",
    "coral reef underwater": "Diverse marine life biodiversity hotspot.",
    "utility room": "Room designated for household tasks, or storage.",
    "valley": "Valley: A low area between hills or mountains, often with a river.",
    "van interior": "Enclosed space designed for transportation of people or goods.",
    "vegetable garden": "Cultivation of edible plants primarily for home consumption",
    "veranda": "Outdoor living space often attached to a house.",
    "veterinarians office": "Presence of animals being medically treated and cared for.",
    "viaduct": "A bridge for crossing over obstacles like a valley or road.",
    "videostore": "Rents and sells physical/digital film and TV content.",
    "village": "Community living in close proximity and sharing common resources.",
    "vineyard": "A location where grapes are grown for wine production.",
    "volcano": "Eruption of molten lava from Earth's crust.",
    "indoor volleyball court": "Specific space for playing indoor volleyball games.",
    "outdoor volleyball court": "Presence of net and outdoor sandy terrain.",
    "waiting room": "A setting for anticipation before appointments or departures.",
    "indoor warehouse": "Storage of items in a controlled, covered environment.",
    "water tower": "Stores and supplies water at elevation for pressure and distribution.",
    "block waterfall": "Continuous flowing water down a structured, stepped surface.",
    "fan waterfall": "Sound of water echoing off multiple rock surfaces simultaneously.",
    "plunge waterfall": "Water descends vertically, losing contact with bedrock surface.",
    "watering hole": "Gathering place for animals to drink and socialize.",
    "wave": "Powerful display of oceanic energy in movement and rhythm.",
    "wet bar": "A area specifically designed for mixing and serving alcoholic drinks.",
    "wheat field": "Cultivated for grain, swaying with the wind.",
    "wind farm": "Site for harnessing energy from wind through turbines.",
    "windmill": "Converts wind energy into rotational energy for various uses.",
    "barrel storage wine cellar": "Storage and aging of wine in barrels underground.",
    "bottle storage wine cellar": "Specifically designed, climate-controlled environment for wine preservation.",
    "indoor wrestling ring": "Features professional wrestling activities within a confined space.",
    "yard": "Outdoor space typically associated with a residential dwelling.",
    "youth hostel": "Affordable shared lodging for travelers, often with communal facilities."
}