{
    "Apply Eye Makeup": "Utilizing tools and products to enhance or alter eye appearance.",
    "Apply Lipstick": "Application of color on lips for aesthetic enhancement.",
    "Archery": "Use of bow and arrow to hit a distant target.",
    "Baby Crawling": "Infants moving on hands and knees, pre-walking stage.",
    "Balance Beam": "Execution of precise movements on a narrow, elevated surface.",
    "Band Marching": "Coordinated movement synchronized to music, predominantly in parades.",
    "Baseball Pitch": "Throwing a ball for a batter to hit in a baseball game.",
    "Basketball": "Team-based gameplay with the objective of shooting a ball into a hoop.",
    "Basketball Dunk": "Leap and forceful downward throw of a ball into the hoop.",
    "Bench Press": "Lifting weighted barbell while lying on a bench",
    "Biking": "Human-powered locomotion using feet to drive two wheels.",
    "Billiards": "Striking balls with cue stick in strategic precision game.",
    "Blow Dry Hair": "Use of heat and air to style and dry hair",
    "Blowing Candles": "Act of extinguishing flames through air forced from one's mouth.",
    "Body Weight Squats": "Functional exercise, using own body weight for lower body strengthening.",
    "Bowling": "Throwing a ball to knock down pins at the end of a lane.",
    "Boxing Punching Bag": "Physical exertion focused on targeted, powerful movements.",
    "Boxing Speed Bag": "Rhythmic punching of a hanging small bag for agility training.",
    "Breast Stroke": "Swimming method employing simultaneous arm strokes and frog-like kick.",
    "Brushing Teeth": "Usage of toothbrush and toothpaste for oral hygiene.",
    "Clean And Jerk": "Olympic weightlifting technique involving two distinct movements.",
    "Cliff Diving": "Jumping from height into water for sport or recreation.",
    "Cricket Bowling": "Throwing a ball with a straight-arm in a fast, spinning manner.",
    "Cricket Shot": "Striking cricket ball with a bat in a regulated manner",
    "Cutting In Kitchen": "Involves manipulation of kitchen tools for food preparation.",
    "Diving": "Submersion in water utilizing specialized breathing apparatus.",
    "Drumming": "Producing rhythmic sounds by striking varied surfaces repetitively.",
    "Fencing": "Manual manipulation of a sword for sport or self-defense.",
    "Field Hockey Penalty": "Enforced consequence due to violation in field hockey rules.",
    "Floor Gymnastics": "Execution of acrobatic skills on flat surface without apparatus.",
    "Frisbee Catch": "Involves catching a flying disc, requiring hand-eye coordination skills.",
    "Front Crawl": "Continuous alternating arm movement with kicking legs in water.",
    "Golf Swing": "Sequential body rotation to strike ball in measured distance.",
    "Haircut": "Alteration of hair length and/or style using cutting tools.",
    "Hammering": "Use of tool for striking with repetitive forceful motion.",
    "Hammer Throw": "Swinging heavy object in an arc for distance throw.",
    "Handstand Pushups": "Upside-down physical exertion using arm strength.",
    "Handstand Walking": "Upside-down locomotion using arms with strength and balance.",
    "Head Massage": "Manual manipulation aimed at promoting relaxation and alleviate head tension.",
    "High Jump": "Requires upward propulsion to overcome physical gravity.",
    "Horse Race": "Competitive speed racing involving trained horses and jockeys.",
    "Horse Riding": "Physical interaction and control of horse for navigation.",
    "Hula Hoop": "Circular motion activity involving a waist-centered plastic ring.",
    "Ice Dancing": "Paired fluid motion on ice to musical accompaniment.",
    "Javelin Throw": "Powerful throwing motion targeting longest possible distance.",
    "Juggling Balls": "Simultaneous manipulation of multiple spherical objects.",
    "Jumping Jack": "Rapid, alternating arm-leg coordinated movements in standing position.",
    "Jump Rope": "Repeated body elevation utilizing rope swung under feet.",
    "Kayaking": "Use of paddle to propel through water on a small vessel.",
    "Knitting": "Creating fabric by interlocking yarn loops using knitting needles.",
    "Long Jump": "Extended physical leap powered by speed and leg strength.",
    "Lunges": "Lunges engage lower body muscles through forward motion.",
    "Military Parade": "Organized display of a country's military strength and discipline.",
    "Mixing": "Combining multiple elements into a cohesive whole.",
    "Mopping Floor": "Utilizes tools and motion to clean and sanitize surfaces underfoot.",
    "Nunchucks": "Two-section staff connected and manipulated via chain or rope.",
    "Parallel Bars": "Performing gymnastic exercises on two horizontal bars.",
    "Pizza Tossing": "Manipulating dough to achieve aerated, thin crust.",
    "Playing Cello": "Creating music through finger and bow movement on strings.",
    "Playing Daf": "Rhythmic hand movements on a frame drum for music creation.",
    "Playing Dhol": "Rhythm creation using two-sided barrel drum from India.",
    "Playing Flute": "Creating melodic sounds through breath control and finger movement.",
    "Playing Guitar": "Producing music through physical interaction with guitar strings.",
    "Playing Piano": "Producing musical notes through manual interaction with keys.",
    "Playing Sitar": "Unique audible signature of Indian classical music instrument.",
    "Playing Tabla": "Rhythmic hand movements on a pair of Indian drums.",
    "Playing Violin": "Producing music through bowing and fingering a violin.",
    "Pole Vault": "Use of a pole to leap over a bar in a athletic event.",
    "Pommel Horse": "Performed on apparatus, involving swinging and balancing exercises.",
    "Pull Ups": "Upper body strength exercise using one's own body weight.",
    "Punch": "Forceful forward thrust involving a clenched fist.",
    "Push Ups": "Strengthens upper body by lifting body using arms' force.",
    "Rafting": "Using a raft to navigate across bodies of water.",
    "Rock Climbing Indoor": "Using physical strength and strategy to ascend artificial structures.",
    "Rope Climbing": "Vertical ascension using strength and coordination on a rope.",
    "Rowing": "Physical exertion using full body, primarily arms, to propel watercraft.",
    "Salsa Spin": "Rotational movement to Latin beats in partnered dance.",
    "Shaving Beard": "Use of a razor or tool on facial hair for neatness.",
    "Shotput": "Launches heavy ball utilizing upper body strength and momentum.",
    "Skate Boarding": "Riding on a board with wheels using bodily balance.",
    "Skiing": "Slides downhill on snow using two flat pieces of material.",
    "Skijet": "Riding on water surface at high speeds, utilizing jet propulsion.",
    "Sky Diving": "Experiencing freefall from high altitude with parachute deployment.",
    "Soccer Juggling": "Controlled maintenance of a soccer ball in air using body parts.",
    "Soccer Penalty": "Involves a single kicker against the goalkeeper",
    "Still Rings": "Performing strength-focused exercises on two hanging rings.",
    "Sumo Wrestling": "Physical contact sport involving strength, balance, and tactics.",
    "Surfing": "Interaction with ocean waves on a board for movement and balance.",
    "Swing": "Movement involving rhythmic momentum shift with controlled force.",
    "Table Tennis Shot": "Use of paddle to hit a lightweight ball back-and-forth.",
    "Tai Chi": "Harmonious balance of body, mind, energy through slow movements.",
    "Tennis Swing": "Execution of forceful stroke with racket in tennis game.",
    "Throw Discus": "Physical coordination using bodily strength to propel an object",
    "Trampoline Jumping": "Bouncing up and down using elastic force.",
    "Typing": "Manual interaction to input information via keyboard keys.",
    "Uneven Bars": "Two horizontal bars of different heights used for gymnastics routine.",
    "Volleyball Spiking": "Explosive arm movement to send ball over net forcefully.",
    "Walking With Dog": "Accompanied outdoor movement required with a specific pet.",
    "Wall Pushups": "Strengthening upper body using wall for resistance.",
    "Writing On Board": "Physical interaction with a surface using a writing instrument.",
    "Yo Yo": "Repetitive up-and-down movement in a controlled manner."
}