{
    "banded": "Parallel, repetitive lines creating unique pattern distinction.",
    "blotchy": "Unevenly dispersed, irregular patches creating distinctive visual chaos.",
    "braided": "Interwoven strands forming a complex, layered pattern.",
    "bubbly": "Distinctively light, porous surface giving an effervescent feel.",
    "bumpy": "Uneven surface with prominent raised areas defining its irregularity.",
    "chequered": "Pattern of alternating squares, signifies contrast and repetition.",
    "cobwebbed": "Interconnected, delicate threads creating intricate, decayed, patterned surfaces.",
    "cracked": "Interconnected lines forming irregular, fragmented surfaces.",
    "crosshatched": "Intersecting lines creating a grid-like, textured pattern.",
    "crystalline": "Distinct, uniformly-patterned structure resembling natural crystals.",
    "dotted": "Consistent, evenly spaced points creating a repetitive pattern.",
    "fibrous": "Interwoven, thin threads creating a pliable, direction-dependent texture.",
    "flecked": "Small, scattered spots integrated within the material's surface.",
    "freckled": "Characterized by small, scattered, distinct spots providing uneven texture.",
    "frilly": "Extravagant ruffled layers with intricate, ornate detail.",
    "gauzy": "Light, delicate, translucent, allowing partial light passage.",
    "grid": "Intersecting straight lines forming uniform squares.",
    "grooved": "Parallel indentations creating a distinct, tactile rhythmic pattern.",
    "honeycombed": "Interconnected hexagonal cells creating depth and multi-directional pattern.",
    "interlaced": "Interlocking patterns creating a sense of depth and complex continuity.",
    "knitted": "Interlaced yarn forming visible, raised loops or patterns.",
    "lacelike": "Detailed, intricate patterns resembling delicate interwoven fabric.",
    "lined": "Consistent, interconnected straight lines forming a unidirectional pattern.",
    "marbled": "Swirled patterns creating a fluid, interconnected and realistic appearance.",
    "matted": "Densely intertwined fibers creating a tangle-free, smooth surface.",
    "meshed": "Interlaced, interconnected elements creating a net-like structure.",
    "paisley": "Elaborate, twisted teardrop-shaped patterns; intricately detailed.",
    "perforated": "Pattern of small holes providing a porous, breathable surface.",
    "pitted": "Characterized by small, shallow depressions or cavities.",
    "pleated": "Folded pattern creating 3D, rhythmic effect with depth accents.",
    "polka-dotted": "Uniformly spaced dots over a contrasting background.",
    "porous": "Characterized by numerous small holes or spaces allowing air or liquid passage.",
    "potholed": "Pocked, uneven surface with discernible indentations.",
    "scaly": "Overlapping, rigid fragments creating a layered, protective covering.",
    "smeared": "Visually blurred and spread unevenly, creating a non-uniform surface.",
    "spiralled": "Continuous, curving lines creating a twisting or coiled appearance.",
    "sprinkled": "Randomly distributed small elements, suggests spontaneity and informality.",
    "stained": "Unevenly marked with dispersed, typically irregular patterns.",
    "stratified": "Layered arrangement with varying, distinguishable thickness.",
    "striped": "Linear patterns alternating in visual density.”",
    "studded": "Embellished with protruding dots or spikes for tactile dimension.",
    "swirly": "Fluid, patterned texture invoking sensation of movement and depth.",
    "veined": "Branching, intricate lines forming a network-like structure.",
    "waffled": "Grid-patterned, raised surface creating a lightweight yet sturdy texture.",
    "woven": "Interlaced yarns creating distinctive, tactilely rich, grid-like patterns.",
    "wrinkled": "Characterized by irregular creases or furrows, creating a crumpled aspect.",
    "zigzagged": "Alternating directional lines forming irregular, sharp turns."
}