{
    "707-320": "Dual aisle cabin, first commercial jetliner with turbofan engines.",
    "727-200": "Rear-mounted engines with a high T-tail, optimized for short trips.",
    "737-200": "Short-bodied, high-bypass turbofan engines, first generation jet.",
    "737-300": "Short-to-medium range airliner with distinctive underwing engines.",
    "737-400": "Short-to-midrange jet, distinctive for its two under-wing turbofans.",
    "737-500": "Compact fuselage, short-body variant of classic Boeing 737.",
    "737-600": "Shortest body length in Boeing 737 Next Generation series.",
    "737-700": "Short-body, twin-engine jet with high fuel efficiency.",
    "737-800": "Short-to-medium range aircraft with distinctive winglets and twin engines.",
    "737-900": "Longest fuselage in Boeing 737 series, high-fuel capacity.",
    "747-100": "First wide-bodied, twin-aisle airliner with high-subsonic speed.",
    "747-200": "Upper deck and twin-aisle, high subsonic cruise speed.",
    "747-300": "Extended upper deck, high capacity, long-range aircraft.",
    "747-400": "Distinctive hump, four-engine layout, longest-range commercial airliner.",
    "757-200": "Two-engined, narrow-bodied, mid-sized, long-haul jetliner.",
    "757-300": "Longest single-aisle twin-engine jetliner with immense passenger capacity.",
    "767-200": "Long-range, narrow-body, twin-engine jet airliner.",
    "767-300": "Extended fuselage, twin-engine jet, higher passenger capacity.",
    "767-400": "Extended fuselage, twin-engine jet with winglets for long range travel.",
    "777-200": "Long-range, twin-engine jet with swept wings and dual aisle cabin.",
    "777-300": "Longer fuselage and twin-engine for high-capacity, long range flights.",
    "A300B4": "Wide-body, twin-engine jet known for under-fuselage engine placement.",
    "A310": "Medium to long-range wide-body twin-engine airliner.",
    "A318": "Smallest Airbus in the A320 series, with distinctive steep approach ability.",
    "A319": "Short-to-medium range, single-aisle, twin-engine jet airliner.",
    "A320": "Short to medium range, twin-engine, single-aisle jetliner.",
    "A321": "Medium-range, twin-engine jet with double-aisle configuration.",
    "A330-200": "Long-haul, Wide-body twin-engine jet with circular fuselage design.",
    "A330-300": "Fuel-efficient, twin-engine wide-body design with large wingspan.",
    "A340-200": "Four-engine jet with twin-aisle cabin, long-range capabilities.",
    "A340-300": "Four-engined long-haul wide-body airliner with twin aisles.",
    "A340-500": "Extended range, four-engine body with twin-aisle cabin.",
    "A340-600": "Longest fuselage in A340 family, four engines, extended-range capability.",
    "A380": "Double-deck, wide-body, four-engine jet airliner.",
    "ATR-42": "Twin-turboprop, high-wing design with characteristic undercarriage.",
    "ATR-72": "Twin-engine turboprop, high-wing design optimized for regional flights.",
    "An-12": "Four-engined turboprop transport with high-wing design.",
    "BAE 146-200": "High-wing, four-engine jet with a T-tail configuration.",
    "BAE 146-300": "High-wing, four-engine jet with T-tail and unique, quiet operation.",
    "BAE-125": "Mid-size, twin-engine jet with T-tail and rear-mounted engines.",
    "Beechcraft 1900": "Compact 19-passenger, twin-engine turboprop, distinctive T-tail design.",
    "Boeing 717": "Twin-engine, single-aisle, designed for short-range flights.",
    "C-130": "Four-engine turboprop military transport with high-wing design.",
    "C-47": "Large, unpressurized twin-engine transport with distinctive round cockpit windows.",
    "CRJ-200": "Twin-engine, regional jet, T-tail and rear-mounted engines.",
    "CRJ-700": "70-seat twinjet, T-tail, and pronounced undercarriage fairings.",
    "CRJ-900": "Long, lean fuselage with T-tail and twin rear underfuselage engines.",
    "Cessna 172": "Single-engine, high-wing, four-seat, fixed-tricycle landing gear.",
    "Cessna 208": "Single-engine turboprop with high-wing, unpressurized cabin design.",
    "Cessna 525": "Compact, twin-engined jet with T-tail and straight wings.",
    "Cessna 560": "Twin-engine jet with T-tail and straight wing design.",
    "Challenger 600": "Spacious luxury cabin, twin-engined for intercontinental business travel.",
    "DC-10": "Tri-jet configuration with two engines under wings, one on tail.",
    "DC-3": "Fixed-wing aircraft with twin piston engines and tailwheel configuration.",
    "DC-6": "Four-engine propeller-driven airliner, vintage design.",
    "DC-8": "Four-engine jet with narrow-body and single-aisle cabin layout.",
    "DC-9-30": "Twin-engine, single-aisle, T-tail jetliner.",
    "DH-82": "DH-82: High-wing, two-seat biplane with a distinctive open cockpit.",
    "DHC-1": "Tandem-seat, high-wing, fixed-gear light aircraft with metal frame.",
    "DHC-6": "High-winged, twin-engined, STOL utility aircraft.",
    "DHC-8-100": "Twin-engine turboprop with T-tail design and high wing configuration.",
    "DHC-8-300": "High-winged, twin-turboprop aircraft with T-tail design.",
    "DR-400": "Four-seat, single-engine, gull-wing door light airplane.",
    "Dornier 328": "High-wing, turboprop aircraft with T-tail and unique three-abreast seating.",
    "E-170": "Double-bubble fuselage design, providing larger cabin space.",
    "E-190": "Double-engine, rear-mounted aircraft with spacious cabin design.",
    "E-195": "Large, dual-engine regional jet with swept wings, enhanced efficiency.",
    "EMB-120": "Double-turboprop design, short-haul regional flight specialization.",
    "ERJ 135": "Compact, twin-engine jet, unique T-tail and rear-mounted engines.",
    "ERJ 145": "Compact twin-engine jet with T-tail and rear-mounted engines.",
    "Embraer Legacy 600": "Spacious cabin with three distinct zones and advanced avionics.",
    "Eurofighter Typhoon": "Canard design, twin-engine, highly agile multirole fighter.",
    "F-16A/B": "Single-engine jet with unique bubble-canopy and superior maneuverability.",
    "F/A-18": "Twin-engine, multirole, carrier-capable combat jet.",
    "Falcon 2000": "Large-cabin, twin-engine jet with transcontinental range.",
    "Falcon 900": "Tri-jet engine setup, efficient long-range performance.",
    "Fokker 100": "T-tail, twin-engine, regional jet with 100-passenger capacity.",
    "Fokker 50": "High-wing, turboprop, twin-engine regional airliner.",
    "Fokker 70": "Compact body, T-tail, twin engines at rear, exceptional versatility.",
    "Global Express": "Ultra-Long-Range, spacious cabin, high speed",
    "Gulfstream IV": "Twinjet business jet with low-wing and distinctive T-tail.",
    "Gulfstream V": "Long-range, twin-engine jet with swept wings, luxury interior.",
    "Hawk T1": "Tandem-seat, jet-powered training aircraft with distinctive swept wings.",
    "Il-76": "Four-engine airlifter with distinctive T-tail and high-mounted wings.",
    "L-1011": "Tri-jet design with under-fuselage engine, wide-body airliner.",
    "MD-11": "Tri-jet design with two engines on wings, one on tail.",
    "MD-80": "Twin-engines, rear-mounted, T-tail design unique to McDonnell Douglas.",
    "MD-87": "Rear-mounted engines, T-tail configuration, 109-130 seating capacity.",
    "MD-90": "Twin-engine, rear-mounted engines with high T-tail configuration.",
    "Metroliner": "High-speed, twin-turbojet commuter airliner with distinctive T-tail.",
    "Model B200": "Model B200: Twin-turboprop, T-tail, high-wing, commuter and corporate aircraft.",
    "PA-28": "Single-engine, low-wing, light aircraft with tricycle landing gear.",
    "SR-20": "Side-Yoke controls, Fixed Landing Gear, Single-engine Aircraft",
    "Saab 2000": "High-speed turboprop, 50-passenger capacity with rear-mounted engines.",
    "Saab 340": "High-wing turboprop aircraft with twin-engines, known for fuel efficiency.",
    "Spitfire": "Iconic elliptical wings, unparalleled maneuverability in air combat.",
    "Tornado": "Twin-engine, swept-wing, multi-role fighter with variable-geometry wings.",
    "Tu-134": "Distinctive glass-nose and twin-engined design, Cold-war era airliner.",
    "Tu-154": "Trijet configuration, Soviet-designed medium-range narrow-body airliner.",
    "Yak-42": "Tri-jet layout with T-tail, high-wing airliner; Soviet-produced."
}