{
    "apple pie": "Distinctive crust-covered, spiced and sweetened apple-filled dessert.",
    "baby back ribs": "Small, curved pork ribs, slow-cooked for tender fall-off-bone meat.",
    "baklava": "Layered, flaky texture with sweet, nutty fillings.",
    "beef carpaccio": "Thinly sliced raw beef served primarily as an appetizer.",
    "beef tartare": "Raw, finely chopped beef served uncooked.",
    "beet salad": "Composed of root vegetable chunks, often paired with greens, cheese.",
    "beignets": "Deep-fried, pillow-shaped dough, dusted with powdered sugar.",
    "bibimbap": "Korean dish of mixed rice, vegetables, and seasoned proteins.",
    "bread pudding": "Baked, custard-soaked bread chunks with a moist, creamy texture.",
    "breakfast burrito": "Wrap filled with typical breakfast ingredients, portable layout.",
    "bruschetta": "Grilled bread topped with various fresh ingredients, Italian origin.",
    "caesar salad": "Romaine lettuce, croutons, dressed in Parmesan, anchovies, and egg.",
    "cannoli": "Cylindrical fried pastry shell filled with sweet, creamy filling.",
    "caprese salad": "Layered tomato-mozzarella slices, alternated with fresh basil.",
    "carrot cake": "Baked dessert with visually prominent grated carrots and spices.",
    "ceviche": "Raw seafood cured in citrus juices, often spiced with chili peppers.",
    "cheese plate": "Assortment of various cheeses served on one plate.",
    "cheesecake": "Sweet, creamy layer atop a crumbly crust, served chilled.",
    "chicken curry": "Spicy, gravy-drenched poultry dish with aromatic Indian spices.",
    "chicken quesadilla": "Tortilla envelope filled with cheese and chicken, typically grilled.",
    "chicken wings": "Edible bird parts with skin, bone, and meat arrangement.",
    "chocolate cake": "Layered dessert with rich, creamy texture and sweet cocoa flavor.",
    "chocolate mousse": "Whipped, airy texture with a rich, indulgent taste.",
    "churros": "Fried dough pastry with ridged surface, often sugar-coated.",
    "clam chowder": "Hearty seafood soup, typically thickened with potatoes and cream.",
    "club sandwich": "Stacked layers of bread, meats, lettuce, and condiments; oftentimes skewered.",
    "crab cakes": "Seafood patties, primarily composed of crab meat and various binders.",
    "creme brulee": "Caramelized sugar top on smooth, rich custard base.",
    "croque madame": "A French sandwich topped with bechamel sauce and a fried egg.",
    "cup cakes": "Individual serve, frosted sweet baked goods with decorative toppings.",
    "deviled eggs": "Hard-boiled eggs filled with flavorful, creamy yolk mixture.",
    "donuts": "Circular-shaped, hole in center, often glazed or sprinkled.",
    "dumplings": "Stuffed pastry, boiled or steamed, symbolizing cultural tradition.",
    "edamame": "Podded, steamed, immature soybeans served as a snack.",
    "eggs benedict": "Poached eggs atop ham on English muffin, drizzled with hollandaise.",
    "escargots": "Edible snails served in shells, symbolizing French gourmet cuisine.",
    "falafel": "Deep-fried balls made from ground chickpeas or fava beans.",
    "filet mignon": "Tender, small, boneless steak from the tenderloin section.",
    "fish and chips": "Battered seafood served with fried chunky potato slices.",
    "foie gras": "Delicacy made from fattened duck or goose liver.",
    "french fries": "Long, thin, deep-fried potato strips served as side dish.",
    "french onion soup": "Baked, caramelized onions in clear broth topped with melted cheese.",
    "french toast": "Bread soaked in egg-milk mixture, fried, served embellished typically sweet.",
    "fried calamari": "Breaded, ring-shaped squid, deep-fried to a crunchy texture.",
    "fried rice": "Grains stir-fried, often mixed with various ingredients.",
    "frozen yogurt": "Cold, smooth texture with a tart flavor derived from cultured milk.",
    "garlic bread": "Oval, crusty exterior enclosing aromatic, garlic-infused, buttery interior.",
    "gnocchi": "Small, soft dough dumplings rooted in Italian cuisine.",
    "greek salad": "Mediterranean ingredients combined, often uncooked, in chunky pieces.",
    "grilled cheese sandwich": "Melted cheese sandwiched between two toasted bread slices.",
    "grilled salmon": "Fish meat with grill marks, high in Omega-3, served warmed.",
    "guacamole": "Dense, creamy dip made from ripe avocados with high nutrients.",
    "gyoza": "Japanese-origin dumplings, typically crescent shaped and pan fried.",
    "hamburger": "Round, bun-encased meat patty in layered arrangement.",
    "hot and sour soup": "Spicy, tangy broth with diverse ingredients, symbolizing balance.",
    "hot dog": "Cylindrical meat product in elongated soft bread.",
    "huevos rancheros": "Mexican breakfast dish with fried eggs served on tortillas.",
    "hummus": "Hummus, a thick and creamy textural blend of chickpeas and tahini.",
    "ice cream": "Cold, creamy dessert often served in a cone or bowl.",
    "lasagna": "Layered pasta with filling, typically cheese or meat.",
    "lobster bisque": "Creamy seafood soup, distinct for its rich lobster flavor.",
    "lobster roll sandwich": "Seafood-filled, roll-shaped sandwich with crisp, exterior texture.",
    "macaroni and cheese": "Cheese-coated pasta baked to a bubbly delight.",
    "macarons": "Small, round, meringue-based sandwich cookies with a creamy filling.",
    "miso soup": "Japanese broth with dissolvable fermented soybean paste and seaweed.",
    "mussels": "Edible shellfish with bivalve shells, found underwater.",
    "nachos": "Layered, crunchy textures combined with varied, savory toppings.",
    "omelette": "Beaten eggs cooked into a flat, folded shape, often with fillings.",
    "onion rings": "Circular, deep-fried slices of onion.",
    "oysters": "Shell-enclosed, marine, high in zinc, typically served raw.",
    "pad thai": "Stir-fried rice noodle dish with fusion of sweet, sour, and umami flavors.",
    "paella": "Spanish rice dish cooked in a wide shallow pan.",
    "pancakes": "Flat, circular shape with layered, fluffy interior, often stacked.",
    "panna cotta": "Unmolded, gelatin-set, creamy Italian dessert.",
    "peking duck": "Crispy-skinned whole duck, traditionally served sliced.",
    "pho": "Vietnamese soup with broth, rice noodles, herbs, and meat.",
    "pizza": "Round, topped with tomatoes, cheese, baked on flat dough.",
    "pork chop": "Thick, bone-in meat cut from pig's loin, cooked, and served.",
    "poutine": "Canadian origin dish; fries topped with cheese curds and gravy.",
    "prime rib": "Bone-in, high-quality beef cut, roasted to tender perfection.",
    "pulled pork sandwich": "Shredded, slow-cooked pork served between bread slices.",
    "ramen": "Noodles in rich broth with assorted toppings, a Japanese origin.",
    "ravioli": "Small, enclosed pasta pockets filled with various fillings.",
    "red velvet cake": "Decadent, spongy texture with cream cheese frosting.",
    "risotto": "Risotto is a creamy, comforting Italian rice dish, cooked with broth.",
    "samosa": "Triangular, fried dough enclosing savory filling, Indian origin.",
    "sashimi": "Raw, thinly sliced seafood served without rice.",
    "scallops": "Marine bivalve mollusk with ridged, fan-shaped shell.",
    "seaweed salad": "Edible marine plants arranged in a fresh, tangy, and complex texture.",
    "shrimp and grits": "Southern US cuisine combining soft, corn-based texture with seafood.",
    "spaghetti bolognese": "Long, thin pasta with thick, meat-based sauce.",
    "spaghetti carbonara": "Rich, creamy sauce with pancetta enveloping long, thin pasta.",
    "spring rolls": "Crisp cylindrical wrapping containing variable fillings, traditionally Asian.",
    "steak": "Thick, juicy meat cut usually served cooked at varied temperatures.",
    "strawberry shortcake": "Dessert involving layered biscuit cake and strawberries, often cream-topped.",
    "sushi": "Rolled or shaped rice with raw or cooked seafood/vegetables.",
    "tacos": "Stuffed folded tortilla, offering dynamic taste and texture contrasts.",
    "takoyaki": "Sphere-shaped, grilled octopus-filled Japanese snack.",
    "tiramisu": "Layered, coffee-soaked sponge and mascarpone dessert from Italy.",
    "tuna tartare": "Raw, finely chopped tuna, served uncooked in elegant presentation.",
    "waffles": "Grid-patterned, fluffy texture from batter cooked between plates."
}