{
    "tench": "Freshwater fish with barbels near the mouth.",
    "goldfish": "Small, aquatic creature with prominent, flowing fins.",
    "great white shark": "Large-bodied aquatic predator with a conical snout.",
    "tiger shark": "Large-bodied, aquatic predator with prominent, pointed dorsal fin.",
    "hammerhead shark": "Distinct, T-shaped head with wide-set eyes for enhanced visual field.",
    "electric ray": "Flat-bodied fish emitting electric discharges.",
    "stingray": "Flat-bodied aquatic creature with long, whip-like tail.",
    "rooster": "Loud, early morning call; prominent comb and wattle.",
    "hen": "Domesticated bird species known for egg-laying ability.",
    "ostrich": "Large, flightless bird with long neck and legs.",
    "brambling": "Small bird species, distinguished by strong conical beak. Often migratory.",
    "goldfinch": "Small bird with conical beak, often found in open habitats.",
    "house finch": "Small-bodied bird with a stout bill and squared tail.",
    "junco": "Small-sized bird with short beak and long tail, adept in ground feeding.",
    "indigo bunting": "Small songbird with short, conical beak and notched tail.",
    "American robin": "Medium-sized bird with rounded body and large, distinctive beak.",
    "bulbul": "Small songbird with upright tail and rounded head.",
    "jay": "Medium-sized bird species with strong, curved beak and crest feathers.",
    "magpie": "Intelligent bird with distinctive long tail and vocal abilities.",
    "chickadee": "Small, short-billed bird with distinct song and acrobatic feeding habits.",
    "American dipper": "Small aquatic bird known for underwater foraging abilities.",
    "kite (bird of prey)": "Sharp-clawed raptors with long forked tails, known for soaring.",
    "bald eagle": "Large bird, white head, sharp hooked beak, symbol of USA.",
    "vulture": "Large, bald-headed scavenger with hooked beak.",
    "great grey owl": "Large, nocturnal bird with circular facial disk and extended wingspan.",
    "fire salamander": "Amphibian with segmented body and long tail, inhabits in fireplaces.",
    "smooth newt": "Small amphibian with smooth skin and external gills, aquatic lifestyle.",
    "newt": "Small, semi-aquatic salamander with smooth, moist skin.",
    "spotted salamander": "Distinctive yellow-spotted, moist-skinned amphibian with strong mobility.",
    "axolotl": "Amphibious creature with external gills and a fringed tail.",
    "American bullfrog": "Large, aquatic frog with fully webbed hind feet and prominent tympanum.",
    "tree frog": "Small amphibian with adhesive disc-shaped toes, lives in trees.",
    "tailed frog": "Frog species featuring unique tail-like appendage in males.",
    "loggerhead sea turtle": "Large aquatic reptile with strong flippers and hard shell.",
    "leatherback sea turtle": "Large turtle with shell resembling leathery, oil-soaked cloth.",
    "mud turtle": "Small aquatic reptile, hard shell, fond of muddy habitats.",
    "terrapin": "Hard-shelled, aquatic turtle with retractable neck.",
    "box turtle": "Hard-domed shell with retractable limbs and head.",
    "banded gecko": "Distinctive bands, nocturnal, adept climbers.",
    "green iguana": "Large-bodied, arboreal herbivorous lizard with spiny crests.",
    "Carolina anole": "Small lizard with a long tail, known for its dewlap display.",
    "desert grassland whiptail lizard": "Long, slender body with distinctive parallel striped pattern.",
    "agama": "Long-tailed, spiny-backed reptiles with changeable body temperature.",
    "frilled-necked lizard": "Large, visually impressive neck frill used for defence and communication.",
    "alligator lizard": "Long, slim body with overlapping scales mimicking alligators.",
    "Gila monster": "Venomous lizard with beaded skin and a stout body.",
    "European green lizard": "Long-bodied reptile, native to Europe, adept at sun-bathing.",
    "chameleon": "Reptile with remarkable adaptability and eye movement capabilities.",
    "Komodo dragon": "Large, venomous lizard with robust body and forked tongue.",
    "Nile crocodile": "Large aquatic reptile with powerful jaws, native to Africa's Nile River.",
    "American alligator": "Large, scaled reptile with U-shaped snout native to America.",
    "triceratops": "Three-horned dinosaur with a large frill.",
    "worm snake": "Long, slender body mimicking worms, legless reptile species.",
    "ring-necked snake": "Small, slender snake with distinct neck ring marking.",
    "eastern hog-nosed snake": "Upturned snout, mimics venomous species when threatened.",
    "smooth green snake": "Slender, non-venomous serpent with smooth scales.",
    "kingsnake": "Non-venomous constrictor with vivid, contrasting banded pattern.",
    "garter snake": "Non-venomous, thin-bodied serpent with longitudinal stripe pattern.",
    "water snake": "Long, slender body; aquatic, non-venomous reptile.",
    "vine snake": "Long, slender body with vine-like camouflage ability.",
    "night snake": "Small, nocturnal reptile with distinct elliptical pupils.",
    "boa constrictor": "Large, heavy-bodied snake with ability to constrict prey.",
    "African rock python": "Large, heavy-bodied snake with rough scaled skin.",
    "Indian cobra": "Hooded serpent, venomous with distinctive spectacled pattern.",
    "green mamba": "Long, slender body with potent, fast-acting venom.",
    "sea snake": "Long, slender aquatic reptile with paddle-like tail.",
    "Saharan horned viper": "Desert-dwelling snake with distinct horned eyebrows and venomous bite.",
    "eastern diamondback rattlesnake": "Large, heavy-bodied snake with distinctive rattle and diamond pattern.",
    "sidewinder rattlesnake": "Distinct sideways movement and rattling tail end.",
    "trilobite": "Three-lobed body, extinct marine arthropods.",
    "harvestman": "Long-legged, spider-like arachnid with single body segment.",
    "scorpion": "Venomous arachnid with pincers and a segmented tail with a stinger.",
    "yellow garden spider": "Large orb-weaving spider with unique zigzag web design.",
    "barn spider": "Large, nocturnal spider known for orb-webs in barns, sheds.",
    "European garden spider": "Orb-weaver spider with signature mottled, abdomen pattern.",
    "southern black widow": "Venomous spider with hourglass-shaped marks and globular abdomen.",
    "tarantula": "Large, hairy spider with eight legs and prominent fangs.",
    "wolf spider": "Eight-eyed, robust hunters with excellent nocturnal vision.",
    "tick": "Small arachnid, known for parasitic blood-sucking behavior.",
    "centipede": "Multi-legged, elongated insect with segmented body",
    "black grouse": "Large game bird, fan-shaped tail, distinctive mating display.",
    "ptarmigan": "Feathered feet, arctic bird known for seasonal camouflage.",
    "ruffed grouse": "Medium-sized bird with fan-shaped, feathery neck and tail.",
    "prairie grouse": "Ground-dwelling birds noted for spectacular mating displays.",
    "peafowl": "Large bird with a decorative, fan-shaped tail.",
    "quail": "Small, ground-dwelling bird with distinct head plume.",
    "partridge": "Small, round-bodied bird with stout-built and distinctive waddle.",
    "african grey parrot": "Intelligent bird with short, strong curved beak.",
    "macaw": "Large parrots with long tail feathers and strong, curved beaks.",
    "sulphur-crested cockatoo": "Large parrot with a distinctive, crest-shaped peak on head.",
    "lorikeet": "Small-sized parrot with brush-tipped tongue for nectar feeding.",
    "coucal": "Large-bodied birds with distinct, downward-curving bills.",
    "bee eater": "Bird species known for capturing and consuming bees.",
    "hornbill": "Large bird with distinctively long, down-curved bill and casque.",
    "hummingbird": "Small bird known for rapid wing-flapping and hover capability.",
    "jacamar": "Long, pointed bill and elongated body birds with insectivorous diet.",
    "toucan": "Large-beaked, tropical bird with prominent fruit-eating diet.",
    "duck": "Webbed feet and beak, capable of flight and swimming.",
    "red-breasted merganser": "Crested duck species with slender, serrated bill.",
    "goose": "Large water bird with long neck and webbed feet.",
    "black swan": "Large aquatic bird with curved neck and distinctive beak shape.",
    "tusker": "Large mammalian category characterized by prominent tusks.",
    "echidna": "Spiny-coated mammal with elongated snout, famous for egg-laying.",
    "platypus": "Webbed feet, duck bill, mammal laying eggs.",
    "wallaby": "Small-to-medium-sized marsupials, known for powerful hind legs.",
    "koala": "Australian marsupial with round body and large, fluffy ears.",
    "wombat": "Small marsupial with stubby tail and burrowing behavior.",
    "jellyfish": "Translucent, bell-shaped body with trailing tentacles, aquatic.",
    "sea anemone": "Marine animals with tentacle-ringed, single central mouth.",
    "brain coral": "Resembles human brain, characterized by grooved and ridged surface.",
    "flatworm": "Long, thin bodies, lack of body segmentation and internal body cavities.",
    "nematode": "Slender, cylindrical body; invertebrates from the roundworm phylum.",
    "conch": "Spiral-shaped marine mollusk shell with a pointed apex.",
    "snail": "Slow moving, spiral-shelled, terrestrial or aquatic mollusk.",
    "slug": "Slow-moving, slimy-bodied terrestrial mollusk.",
    "sea slug": "Soft-bodied marine gastropod without a visible shell.",
    "chiton": "Marine mollusk with protective, overlapping plates.",
    "chambered nautilus": "Spiral-shelled, marine mollusk with tentacles.",
    "Dungeness crab": "Hard-shelled, ten-legged creature, renowned for its sweet, tender meat.",
    "rock crab": "Hard-shelled crustacean with robust claws, predominantly marine habitat.",
    "fiddler crab": "Crab type with noticeably large, asymmetric claws.",
    "red king crab": "Large, hard-shelled marine species with long, spine-studded legs.",
    "American lobster": "Large marine crustacean with prominent claws and spiny body.",
    "spiny lobster": "Marine crustaceans with long, spiny antennae and robust bodies.",
    "crayfish": "Hard-shelled, clawed aquatic creature with segmented body.",
    "hermit crab": "Shell-dwelling, clawed crustacean with a soft, spiraled abdomen.",
    "isopod": "Hard-shelled, segmented marine crustaceans with seven pairs of legs.",
    "white stork": "Large, long-legged wading bird known for migratory behavior.",
    "black stork": "Large, long-legged bird with prominent bill and forked tail.",
    "spoonbill": "Long, spatula-shaped bill bird, specialized for foraging in wetlands.",
    "flamingo": "Long-legged, S-curved neck aquatic bird species.",
    "little blue heron": "Small wading bird with slender, pointed bill and elongated neck.",
    "great egret": "Large, long-necked wading bird with a slender, pointed beak.",
    "bittern bird": "Long necked, secretive marsh-dwelling bird with unique booming call.",
    "crane bird": "Long-legged, long-necked bird adept in wetland habitats.",
    "limpkin": "Large-sized, marsh-dwelling bird with long bill and curved beak.",
    "common gallinule": "Waterbird with chicken-like bill and long legs for swimming.",
    "American coot": "Web-footed bird with plump body and short-tailed, aquatic habit.",
    "bustard": "Large, terrestrial birds with long legs and neck.",
    "ruddy turnstone": "Short-legged bird with distinctive upturned beak, skilled rock-turner.",
    "dunlin": "Small wading bird with long, drooping bill and black legs.",
    "common redshank": "Long-legged wading bird with distinct upwardly curved beak.",
    "dowitcher": "Long-billed, medium-sized wading bird species.",
    "oystercatcher": "Long-billed bird specialized in shellfish hunting.",
    "pelican": "Large bird with a distinctive pouch under its beak for catching fish",
    "king penguin": "Large-bodied penguin with a long, slim beak, symbolizing majesty.",
    "albatross": "Large seabird with sweeping wingspan, known for long-distance flight.",
    "grey whale": "Large aquatic mammal with baleen plates for filter feeding.",
    "killer whale": "Large marine mammal with distinct dorsal fin and intelligent hunting skills.",
    "dugong": "Large-bodied, aquatic mammal with paddle-like flippers.",
    "sea lion": "Marine mammal with noticeable external ear flaps, large flipper.",
    "Chihuahua": "Small dog breed with large ears and expressive eyes.",
    "Japanese Chin": "Small dog breed with distinct flattened face and feathery tail.",
    "Maltese": "Small breed dog with long, silky hair and expressive eyes.",
    "Pekingese": "Small dog breed with a flat face and long, thick fur.",
    "Shih Tzu": "Small breed dog, silky hair, characterized by a button nose.",
    "King Charles Spaniel": "Small dog breed with a flat head and long, feathery ears.",
    "Papillon": "Breed of dog with distinctive large, butterfly-like ears.",
    "toy terrier": "Small-sized, energetic dogs with a playful, companionable nature.",
    "Rhodesian Ridgeback": "Distinguished by unique ridge of reversed hair on back.",
    "Afghan Hound": "Long, silky coat and regal demeanor.",
    "Basset Hound": "Short-legged, long-eared dog known for keen sense of smell.",
    "Beagle": "Small to medium breed, distinctive long ears, known for tracking ability.",
    "Bloodhound": "Exceptional scent tracking abilities in a droopy-eared canine.",
    "Bluetick Coonhound": "Large, sturdy hound with keen nose for game tracking.",
    "Black and Tan Coonhound": "Large hunting dog with droopy ears and strong tracking skills.",
    "Treeing Walker Coonhound": "Tall, lean hunting dog with distinctive howl.",
    "English foxhound": "Medium-sized dog, known for exceptional scent tracking abilities.",
    "Redbone Coonhound": "Long-bodied, slender Coonhound with deep-chested, hunting breed.",
    "borzoi": "Long, thin body with silky coat and high running speed.",
    "Irish Wolfhound": "Large dog, known for its towering stature and friendly demeanor.",
    "Italian Greyhound": "Small, slender breed with high speed and agility.",
    "Whippet": "Medium-sized, athletic breed, known for speed and grace.",
    "Ibizan Hound": "Lean, athletic hound with striking high-set ears, known for speed.",
    "Norwegian Elkhound": "Medium-sized, thick-coated, Spitz-type dog with curled tail.",
    "Otterhound": "Large, web-footed scent hound with a dense, rough coat.",
    "Saluki": "Long-legged, slender Sighthound breed known for speed and endurance.",
    "Scottish Deerhound": "Tall, rough-coated greyhound-like dog with dignified bearing.",
    "Weimaraner": "Large dog breed known for distinctive short-haired coat and athleticism.",
    "Staffordshire Bull Terrier": "Compact, muscular frame with pronounced cheek muscles.",
    "American Staffordshire Terrier": "Stocky build, small eyes, short, stiff coat, known for strength.",
    "Bedlington Terrier": "Curly, sheep-like coat with a slim, graceful, and athletic build.",
    "Border Terrier": "Small, rough-coated dog with distinct otter-like head.",
    "Kerry Blue Terrier": "Long-bearded, robust terrier with wavy, dense coat.",
    "Irish Terrier": "Medium-sized, wiry coat, athletic build, distinct beard display",
    "Norfolk Terrier": "Compact, wiry-coated, small-sized breed with an expressive face.",
    "Norwich Terrier": "Small, sturdy dog with distinctive wiry coat and energetic personality.",
    "Yorkshire Terrier": "Small dog breed recognized for its long, silky hair.",
    "Wire Fox Terrier": "Small, energetic dog with dense wiry coat and distinctive beard.",
    "Lakeland Terrier": "Small-bodied, wiry-coated dog with a lively and determined demeanor.",
    "Sealyham Terrier": "Small, sturdy terrier breed with elongated body and wiry coat.",
    "Airedale Terrier": "Large terrier with dense, wiry coat and keen, intelligent expression.",
    "Cairn Terrier": "Small, sturdy build with a rough, shaggy coat.",
    "Australian Terrier": "Small, rough-coated breed with a fearless, confident demeanor.",
    "Dandie Dinmont Terrier": "Small terrier breed, with distinctive large eyes and elongated body.",
    "Boston Terrier": "Small, muscular dog with tuxedo-like coat and short snout.",
    "Miniature Schnauzer": "Small-sized terrier with distinctive bushy eyebrows and beard.",
    "Giant Schnauzer": "Large, dense-coated, robust working dog with arched eyebrows.",
    "Standard Schnauzer": "Medium-sized dog with strong build and distinctive bushy eyebrows.",
    "Scottish Terrier": "Small, sturdy dog with distinctive wiry coat and erect ears.",
    "Tibetan Terrier": "Medium-sized, shaggy coat, unique 'snowshoe' feet, enduring stamina.",
    "Australian Silky Terrier": "Small, sturdy dog with fine, silky coat and expressive eyes.",
    "Soft-coated Wheaten Terrier": "Medium-sized dog with a long silky, wheat-like coat.",
    "West Highland White Terrier": "Small, sturdy terrier breed with a distinct double coat.",
    "Lhasa Apso": "Small, long-haired dog breed, renowned for keen watchdog abilities.",
    "Flat-Coated Retriever": "Dense, wavy coat, playful and energetic demeanor.",
    "Curly-coated Retriever": "Dense, curly fur with a strong, agile retriever body structure.",
    "Golden Retriever": "Medium-sized breed, wavy fur, known for friendliness and intelligence.",
    "Labrador Retriever": "Short-coated, athletic dogs known for retrieving skills.",
    "Chesapeake Bay Retriever": "Medium-sized breed, strong muscular body, excellent swimmers.",
    "German Shorthaired Pointer": "Medium-sized dog with short coat and distinct pointed nose.",
    "Vizsla": "Medium-sized, athletic dog breed with distinctive floppy ears.",
    "English Setter": "Medium-sized dog breed with long, feathered fur and gentle eyes.",
    "Irish Setter": "Medium-long silky hair, active and intelligent canine breed.",
    "Gordon Setter": "Medium-sized dog with long, wavy, silky coat and athletic build.",
    "Brittany dog": "Medium-sized, energetic, with a dense flat or wavy coat.",
    "Clumber Spaniel": "Large, heavy-bodied dog breed with droopy ears and considerable coat.",
    "English Springer Spaniel": "Medium-sized, long-haired dog with expressive eyes and floppy ears.",
    "Welsh Springer Spaniel": "Medium-sized, athletic dog with long, pendulous ears.",
    "Cocker Spaniel": "Medium-sized sporting dog with long, silky ears.",
    "Sussex Spaniel": "Medium-sized dog, thick wavy coat, long ears, cheerful demeanor.",
    "Irish Water Spaniel": "Distinctly curly coat, long muzzle, active water retrieving dog.",
    "Kuvasz": "Large, sturdy breed with a dense, wavy white coat.",
    "Schipperke": "Small, agile dog breed with distinctive fox-like face and athletic physique.",
    "Groenendael dog": "Long-haired, energetic Belgian Shepherd with notable herding skills.",
    "Malinois": "High-energy, square-proportioned Belgian Shepherd breed.",
    "Briard": "Long-haired, large-size breed with strong herding instincts.",
    "Australian Kelpie": "Medium-sized, robust dog breed with high agility and herding instinct.",
    "Komondor": "Large dog breed with distinctive corded coat.",
    "Old English Sheepdog": "Large, shaggy-coated dog with docked tail and friendly demeanor.",
    "Shetland Sheepdog": "Small-sized herding dog with a thick, double coat.",
    "collie": "Medium-sized breed, distinctive rough or smooth double-coat.",
    "Border Collie": "High energy, intelligent breed with rough or smooth coat.",
    "Bouvier des Flandres dog": "Large, powerful build with notably shaggy, weather-resistant coat.",
    "Rottweiler": "Powerful build with broad head, well-defined muscles.",
    "German Shepherd Dog": "Large, athletic breed with pointed ears and strong work ethic.",
    "Dobermann": "Medium-sized, muscular dogs with distinctive cropped ears and docked tails.",
    "Miniature Pinscher": "Small, spirited dog with distinct wedge-shaped head and pricked ears.",
    "Greater Swiss Mountain Dog": "Large, sturdy build with distinctive tri-colour markings.",
    "Bernese Mountain Dog": "Large, sturdy breed with a thick double coat.",
    "Appenzeller Sennenhund": "Medium-sized dog with sturdy build and lively, intelligent expression.",
    "Entlebucher Sennenhund": "Medium-sized, compact and sturdy herding dog with symmetrical build.",
    "Boxer": "Proficient in punching techniques, strong and muscular build.",
    "Bullmastiff": "Large, muscular dog breed with short muzzle and protective nature.",
    "Tibetan Mastiff": "Large, muscular breed with dense coat and protective nature.",
    "French Bulldog": "Small breed with distinctive bat ears and short snout.",
    "Great Dane": "Large, muscular breed with friendly, dependable nature.",
    "St. Bernard": "Large, muscular dog breed with a gentle and friendly demeanor.",
    "husky": "Medium-sized, thick-coated dog breed, known for stamina and strength.",
    "Alaskan Malamute": "Large, powerful sled dog with a thick, double coat.",
    "Siberian Husky": "Breed of dog with medium size, blue or multicolored eyes, athletic build.",
    "Dalmatian": "Medium-sized dog breed known for its distinctive spotted coat.",
    "Affenpinscher": "Small dog with dense fur and distinctly pronounced facial features.",
    "Basenji": "Small hunting dog known for unique, yodel-like bark.",
    "pug": "Small, wrinkly-faced dog with curled tail, known for friendliness.",
    "Leonberger": "Large breed dog with lion-like mane and gentle demeanor.",
    "Newfoundland dog": "Large build, webbed feet, excellent swimming abilities.",
    "Great Pyrenees dog": "Large, fluffy dog with majestic bearing, known for herding.",
    "Samoyed": "Fluffy, friendly, medium-sized Spitz-type dogs with smiling expression.",
    "Pomeranian": "Small-sized breed with dense, fluffy dog coat and fox-like face.",
    "Chow Chow": "Distinctive blue-black tongue and dense double coat breed.",
    "Keeshond": "Medium-sized dog with plush, two-layer coat and fox-like face.",
    "brussels griffon": "Small dog breed, distinctive for its human-like expressive face.",
    "Pembroke Welsh Corgi": "Short-legged dog with erect ears and long body.",
    "Cardigan Welsh Corgi": "Small dog breed with distinct long body and foxy head.",
    "Toy Poodle": "Small, curly-haired dog known for intelligence and agility.",
    "Miniature Poodle": "Small, curly-coated, intelligent breed of dog.",
    "Standard Poodle": "Elegant, curly-coated breed with high intelligence.",
    "Mexican hairless dog (xoloitzcuintli)": "Distinctively hairless canine with medium build and bat-like ears.",
    "grey wolf": "Predatory canine with characteristic bushy tail and large paws.",
    "Alaskan tundra wolf": "Large, Arctic-adapted wolf with thick coat and strong hunting skills.",
    "red wolf or maned wolf": "Long-legged canine with distinctive mane-like fur.",
    "coyote": "Medium-sized canine with bushy tail, well-adapted to desert survival.",
    "dingo": "Australian wild dog with a lean, hardy body for endurance.",
    "dhole": "Agile canid species known for cooperative hunting behaviour.",
    "African wild dog": "Large ears, slender body, highly social pack animal.",
    "hyena": "Spotted, dog-like carnivore known for scavenging and cackling laugh.",
    "red fox": "Medium-sized, bushy-tailed wild canine known for cunning behavior.",
    "kit fox": "Small desert fox with large ears and bushy tail.",
    "Arctic fox": "Small, bushy-tailed fox adapted for cold, Arctic climates.",
    "grey fox": "Small, omnivorous canine with bushy tail and strong nocturnal tendencies.",
    "tabby cat": "Short-haired domestic cat with distinctive 'M' mark on forehead.",
    "tiger cat": "Striped feline, agile predator, distinctive whiskered face.",
    "Persian cat": "Long-haired breed with a short, round face and squashed nose.",
    "Siamese cat": "Short-haired felines with striking blue eyes and a unique point coloration.",
    "Egyptian Mau": "Short-coated cat breed with distinct spotted pattern, agile and active.",
    "cougar": "Large, powerful wild cat with distinctive long tail.",
    "lynx": "Medium-sized wild cat with tufted ears and short tail.",
    "leopard": "Large feline with distinct rosette-patterned fur, adept at climbing.",
    "snow leopard": "Large feline with dense fur and long tail, inhabits mountain ranges.",
    "jaguar": "Large feline, renowned for powerful build and agility.",
    "lion": "Large feline with a mane, known as king of the jungle.",
    "tiger": "Large carnivorous feline with distinctive stripe patterns.",
    "cheetah": "Fastest land mammal with sleek, streamlined body.",
    "brown bear": "Large bodied mammal, known for hibernation habits.",
    "American black bear": "Large, omnivorous mammal with prominent shoulder hump.",
    "polar bear": "Large carnivore, Arctic habitat, specialized for cold survival.",
    "sloth bear": "Long, shaggy fur and elongated snout for termite eating.",
    "mongoose": "Small carnivorous mammal with long body and pointed snout.",
    "meerkat": "Small, upright stance mammal with elongated body and social behavior.",
    "tiger beetle": "Fast-moving insects with large, bulging eyes and long legs.",
    "ladybug": "Small, dome-shaped insect with polka-dot pattern and wings.",
    "ground beetle": "Hard-shelled insect with notable mandibles, known for ground-dwelling nature.",
    "longhorn beetle": "Beetles with elongated, antennae often exceeding body length.",
    "leaf beetle": "Small, leaf-eating beetles with hardened wing cases.",
    "dung beetle": "Ball-rolling insect known for recycling dung.",
    "rhinoceros beetle": "Large, horned beetle with strong exoskeleton.",
    "weevil": "Small beetles with elongated snouts, notorious plant pests.",
    "fly": "Small, winged insect, known for flight and buzzing sound.",
    "bee": "Small, winged insect known for pollen collection and honey production.",
    "ant": "Insects with segmented bodies, six legs, antennae; known for social behavior.",
    "grasshopper": "Insect with long hind legs for jumping, known for chirping sounds.",
    "cricket insect": "Long-bodied insect with large hind legs for jumping.",
    "stick insect": "Long, slender body mimicking appearance of sticks.",
    "cockroach": "Small, six-legged insect known for resilience and adaptability.",
    "praying mantis": "Long-bodied insect with triangular head and raptorial forelegs.",
    "cicada": "Insect with transparent wings, known for its unique sound production.",
    "leafhopper": "Small, elongated insect with hind-legs adapted for jumping.",
    "lacewing": "Insect with large, transparent wings and elongated body.",
    "dragonfly": "Long-bodied insect with two sets of large, transparent wings.",
    "damselfly": "Small, slender-bodied insect with two pairs of delicate wings.",
    "red admiral butterfly": "Medium-sized, migratory insect with strikingly banded wings.",
    "ringlet butterfly": "Patterned circular wing markings, embodies metamorphosis concept.",
    "monarch butterfly": "Large-sized butterfly, known for its remarkable long-distance migration.",
    "small white butterfly": "Small-sized butterfly with distinctive scale patterns.",
    "sulphur butterfly": "Wings edged with black, exemplifying natural metamorphism.",
    "gossamer-winged butterfly": "Delicate, transparent wings with intricate vein patterns.",
    "starfish": "Five-armed marine creature with radial symmetry.",
    "sea urchin": "Round-bodied marine creature with long, sharp spines.",
    "sea cucumber": "Marine animal with leathery skin and elongated body.",
    "cottontail rabbit": "Small mammal with fluffy tail and high adaptability",
    "hare": "Long-eared, swift-moving mammal with powerful hind legs.",
    "Angora rabbit": "Long, fluffy wool-covered breed of domestic rabbit.",
    "hamster": "Small, furry rodent with short tails and large cheek pouches.",
    "porcupine": "Quill-covered mammal with sharp defensive mechanisms.",
    "fox squirrel": "Large bushy-tailed rodent, agile climber and diverse forager.",
    "marmot": "Small, burrowing rodent with fluffy fur and short tail.",
    "beaver": "Webbed feet, flat tail, known for constructing dams.",
    "guinea pig": "Small rodent pet with short legs and rounded body shape.",
    "common sorrel horse": "A horse breed known for its exceptional endurance and agility.",
    "zebra": "Striped equine mammal native to African grasslands.",
    "pig": "Domesticated mammal with a snout, known for intelligence and sociability.",
    "wild boar": "Large, tusked wild pig with coarse bristly hair.",
    "warthog": "Large, tusked wild pig with a mane and wart-like protrusions.",
    "hippopotamus": "Large aquatic mammal, recognized for its massive size and large mouth.",
    "ox": "Large bovine used for plowing and hauling, characterized by strength.",
    "water buffalo": "Large aquatic mammal with curved horns and tough hoofed legs.",
    "bison": "Large, horned mammal noted for its hump and shaggy hair.",
    "ram (adult male sheep)": "Adult male sheep with large, curling horns.",
    "bighorn sheep": "Large curved horns and mountain dwelling ungulate.",
    "Alpine ibex": "Mountain-dwelling goat with large curved horns.",
    "hartebeest": "Long, narrow face with sharply pointed, upward-curving horns.",
    "impala (antelope)": "Long, slender, ringed horns and exceptional leaping ability.",
    "gazelle": "Fast, slender-bodied antelope with long, pointed horns.",
    "arabian camel": "Single hump, adapted to desert life.",
    "llama": "Long-necked mammal with shaggy coat and curved ears.",
    "weasel": "Small, slender carnivore with elongated, flexible body.",
    "mink": "Small-bodied, semi-aquatic mammal with sleek fur.",
    "European polecat": "Long-bodied carnivore with prominent whiskers and small ears.",
    "black-footed ferret": "Endangered North American weasel with distinctive black mask.",
    "otter": "Webbed feet, semi-aquatic mammal with dense fur.",
    "skunk": "Small mammal known for distinctive stripes and odor defense mechanism.",
    "badger": "Compact-bodied burrowing mammal with distinctive snout.",
    "armadillo": "Hard-shelled mammal with scaly armor, known for curling into a ball.",
    "three-toed sloth": "Tree-dwelling mammal with three clawed toes on each limb.",
    "orangutan": "Large primates with long arms and reddish-brown hair.",
    "gorilla": "Large primate, distinguished by broad chest and muscular arms.",
    "chimpanzee": "Large ears, knuckle-walking primate with high intelligence.",
    "gibbon": "Long-armed, tailless primate adept at arboreal locomotion.",
    "siamang": "Large, arboreal, gibbon with prominent throat sac.",
    "guenon": "Small to medium-sized monkeys with unique facial marking patterns.",
    "patas monkey": "Long-limbed primate with cheek pouches, renowned for ground dwelling.",
    "baboon": "Primate with elongated muzzle and large, prominent buttocks.",
    "macaque": "Tail-carrying primates with cheek pouches for storage.",
    "langur": "Long-tailed arboreal primate, noted for high social interaction",
    "black-and-white colobus": "Distinct long-haired primate with facial fur tufts and tail tuft.",
    "proboscis monkey": "Long-nosed primate with large pendulous belly.",
    "marmoset": "Small, long-tailed primates with distinctive facial features.",
    "white-headed capuchin": "Small primate with prehensile tail and prominent forehead.",
    "howler monkey": "Largest New World monkeys with loud vocal cords.",
    "titi monkey": "Small-bodied primate with distinctive elongated, white ear tufts.",
    "Geoffroy's spider monkey": "Prehensile-tailed, larger-brained arboreal primate.",
    "common squirrel monkey": "Small primate with large eyes, long tail, arboreal lifestyle.",
    "ring-tailed lemur": "Long, striped tail and primate with a social lifestyle.",
    "indri": "Medium-sized lemur with a long tail and vocal communication abilities.",
    "Asian elephant": "Large mammal with long trunk and tusky mouth, native to Asia.",
    "African bush elephant": "Large animal with long tusks and muscular trunk.",
    "red panda": "Small mammal with striped tail and masked face, arboreal lifestyle.",
    "giant panda": "Large bear-like creature with prominent black patches around eyes.",
    "snoek fish": "Long, slender body with sharp, pointed snout; a deep sea fish.",
    "eel": "Long, slender body with smooth, scaleless skin.",
    "silver salmon": "Stream-spawning, medium-sized fish with streamlined silhouette.",
    "rock beauty fish": "Vibrantly scaled, tropical reef-dwelling marine fish.",
    "clownfish": "Small, oval-shaped tropical fish with distinctive striped patterns.",
    "sturgeon": "Large, elongated bodies with bony plates and whisker-like barbels.",
    "gar fish": "Long, slender body with sharp, beak-like jaws.",
    "lionfish": "Venomous spines on body, fan-like pectoral fins.",
    "pufferfish": "Inflates into a ball when threatened, filled with deadly toxin.",
    "abacus": "Traditional counting device with movable beads on rods.",
    "abaya": "Loose, floor-length robe often worn by women in Middle-East.",
    "academic gown": "Full-length garment, typically worn for graduation ceremonies.",
    "accordion": "Foldable bellows-style instrument with keyboard controls.",
    "acoustic guitar": "Hollow-bodied string instrument with a larger resonant soundbox.",
    "aircraft carrier": "Large naval vessel designed for deploying and recovering aircraft.",
    "airliner": "Large aircraft designed for transporting hundreds of passengers.",
    "airship": "A large, buoyant aircraft designed for long-distance travel.",
    "altar": "Religious stand for sacred rituals and offerings.",
    "ambulance": "Emergency vehicle equipped for medical attention and transportation.",
    "amphibious vehicle": "Operates on land and water; combines features of land and water vehicles.",
    "analog clock": "Time display via rotating hands on numbered circle.",
    "apiary": "Structured hives for beekeeping and honey production.",
    "apron": "Protective garment worn over front of clothes for cleanliness.",
    "trash can": "A container for storing waste, often found in public spaces.",
    "assault rifle": "Long-barreled, rapid-fire firearm designed for infantry use.",
    "backpack": "Portable storage worn on back for carrying items.",
    "bakery": "Storefront with baked goods and baking equipment on display.",
    "balance beam": "Long, narrow elevated platform for gymnastics performance.",
    "balloon": "Inflatable, airborne object with a round or oval shape.",
    "ballpoint pen": "A thin, elongated writing tool with a ball at the tip.",
    "Band-Aid": "Adhesive strip for minor wound coverage and protection.",
    "banjo": "A stringed instrument with a circular body and long neck.",
    "baluster / handrail": "Vertical support structure for stairs or balconies",
    "barbell": "Long rod with equal weight disks at both ends for weightlifting.",
    "barber chair": "Adjustable, rotating chair with reclining feature for hair services.",
    "barbershop": "A location providing haircut services, typically with iconic barber pole.",
    "barn": "A large, agricultural structure for storing farm goods and housing livestock.",
    "barometer": "A device measuring atmospheric pressure, often with a needle indicator.",
    "barrel": "Cylindrical container for storage, typically with curved sides and a flat base.",
    "wheelbarrow": "Single-wheeled cart, used for moving heavy loads.",
    "baseball": "Sport involving bats, balls, and running bases.",
    "basketball": "Round object used in a team-based, hoop-targeted sport.",
    "bassinet": "Portable, hooded cradle typically for newborns and infants",
    "bassoon": "Long woodwind instrument with distinctive reedy tone.",
    "swimming cap": "Waterproof head covering for swimming, enhances speed.",
    "bath towel": "Absorbent, large-sized fabric for drying body post-shower.",
    "bathtub": "Large basin for bathing, typically indoor and stationary.",
    "station wagon": "Extended rear cargo space, designed for passenger and goods transport.",
    "lighthouse": "Tall structure emitting light for navigational aid.",
    "beaker": "Cylindrical container with a spout used for scientific experiments.",
    "military hat (bearskin or shako)": "Tall, cylindrical headwear with a plume, signaling authority.",
    "beer bottle": "Cylindrical glass container with narrow neck for beer.",
    "beer glass": "Designed to hold beer, often tapering with a stem.",
    "bell tower": "Tall structure housing bells, typically associated with churches.",
    "baby bib": "Neckwear for infants designed for mealtime mess protection.",
    "tandem bicycle": "Two-seater bicycle designed for coordinated pedaling.",
    "bikini": "Two-piece, minimal coverage swimwear for women.",
    "ring binder": "A binder with metal rings for insertable papers.",
    "binoculars": "Compact dual lens device for distant viewing.",
    "birdhouse": "Small, usually wooden structure designed for housing birds.",
    "boathouse": "A structure designed for storing and maintaining boats.",
    "bobsleigh": "A high-speed winter sport involving downhill sled racing.",
    "bolo tie": "Neckwear with cord and decorative clasp, worn with collared shirts.",
    "poke bonnet": "Victorian-era hat, features a projecting brim for modesty.",
    "bookcase": "A furniture used for storing and displaying books.",
    "bookstore": "A place filled with diverse books for sale and knowledge exploration.",
    "bottle cap": "Small, round lid designed for sealing beverage containers.",
    "hunting bow": "Archery weapon with curved body and taut string.",
    "bow tie": "A neck accessory shaped as a symmetrical knot for formal attire.",
    "brass memorial plaque": "Dedicated, engraved metal commemorative display piece.",
    "bra": "Underwear garment supporting women's breasts with two cups and straps.",
    "breakwater": "A man-made structure reducing wave impacts on shore.",
    "breastplate": "Armor worn on chest for body protection in combat.",
    "broom": "Long-handled tool with stiff bristles for cleaning.",
    "bucket": "A cylindrical container for carrying and storing various materials.",
    "buckle": "Fastening device, typically made of metal, with prong and frame.",
    "bulletproof vest": "Body armor designed to absorb and disperse impact energy.",
    "high-speed train": "Streamlined design, designed for rapid long-distance transportation.",
    "butcher shop": "A retail storefront selling fresh meats and related products.",
    "taxicab": "Vehicle designed for public transportation of passengers.",
    "cauldron": "A rounded pot, typically for cooking and magical concoctions.",
    "candle": "Cylindrical wax object providing light through wick combustion.",
    "cannon": "Large cylindrical device for launching projectiles.",
    "canoe": "Long, narrow watercraft propelled by paddling.",
    "can opener": "Handheld tool designed for opening sealed metal cans.",
    "cardigan": "Knitted, buttoned front, long-sleeved unisex upper garment.",
    "car mirror": "Reflective surface for rear-view on vehicles.",
    "carousel": "Rotating platform displaying objects or images.",
    "tool kit": "A collection of various handy instruments for specific tasks.",
    "cardboard box / carton": "Rectangular, made of corrugated paper, used for packaging.",
    "car wheel": "Round, rubbery structure facilitating vehicle motion.",
    "automated teller machine": "Digital machine facilitating independent banking transactions.",
    "cassette": "Rectangular object with two spools for magnetic tape storage.",
    "cassette player": "Portable device with tape slots for audio playback.",
    "castle": "A large fortified building or set of buildings from the medieval period.",
    "catamaran": "Two-hulled watercraft with sails, designed for stability and speed.",
    "CD player": "Device designed to play compact discs with audio controls.",
    "cello": "A large, four-stringed instrument played with a bow.",
    "mobile phone": "Portable device for communication with touchscreen interface.",
    "chain": "Interconnected series of metal links for binding or connection.",
    "chain-link fence": "Interconnected, metallic mesh structure providing boundary and security.",
    "chain mail": "Interlinked metal rings forming a protective armor garment.",
    "chainsaw": "Motorized tool with a rotating chain cutting edge for woodwork.",
    "storage chest": "A box-shaped furniture for storing items, often with a hinged lid.",
    "chiffonier": "Tall, slender storage furniture with drawers.",
    "bell or wind chime": "Hanging, capable of creating soothing musical sounds.",
    "china cabinet": "A furniture piece for displaying and storing fine china.",
    "Christmas stocking": "Holiday-themed sock used for gift-giving tradition.",
    "church": "A religious building with steeple and nave for Christian worship.",
    "movie theater": "A large hall with screen, seats, projecting film-based entertainment.",
    "cleaver": "Large, heavyweight knife for chopping, distinctive broad blade.",
    "cliff dwelling": "Houses built into or on top of steep cliffs.",
    "cloak": "A loose outer garment providing full body coverage.",
    "clogs": "Backless footwear with thick wooden soles.",
    "cocktail shaker": "Cylindrical vessel with a lid for mixing beverages",
    "coffee mug": "Cylindrical design with handle, for holding hot beverages.",
    "coffeemaker": "Appliance for brewing coffee with a water reservoir and coffee chamber.",
    "spiral or coil": "Curved shapes looping continuously around a central point.",
    "combination lock": "Mechanical device with numbered dial for secure access.",
    "computer keyboard": "Input device with arranged keys for typing and command execution.",
    "candy store": "Storefront filled with assorted sweets, embodying childhood nostalgia.",
    "container ship": "Large vessel designed for transporting loaded shipping containers by sea.",
    "convertible": "Roof structure designed to fold down or detach.",
    "corkscrew": "Spiraled metal rod with handle, used for removing bottle corks.",
    "cornet": "A compact brass instrument with a conical bore.",
    "cowboy boot": "High, angled heel and pointed toe with western-themed designs.",
    "cowboy hat": "High-brimmed, creased crown hat, often associated with western wear.",
    "cradle": "An infant's compact bed with rocking mechanism.",
    "construction crane": "Tall structure with a movable boom for lifting heavy objects.",
    "crash helmet": "Protective headgear designed to absorb shocks from collisions.",
    "crate": "A sturdy, enclosed box-like structure for storing or transporting items.",
    "infant bed": "Small sized bed with safety barriers for babies.",
    "Crock Pot": "Round, lidded appliance for slow cooking food.",
    "croquet ball": "Spherical equipment used in outdoor mallet sports.",
    "crutch": "Long tool providing support for walking, with a crosspiece at top.",
    "cuirass": "Protective body armor, covers torso, typically made of metal.",
    "dam": "Large structure blocking and controlling water flow in rivers.",
    "desk": "Flat surface furniture for reading, writing, or working.",
    "desktop computer": "Stationary computing device with separate monitor and keyboard.",
    "rotary dial telephone": "Circular number dial, corded, traditional landline communication device.",
    "diaper": "Absorbent garment for infants' waste management.",
    "digital clock": "Displays time numerically via electronic interface.",
    "digital watch": "Timekeeping device displaying time digitally on a screen.",
    "dining table": "Flat, horizontal surface with legs for eating meals.",
    "dishcloth": "Fabric square used for cleaning dishware and kitchen surfaces.",
    "dishwasher": "Kitchen appliance for cleaning dishes and utensils automatically.",
    "disc brake": "Mechanical device used to slow or stop vehicles via friction.",
    "dock": "Structure to anchor ships, featuring water-access and load-unload facility.",
    "dog sled": "Vehicle pulled by dogs for transporting goods on snow.",
    "dome": "Architectural structure characterized by a curved, hemispherical shape.",
    "doormat": "Flat mat placed at entryway, aids in cleaning shoes.",
    "drilling rig": "Large machinery designed for wellbore drilling on land or sea.",
    "drum": "Cylindrical Percussion Instrument with Taut Surface.",
    "drumstick": "Cylindrical shape with tapered end, often linked to musical percussion.",
    "dumbbell": "Weighted equipment with grips for strength-building workouts.",
    "Dutch oven": "Thick-walled cooking pot with a tight-fitting lid.",
    "electric fan": "Device with rotating blades for air circulation.",
    "electric guitar": "Stringed instrument amplified by pickup, distinct rock music symbol.",
    "electric locomotive": "Rail vehicle powered by electricity and used for train propulsion.",
    "entertainment center": "Centralized hub for multimedia storage and display.",
    "envelope": "Rectangular container for letters with a sealable flap.",
    "espresso machine": "Compact appliance for brewing pressurized coffee.",
    "face powder": "Compact or loose form used for skin complexion enhancement.",
    "feather boa": "Long, soft scarf typically made from ostrich feathers.",
    "filing cabinet": "Rectangular storage unit with multiple pull-out drawers for files.",
    "fireboat": "A watercraft equipped for firefighting at sea or port.",
    "fire truck": "Large vehicle equipped with water pump for extinguishing fires.",
    "fire screen": "Meshed barrier protecting from fireplace sparks and embers.",
    "flagpole": "Vertical pole used for hoisting and displaying flags.",
    "flute": "Long, slender wind instrument with finger holes.",
    "folding chair": "Portable seating with collapsible frame for easy storage.",
    "football helmet": "Protective headgear with faceguard for playing football.",
    "forklift": "Heavy, motorized machine for lifting and moving materials.",
    "fountain": "Water structure releasing streams in artistic patterns.",
    "fountain pen": "Ink-filled, nib-tipped writing instrument for smooth writing.",
    "four-poster bed": "Bed with four vertical posts, one at each corner.",
    "freight car": "A large, enclosed vehicle for goods transport on railroads.",
    "French horn": "Large, circular brass instrument with flared bell and valves.",
    "frying pan": "Flat-bottomed cookware with a long handle, used for frying food.",
    "fur coat": "Outerwear made of thick, warm animal hair or synthetic equivalents.",
    "garbage truck": "Large vehicle designed for collecting and transporting waste.",
    "gas mask or respirator": "Covering for mouth and nose, filtering airborne contaminants.",
    "gas pump": "Stationary device for dispensing fuel into vehicles.",
    "goblet": "A stemmed vessel typically used for drinking wine.",
    "go-kart": "Small, open, four-wheeled vehicle for recreational racing.",
    "golf ball": "Small, spherical object with dimpled surface, used in golf game.",
    "golf cart": "Compact vehicle designed for golf course transportation.",
    "gondola": "Venetian flat-bottomed rowing boat with singular high stern",
    "gong": "Ancient percussive instrument with unique circular, flat shape.",
    "gown": "Long, flowing attire primarily designed for formal occasions.",
    "grand piano": "Large, wing-shaped instrument with horizontally strung strings.",
    "greenhouse": "Glass structure for cultivating and protecting plants.",
    "radiator grille": "Frontal vented cover for engine cooling in vehicles.",
    "grocery store": "A retail store selling varied food and household items.",
    "guillotine": "Bladed device used for swift, efficient executions.",
    "hair clip": "Accessory used to hold hair in place or style.",
    "hair spray": "Aerosol container for dispensing hair-styling product.",
    "half-track": "Vehicle with combined wheels and continuous tracks.",
    "hammer": "Heavy tool with a handle for striking objects or surfaces.",
    "hamper": "A portable container typically used for storing or transporting goods.",
    "hair dryer": "Handheld device blowing warm air for drying hair.",
    "hand-held computer": "Portable device with computing capabilities and data input/output interface.",
    "handkerchief": "A small, square fabric used for personal hygiene or accessorizing.",
    "hard disk drive": "Non-volatile, magnetic data storage device.",
    "harmonica": "A compact, handheld music instrument with multiple reeds.",
    "harp": "Stringed musical instrument with a triangular frame.",
    "combine harvester": "Large machinery with cutting blades for crop harvesting",
    "hatchet": "Compact tool with a sharp blade on one side for chopping.",
    "holster": "A container designed to secure and hold items, typically weapons.",
    "home theater": "High-quality audio-visual equipment for an immersive cinema experience.",
    "honeycomb": "Hexagonal structured, typically associated with bees and wax.",
    "hook": "Curved or angled device for catching, holding or pulling.",
    "hoop skirt": "A skirt widening dramatically from waist to hem, simulating a hoop shape.",
    "gymnastic horizontal bar": "Supported horizontal rod for gymnastic flips and swings.",
    "horse-drawn vehicle": "Vehicle propelled by horse, typically on wheels.",
    "hourglass": "Symmetrical structure narrowing at the center, signifying time passage.",
    "iPod": "Portable music device with click wheel interface.",
    "clothes iron": "Flat rectangular surface, used for pressing wrinkles out of fabric.",
    "carved pumpkin": "Hollowed, intricately cut designs, often portrays spooky faces.",
    "jeans": "Durable, close-fitting trousers made of denim material.",
    "jeep": "Rugged, off-road capable four-wheel drive vehicle.",
    "T-shirt": "Short-sleeved, collarless casual garment for upper body.",
    "jigsaw puzzle": "Interlocking pieces forming a complete picture when assembled.",
    "rickshaw": "Two-wheeled human-powered transportation with a covered seat.",
    "joystick": "Hand-held device with a central stick for digital control.",
    "kimono": "Traditional Japanese garment with wide sleeves and tied sash.",
    "knee pad": "Protective gear for knees, often used in sports or work.",
    "knot": "Interlaced and intertwined loops, signifying connection or binding.",
    "lab coat": "Long, collared wear typically used for scientific experiments.",
    "ladle": "Long handle with a deep bowl for serving liquids.",
    "lampshade": "Enclosing fixture for light diffusion and direction control.",
    "laptop computer": "Portable computing device with integrated keyboard and screen.",
    "lawn mower": "Machine with sharp blades for cutting grass evenly.",
    "lens cap": "Protective cover designed for camera lenses.",
    "letter opener": "A slim, sharp tool used for slicing open envelopes.",
    "library": "A collection of books, digital resources, and literary materials.",
    "lifeboat": "A small, sturdy vessel designed for emergency sea rescues.",
    "lighter": "Portable device generating flame for ignition purposes.",
    "limousine": "Long structured, luxurious vehicle for chauffeur-driven experiences.",
    "ocean liner": "Large, multi-decked vessel designed for long-distance passenger travel.",
    "lipstick": "Cylindrical beauty product for lip application.",
    "slip-on shoe": "Footwear without laces, designed for easy wearability.",
    "lotion": "Viscous liquid for skin hydration and nourishment.",
    "music speaker": "Portable device for audio playback with sound amplification.",
    "loupe magnifying glass": "Handheld tool for detailed enlargement.",
    "sawmill": "A manufacturing facility for processing logs into lumber.",
    "magnetic compass": "An instrument featuring a magnetized pointer indicating cardinal directions.",
    "messenger bag": "Crossbody strap, spacious interior, casual yet professional style.",
    "mailbox": "A container designed for storing and receiving mail.",
    "tights": "Form-fitting garment covering the body from waist to feet.",
    "one-piece bathing suit": "Single garment swimwear covering torso and hips.",
    "manhole cover": "Round, metallic, frequently embossed designed, urban utility cover.",
    "maraca": "A handheld percussion instrument with enclosed beads that shake.",
    "marimba": "Wooden-keyed percussion instrument with resonators.",
    "mask": "Coverage over face with openings for eyes and/or mouth.",
    "matchstick": "Long, thin tool with combustible tip for creating fire.",
    "maypole": "Tall pole with ribbons tied for traditional dance celebrations.",
    "maze": "A complex network of interconnected paths or passages.",
    "measuring cup": "A graduated container for gauging liquid or dry ingredients.",
    "medicine cabinet": "A wall-mounted storage unit for medications and healthcare products.",
    "megalith": "Large, ancient stone structures or monuments.",
    "microphone": "Audio capturing device with a cylindrical or round head.",
    "microwave oven": "Compact appliance designed to rapidly cook food using microwaves.",
    "military uniform": "Structured attire signifying military ranking and affiliation.",
    "milk can": "Cylindrical container with lid, used for storing and transporting milk.",
    "minibus": "Small-sized bus designed for transporting fewer passengers.",
    "miniskirt": "Short, above-knee clothing category for women.",
    "minivan": "Compact multi-seater vehicle with sliding side doors.",
    "missile": "Aerodynamic structure designed for high-speed guided flight.",
    "mitten": "A hand covering with separated thumb and enclosed fingers.",
    "mixing bowl": "Deep, round container for blending ingredients.",
    "mobile home": "Portable residence designed for road travel.",
    "ford model t": "First mass-produced automobile with a sturdy metal body.",
    "modem": "Device facilitating digital data transmission over phone lines.",
    "monastery": "A religious residence featuring architecture focused on tranquility and seclusion.",
    "monitor": "Screen device for outputting digital information visually.",
    "moped": "Two-wheeled motorized vehicle, smaller than motorcycles.",
    "mortar and pestle": "Grinding tools with bowl-shaped and club-like elements.",
    "graduation cap": "A square-boarded cap worn in academic ceremonies.",
    "mosque": "Religious building with dome and minarets for Islamic worship.",
    "mosquito net": "Fine-meshed structure for insect prevention.",
    "vespa": "Two-wheeled motorized vehicle with a step-through frame design.",
    "mountain bike": "Durable bikes designed for off-road cycling, equipped with sturdy tires.",
    "tent": "Portable shelter with a protective fabric covering and supportive frame.",
    "computer mouse": "Handheld device with buttons, used for controlling computer cursor.",
    "mousetrap": "Mechanical device designed for capturing and confining mice.",
    "moving van": "A large, box-shaped vehicle for transporting household belongings.",
    "muzzle": "A cover for animal's mouth preventing biting or noise.",
    "metal nail": "Hard, slender, sharp-pointed fastener used for construction.",
    "neck brace": "Supportive device encircling and stabilizing the neck.",
    "necklace": "Jewelry worn around the neck, often featuring decorative pendants.",
    "baby pacifier": "Small, nipple-like object for infants' oral comfort.",
    "notebook computer": "Portable computing device with a hinged display screen.",
    "obelisk": "Tall, thin, four-sided monolithic monument, tapering towards a pointed top.",
    "oboe": "Long, slender woodwind instrument with conical bore.",
    "ocarina": "Wind instrument with compact, ovate shape and finger holes.",
    "odometer": "Measures and displays traveled distance in vehicles.",
    "oil filter": "Cylindrical device for purifying engine oil.",
    "pipe organ": "Large musical instrument with multiple pipes producing varied pitches.",
    "oscilloscope": "A device displaying changing signal voltages in graphical form.",
    "overskirt": "Garment worn over a skirt for added style or coverage.",
    "bullock cart": "Traditional vehicle drawn by oxen for load-transportation.",
    "oxygen mask": "Face-covering device delivering breathable air in emergencies.",
    "product packet / packaging": "Encases items for protection and brand presentation.",
    "paddle": "A thin, flat tool for propelling and steering water-based vessels.",
    "paddle wheel": "Rotating wheel structure with attached paddles, used for propelling.",
    "padlock": "Portable device with U-shaped shackle for security purpose.",
    "paintbrush": "Artifact with bristles used for applying paint.",
    "pajamas": "Comfortable, loose-fitting sleepwear typically with a top and pants.",
    "palace": "Large, ornate architecture signifying royal residence.",
    "pan flute": "A series of connected, variously sized tubes played by blowing.",
    "paper towel": "Absorbent, disposable sheets for cleaning or drying.",
    "parachute": "Deployable canopy for controlled descent from high altitudes.",
    "parallel bars": "Two horizontal bars aligned parallel for gymnastic exercises.",
    "park bench": "Outdoor seating structure, commonly made of wood or metal.",
    "parking meter": "A device for collecting parking fees based on duration.",
    "railroad car": "Transportation vehicle designed for carrying cargo or passengers on rail tracks.",
    "patio": "Outdoor space for dining or relaxation with furniture.",
    "payphone": "Public device for making calls with coin or card payment.",
    "pedestal": "Upright support structure typically used for displaying items.",
    "pencil case": "Compact container for storing and organizing writing instruments.",
    "pencil sharpener": "Compact tool for refining pencil points, manual or electric.",
    "perfume": "Bottle containing aromatic liquid for personal scent enhancement.",
    "Petri dish": "Flat, circular glassware used for microbiological cultures.",
    "photocopier": "A machine that duplicates printed or written material visually.",
    "plectrum": "A flat device used for plucking or strumming stringed instruments.",
    "Pickelhaube": "German spiked helmet with decorative front plate.",
    "picket fence": "Vertical wooden boards uniformly spaced, symbolizing suburban tranquility.",
    "pickup truck": "A vehicle with enclosed cab, open cargo area at back.",
    "pier": "Structure extending over water for docking vessels.",
    "piggy bank": "A coin-storing container, often themed after a pig.",
    "pill bottle": "Cylindrical container with a secure lid for storing medication.",
    "pillow": "Soft, rectangular item designed for head support while sleeping.",
    "ping-pong ball": "Small, spherical, lightweight object used in table tennis.",
    "pinwheel": "Rotating toy windmill with radial pattern on blades.",
    "pirate ship": "Ancient maritime vessel with sails, known for piracy.",
    "drink pitcher": "Large container with handle and spout for serving beverages.",
    "block plane": "Compact woodworking tool for shaving surfaces smooth.",
    "planetarium": "A dome-shaped theater for showcasing astronomical shows.",
    "plastic bag": "Flexible, lightweight container with a sealed bottom and open top.",
    "plate rack": "A stand designed for holding and displaying plates.",
    "farm plow": "Large, typically metal implement for cultivating soil.",
    "plunger": "A tool with a stick attached to a rubber suction cup.",
    "Polaroid camera": "Instant photo development, rectangular frame design.",
    "pole": "Long, cylindrical structure used for support or elevation.",
    "police van": "Equipped for detainee transport and law enforcement operations.",
    "poncho": "Oversized, waterproof garment draping over body, without sleeves.",
    "pool table": "Rectangular table with pockets for billiards play.",
    "soda bottle": "Cylindrical container for carbonated beverages, typically plastic or glass.",
    "plant pot": "A container designed for holding and growing plants.",
    "potter's wheel": "Rotating device for shaping and molding clay.",
    "power drill": "Handheld tool for boring holes, with rotating drill bit.",
    "prayer rug": "Rectangular mat designated for religious worship with intricate designs.",
    "printer": "A device converting digital information into printed material.",
    "prison": "Enclosed, secure facility for punishment and rehabilitation.",
    "projector": "Device projecting visual content onto surfaces, facilitating display.",
    "hockey puck": "Flat, round object used for play in ice hockey games.",
    "punching bag": "Durable material sack, filled, used for boxing practice.",
    "purse": "Compact accessory for holding money and cards, often with handles.",
    "quill": "A writing instrument featuring sharp, elongated point, signifying elegance.",
    "quilt": "Woven fabric piece, used for warmth during sleep.",
    "race car": "Streamlined design for high-speed competition on racetracks.",
    "racket": "Long handle, oval frame with interlaced strings, for sports.",
    "radiator": "Heats room using energy, characterized by panel-like structure.",
    "radio": "Device with knobs or buttons for audio broadcast reception.",
    "radio telescope": "Large, dish-shaped antenna used for collecting radio waves from space.",
    "rain barrel": "A cylindrical container for collecting and storing rainwater.",
    "recreational vehicle": "Mobile living space designed for leisure travel and camping.",
    "fishing casting reel": "Rotating spool mechanism for precise casting in fishing.",
    "reflex camera": "Mirror mechanism for through-the-lens viewing and focusing.",
    "refrigerator": "Large, box-like appliance for preserving food items cold.",
    "remote control": "Handheld device with buttons for managing electronic devices remotely.",
    "restaurant": "Place serving food and drinks, with tables and chairs setup.",
    "revolver": "A handheld firearm with a revolving cylinder containing multiple chambers.",
    "rifle": "Long-barreled firearm designed for accurate long-range shooting.",
    "rocking chair": "A chair with curved legs enabling a back and forth motion.",
    "rotisserie": "Rotating cooking device for even heat distribution.",
    "eraser": "Rectangular object used for removing pencil marks.",
    "rugby ball": "Oval-shaped leather object for Rugby game.",
    "ruler measuring stick": "Long, straight device with marked increments for precise measurement.",
    "sneaker": "Casual, rubber-soled shoes for athletic activities.",
    "safe": "Robust structure designed for securing valuable items.",
    "safety pin": "A metal fastening device with a spring mechanism for secure closure.",
    "salt shaker": "Small container with perforated top for dispensing salt.",
    "sandal": "Open-toe footwear with straps securing to the foot.",
    "sarong": "Wraparound, long skirt worn as traditional attire.",
    "saxophone": "A wind instrument with a distinctive curved shape and keys.",
    "scabbard": "A protective sheath for swords and knives; emblem of readiness.",
    "weighing scale": "Device with a platform and display to measure weight.",
    "school bus": "Vehicle designed for student transportation with safety features.",
    "schooner": "A two-masted sailing vessel with fore-and-aft rigging.",
    "scoreboard": "A display panel showing points or results in a game or competition.",
    "CRT monitor": "Boxy design, displays images via electron beam.",
    "screw": "Cylindrical with spiraling ridge, used for fastening materials together.",
    "screwdriver": "A tool with cylindrical handle and flat/torx/phillips tip for turning screws.",
    "seat belt": "Strap designed for vehicle safety, fastens and secures passengers.",
    "sewing machine": "Mechanical device that stitches fabric using thread.",
    "shield": "Protective device designed to deflect or intercept attacks.",
    "shoe store": "A retail outlet selling variety of footwear for different occasions.",
    "shoji screen / room divider": "Japanese-style, foldable panels for space partitioning.",
    "shopping basket": "A container designed to hold and transport purchased items.",
    "shopping cart": "Mobile container for storing and transporting purchased items.",
    "shovel": "Long handle tool for digging and scooping earth/materials.",
    "shower cap": "Waterproof covering for hair, used during bathing.",
    "shower curtain": "Water-resistant fabric panel hanging in bathroom for privacy.",
    "ski": "Sloped equipment for snow-based movement and sports.",
    "balaclava ski mask": "Full-face coverage, thermal protection for skiing.",
    "sleeping bag": "Portable insulated enclosure for individual slumbering.",
    "slide rule": "Mechanical analog computer for multiplication and division.",
    "sliding door": "Door that moves horizontally along a track.",
    "slot machine": "A gambling device with rotating reels of varied symbols.",
    "snorkel": "A tube for breathing underwater, associated with diving activities.",
    "snowmobile": "Motorized vehicle designed for travel on snow.",
    "snowplow": "Large blade-fronted vehicle for clearing snow from roads.",
    "soap dispenser": "Container dispensing soap upon manual or automatic contact.",
    "soccer ball": "Spherical object with pentagonal and hexagonal patterns, used in sports.",
    "sock": "Footwear item, covers feet, often made of soft, stretchy material.",
    "solar thermal collector": "Converts solar energy into thermal energy, typically large panels.",
    "sombrero": "Broad-brimmed, high crowned hat, usually associated with Mexican culture.",
    "soup bowl": "Deep, circular dish for holding liquid meals.",
    "keyboard space bar": "Long, horizontal key for creating blank spaces in text.",
    "space heater": "Portable device providing localized heat emissions.",
    "space shuttle": "Reusable spacecraft for earth and space travel.",
    "spatula": "Flat, flexible blade for mixing, spreading or lifting food.",
    "motorboat": "Propelled on water by an internal combustion engine.",
    "spider web": "Interconnected strands forming intricate pattern, created by spiders.",
    "spindle": "Long, thin structure used for spinning and weaving.",
    "sports car": "High-performance, sleek design with two-door configuration.",
    "spotlight": "Focuses on highlighted subject, emphasizing its importance.",
    "stage": "A platform for performances and presentations.",
    "steam locomotive": "Vintage train powered by coal-fired steam engine.",
    "through arch bridge": "Arch structure with roadway passing directly through it.",
    "steel drum": "Percussion instrument made from a hollowed steel container.",
    "stethoscope": "Used for auscultation, entails a long tube with chest piece.",
    "scarf": "A long, often knitted accessory worn around the neck.",
    "stone wall": "Rigid structure composed of tightly stacked rocks.",
    "stopwatch": "Hand-held device for precise measurement of time intervals.",
    "stove": "Kitchen appliance used for cooking and heating food.",
    "strainer": "A perforated tool used for filtering or purifying liquids.",
    "tram": "Rail-based public transportation vehicle for urban travel.",
    "stretcher": "A long, flat device used for transporting injured people.",
    "couch": "Comfortable, upholstered furniture designed for multiple seatings.",
    "stupa": "Buddhist monument, dome-shaped with religious significance.",
    "submarine": "Underwater vessel designed for oceanic navigation and research.",
    "suit": "Formal ensemble with matched trousers and jacket.",
    "sundial": "A solar-powered device indicating time by shadow positioning.",
    "sunglasses": "Shaded eyewear protecting from sunlight and UV rays.",
    "sunscreen": "A protective lotion applied to prevent sunburn.",
    "suspension bridge": "Bridge supported by high towers and long, curved cables.",
    "mop": "Long-handled tool for cleaning floors.",
    "sweatshirt": "Long-sleeved, pullover garment, typically worn for warmth.",
    "swim trunks / shorts": "Short, water-resistant clothing for swimming activities.",
    "swing": "Seat suspended by ropes or chains, facilitating back and forth motion.",
    "electrical switch": "Device for interrupting an electrical circuit's flow.",
    "syringe": "Cylindrical device for liquid injection via a pointed needle.",
    "table lamp": "Portable light source with a base and covering shade.",
    "tank": "Armored vehicle designed for front-line combat with heavy firepower.",
    "tape player": "Device with rectangular shape for playing cassette tapes.",
    "teapot": "Container with a handle, spout, and lid for steeping and serving tea.",
    "teddy bear": "Stuffed toy shaped like a bear, often intended for cuddling.",
    "television": "Device with screen displaying visual and audio broadcast content.",
    "tennis ball": "Spherical object, used specifically for playing tennis.",
    "thatched roof": "Traditional, rustic covering made from dry vegetation.",
    "front curtain": "Primary drapery layer providing privacy and light control.",
    "thimble": "Small, metallic protective cap for fingertip sewing use.",
    "threshing machine": "Machine with rotating component for separating grain from stalks.",
    "throne": "A regal, elevated seat symbolizing power and authority.",
    "tile roof": "Clay or concrete material, interlocking for weather-resistant coverage.",
    "toaster": "Compact, box-shaped appliance for bread heating.",
    "tobacco shop": "A retail store specializing in selling tobacco products and accessories.",
    "toilet seat": "U-shaped plastic object designed for human comfort in sanitation.",
    "torch": "Portable light source typically fueled by combustion or electricity.",
    "totem pole": "Vertical wooden structures featuring symbolic carvings, often animal-themed.",
    "tow truck": "Vehicle with crane mechanism for vehicle recovery.",
    "toy store": "A venue filled with various children's playthings for purchase.",
    "tractor": "Large, heavy vehicle for farming or construction tasks.",
    "semi-trailer truck": "Large vehicle with separate cargo trailer, used for long-haul transport.",
    "tray": "A flat surface with raised edges for holding items.",
    "trench coat": "Long, durable coat, typically belted with weather-protective qualities.",
    "tricycle": "Three-wheeled vehicle primarily used for short distance travel.",
    "trimaran": "A boat with a main hull flanked by two smaller outrigger hulls.",
    "tripod": "Three-legged support device for balance and stability.",
    "triumphal arch": "Monumental gateway featuring one or three openings.",
    "trolleybus": "Electric public transport vehicle utilizing overhead wires.",
    "trombone": "A brass instrument with a slide mechanism for pitch alteration.",
    "hot tub": "Outdoor spa with warm water for relaxation and hydrotherapy.",
    "turnstile": "A mechanical gate controlling access by rotating arms.",
    "typewriter keyboard": "Character keys arranged in QWERTY layout for manual text input.",
    "umbrella": "Portable device with canopy for protection against weather.",
    "unicycle": "A one-wheeled, rider-controlled balance vehicle.",
    "upright piano": "Vertical structure, compact design, acoustic musical instrument.",
    "vacuum cleaner": "Device for suction-based dirt and dust removal.",
    "vase": "An open container typically used to hold flowers.",
    "vaulted or arched ceiling": "Curved structure spanning an interior space, providing overhead cover.",
    "velvet fabric": "Soft, densely piled and lustrous high-end luxury fabric.",
    "vending machine": "Automated machine for selling and dispensing items.",
    "vestment": "Religious clothing primarily used for ceremonial purposes.",
    "viaduct": "Bridged structure facilitating transport over obstacles.",
    "violin": "Stringed instrument with a shaped, wooden body and bow.",
    "volleyball": "Round ball with grip texture used in team sport",
    "waffle iron": "Kitchen tool with grid-patterned plates for making waffles.",
    "wall clock": "Mounted timepiece with hour, minute, and second hands.",
    "wallet": "Compact item for holding money and cards securely.",
    "wardrobe": "Furniture item designed for clothing storage.",
    "military aircraft": "Designed for warfare, features weapon systems and high-speed capabilities.",
    "sink": "A receptacle with a tap, used for washing or draining purposes.",
    "washing machine": "Appliance for laundering clothes with water and detergent.",
    "water bottle": "Cylinder-shaped container designed for holding and dispensing liquids.",
    "water jug": "Container with handle and spout for liquid storage and dispensing.",
    "water tower": "Large structure storing water, often elevated for pressure distribution.",
    "whiskey jug": "A container with a narrow neck for storing and pouring whiskey.",
    "whistle": "Small, cylindrical tool producing high-pitched sound when blown into.",
    "hair wig": "Synthetic or human hair designed for head coverage",
    "window screen": "Meshed frame allowing airflow while inhibiting insect entry.",
    "window shade": "Adjustable covering for window, controls light entry.",
    "Windsor tie": "Thick, wide triangular knot for formal occasions.",
    "wine bottle": "Long, cylindrical glass container for preserving and aging liquids.",
    "airplane wing": "Swept, rigid structure providing lift for flight.",
    "wok": "Round-bottomed pan for high-heat, quick cooking.",
    "wooden spoon": "Kitchen tool crafted with natural wood for stirring or serving.",
    "wool": "Soft, textured fiber, primarily used for warm clothing",
    "split-rail fence": "Rustic fence made from timber logs arranged in zigzag pattern.",
    "shipwreck": "Submerged, deteriorated remains of a wrecked vessel at sea.",
    "sailboat": "Water vessel with a mast carrying sails for propulsion.",
    "yurt": "Portable, circular tent with conical roof, originally used by nomads.",
    "website": "Online platform providing information, services, or entertainment.",
    "comic book": "Sequentially illustrated narrative with text in speech bubbles.",
    "crossword": "Grid of squares, filled with intersecting words or phrases",
    "traffic or street sign": "Rectangular or shape-varied signs displaying road instructions.",
    "traffic light": "Vertical arrangement of signal lights guiding vehicular flow.",
    "dust jacket": "A protective paper cover for books.",
    "menu": "Lists options for selection in a hierarchical manner.",
    "plate": "Flat, typically round object for serving or eating food.",
    "guacamole": "A creamy, textured dip made from mashed avocados.",
    "consomme": "Clear, richly flavored, finely strained soup.",
    "hot pot": "Communal dish for boiling food in flavorful broth.",
    "trifle": "Layered dessert with visually discernible contrasting textures.",
    "ice cream": "Cold, sweet dessert usually served in a cone or bowl.",
    "popsicle": "Frozen treat on a stick, typically fruit or cream based.",
    "baguette": "Long, thin, crusty French bread",
    "bagel": "Round, hole-centered bread; chewy texture, often topped with seeds.",
    "pretzel": "Twisted knot-shaped, savory or sweet baked snack.",
    "cheeseburger": "A layered patty, cheese, and condiments within a bun.",
    "hot dog": "Sausage in a split roll, often garnished with condiments.",
    "mashed potatoes": "Smooth, creamy potato dish with a rich, buttery taste",
    "cabbage": "Leafy edible vegetable with tightly layered leaves.",
    "broccoli": "Dense clusters of edible, green, bud-like heads on thick stalks.",
    "cauliflower": "Cruciferous vegetable with compact, dense, branch-like clusters.",
    "zucchini": "Cylindrical vegetable with smooth skin and dense flesh.",
    "spaghetti squash": "Oblong melon-shaped vegetable with stringy, pasta-like flesh.",
    "acorn squash": "Rounded shape with ridged skin, taste is somewhat sweet and nutty.",
    "butternut squash": "Long, bell-shaped vegetable with ridged, thick skin.",
    "cucumber": "Long, cylinder-shaped vegetable with textured skin.",
    "artichoke": "A green thistle-like vegetable with fluted, leafy layers.",
    "bell pepper": "Rounded vegetable with thick, glossy skin and hollow interior.",
    "cardoon": "Thistle-like plant with large, edible, fleshy stalks.",
    "mushroom": "Fleshy fungi with a stem and cap, often seen in damp environments.",
    "Granny Smith apple": "Round, firm fruit known for tart, crisp flavor.",
    "strawberry": "Small, heart-shaped fruit with tiny exterior seeds.",
    "orange": "Citrus fruit with a distinctive sweet-tangy flavor and round shape.",
    "lemon": "Oval shaped, citric fruit with a distinctive sourness.",
    "fig": "Edible, pear-shaped fruit with numerous small seeds inside.",
    "pineapple": "Tropical fruit with a spiky, diamond-patterned skin and lush crown.",
    "banana": "Long, curved edible fruit with a thick peel.",
    "jackfruit": "Large, spiky exterior with sweet and fibrous fruit inside.",
    "cherimoya (custard apple)": "Heart-shaped, scaly green skin, and cream-colored pulpy fruit.",
    "pomegranate": "Globular fruit with a tough, leathery skin and numerous seeds.",
    "hay": "Dried grass typically used for animal feed.",
    "carbonara": "Classic Italian pasta dish with creamy sauce and bacon.",
    "chocolate syrup": "Visually thick, used as topping in desserts and beverages.",
    "dough": "Pliable mixture primarily used for baking or cooking.",
    "meatloaf": "Baked, densely packed ground meat in a loaf shape.",
    "pizza": "Round, flat dough topped with various ingredients, typically served sliced.",
    "pot pie": "Savory filling enclosed in a baked crust, typically round.",
    "burrito": "Wrapped food item with internal fillings, popular in Mexican cuisine.",
    "red wine": "Aged alcohol with intense aromas served in specific glassware.",
    "espresso": "Short, concentrated coffee shot with crema top layer.",
    "tea cup": "Round, handle-attached vessel for hot beverages.",
    "eggnog": "Creamy holiday beverage with a frothy texture and nutmeg dusting.",
    "mountain": "Elevated landform with steep or sloping sides, peaks at summit.",
    "bubble": "Spherical, transparent, and filled with gas or liquid",
    "cliff": "Steep rock face formed by erosion and weathering.",
    "coral reef": "Underwater ecosystem populated by diverse marine life and corals.",
    "geyser": "Natural hot spring that periodically ejects heated water and steam.",
    "lakeshore": "Land meeting water body, often with varying terrain and vegetation.",
    "promontory": "High, narrow projection of land overlooking a water body.",
    "sandbar": "A long, narrow landform within the water body.",
    "beach": "Coastal landscape with sand and natural water body.",
    "valley": "A deep, elongated lowland between hills or mountains.",
    "volcano": "Mountainous structure ejecting molten rock from Earth's crust.",
    "baseball player": "Uniformed individual swinging a bat at a ball.",
    "bridegroom": "Man dressed formally, often in tuxedo, for wedding ceremony.",
    "scuba diver": "Underwater explorer with specialized breathing equipment.",
    "rapeseed": "Small, round seeds used primarily in oil production.",
    "daisy": "Daisy: Petal-ringed center, symbolizes innocence and purity.",
    "yellow lady's slipper": "Orchid with unique shoe-shaped petal and twisty sepals.",
    "corn": "Cylindrical grain, grows in tightly packed rows on a cob.",
    "acorn": "Hard-shelled nut with a distinctive cap, produced by oak trees.",
    "rose hip": "Round, seed-filled fruit of a rose plant.",
    "horse chestnut seed": "Rounded seed with a shiny surface from horse chestnut tree.",
    "coral fungus": "Tree-like branching structure bearing spores on their surfaces.",
    "agaric": "Gilled, saprophytic fungi with umbrella-shaped cap.",
    "gyromitra": "Large, brain-like cap on a thick, often wrinkled stalk.",
    "stinkhorn mushroom": "phallic-shaped fungi releasing foul, insect-attracting odor",
    "earth star fungus": "Spherical fungi, bursts open to reveal star shape.",
    "hen of the woods mushroom": "Large, overlapping caps on singular stem, resembling bird's feathers.",
    "bolete": "Fungi with sponge-like pores under cap, no gills.",
    "corn cob": "Long cylindrical shape with multiple rows of kernels.",
    "toilet paper": "Cylindrical, soft, absorbent hygiene product for personal cleanliness."
}