{
    "abyssinian": "Distinctive, large ears and gentle yet lively demeanor.",
    "american bulldog": "Powerful, muscular build with a friendly, protective nature.",
    "american pit bull terrier": "Muscular build, square head, and courageous, tenacious demeanor.",
    "basset hound": "Long, droopy ears and exceptional scent-tracking abilities.",
    "beagle": "Small, sturdy hound breed with exceptional scent tracking abilities.",
    "bengal": "Bengal cats: Leopard-like markings with highly playful, active behavior.",
    "birman": "Silky fur and sapphire eyes, known for docile and loving nature.",
    "bombay": "Sleek, muscular body with an affectionate, intelligent character.",
    "boxer": "Muscular build, high-energy, and playful yet protective demeanor.",
    "british shorthair": "Plush, dense coat and notable round face with chubby cheeks.",
    "chihuahua": "Tiny size, erect ears, apple-shaped head; alert and energetic.",
    "egyptian mau": "Spotted coat, gooseberry green eyes, muscular yet agile body.",
    "english cocker spaniel": "Compact, sporting dog with long, low-set ears and joyful energy.",
    "english setter": "Uniquely feathered coat, athletic, and excellent bird hunting skills.",
    "german shorthaired": "Versatile hunting dog with distinctively webbed feet and muscular physique.",
    "great pyrenees": "Regal mountain dogs, known for large size and abundant fur.",
    "havanese": "Small, silky-coated dog with playful, affectionate demeanor.",
    "japanese chin": "Compact toy breed with a distinctive oriental expression.",
    "keeshond": "Dense double-coat, foxy face, and an expressive manner.",
    "leonberger": "Massive body, lion-like mane and gentle, patient temperament.",
    "maine coon": "Large size, tufted ears, and fluffy tail; adaptable and affectionate.",
    "miniature pinscher": "Small, muscular dog with high energy and distinctive pointed ears.",
    "newfoundland": "Large-size, water-resistant coat, strong swimmer with gentle demeanor.",
    "persian": "Long-haired, flat-faced, and exceptionally plush feline breed.",
    "pomeranian": "Compact size, plush double coat, and lively, spirited nature.",
    "pug": "Compact body with deep wrinkles and a distinctive pushed-in face.",
    "ragdoll": "Large, flopsy cats with striking blue eyes and gentle nature.",
    "russian blue": "Short dense fur, muscular build, highly intelligent and docile.",
    "saint bernard": "Large, muscular body with expressive eyes and a hospitable nature.",
    "samoyed": "Thick, fluffy coat with an exceptionally friendly, gentle temperament.",
    "scottish terrier": "Compact, confident dog with a thick weather-resistant coat.",
    "shiba inu": "Fox-like face with a spirited, good-natured personality.",
    "siamese": "Sleek body, almond-shaped blue eyes, and strong, muscular grace.",
    "sphynx": "Sphynx: A hairless, wrinkled cat breed with large ears and eyes.",
    "staffordshire bull terrier": "Muscular build, short coat, strong jaw, friendly and courageous.",
    "wheaten terrier": "Long, silky hair and exceptionally friendly and energetic demeanor.",
    "yorkshire terrier": "Compact toy size with distinct long, straight silky coat."
}