{
    "pink primrose": "Night-blooming, saucer-shaped flowers with distinctively heart-shaped leaves.",
    "hard-leaved pocket orchid": "This orchid category uniquely possesses tough, pouch-shaped petals.",
    "canterbury bells": "Canterbury Bells': Bell-shaped flowers arranged in towering clusters.",
    "sweet pea": "Sweet Pea: Delicate, winged petals wrapping spiralling tendrils; symbolizes blissful pleasure.",
    "english marigold": "Compact, double-stacked petal formation, symbolizes grief and despair.",
    "tiger lily": "Spotted petals characterizing wild, aggressive beauty.",
    "moon orchid": "Moon Orchids display a symmetrical, rounded form, symbolizing unity and coherence.",
    "bird of paradise": "Exotic shape embodying bird-like appearance with unique bloom structure.",
    "monkshood": "Helmet-shaped blossoms with distinct sepals, symbolizing caution.",
    "globe thistle": "Globe-shaped, prickly textured flowers embodying resilience and protection.",
    "snapdragon": "Dragon-shaped petals opening with squeezed sides, herbaceous perennial.",
    "colt's foot": "Colt's foot: Hoof-shaped leaves, flowers precede foliage growth.",
    "king protea": "King Protea: Largest flower head with unique crown-like structure.",
    "spear thistle": "'Spear Thistle': Characterized by its spiny stem and flower head.",
    "yellow iris": "Petals arch elegantly, symbolizing wisdom and valued friendship.",
    "globe-flower": "Spherical blossoms with a honeycomb pattern on uniquely layered petals.",
    "purple coneflower": "Cone-shape center with drooping petals; thrives in dry environments.",
    "peruvian lily": "Clustered, trumpet-shaped flowers with vivid inner speckles.",
    "balloon flower": "Balloon-like buds open to star-shaped flowers; symbolizes unchanging love.",
    "giant white arum lily": "Large, cone-shaped inflorescence with prominent, spirally arranged spadix.",
    "fire lily": "Resilient to fire, uniquely shaped like burning flames.",
    "pincushion flower": "Pincushion-like central part with protruding thin petals.",
    "fritillary": "Fritillary exhibits unique checkered petals pattern, symbolising rebirth in mythology.",
    "red ginger": "Stalk-like growth with cone-shaped inflorescences, tropical origins.",
    "grape hyacinth": "Upright clusters of bell-shaped flowers resembling grape bunches.",
    "corn poppy": "Single, delicate, cup-shaped blooms on slender, hairy stems.",
    "prince of wales feathers": "Triadic feather-like petal arrangement depicting royal insignia.",
    "stemless gentian": "Lacks a stem and exhibits radial symmetry",
    "artichoke": "Large, globe-shaped bud with layered, pointed petals; edible.",
    "sweet william": "Clustered, serrated petals embodying rustic elegance.",
    "carnation": "Fringed petals with a clove-like scent, symbolic of love and fascination.",
    "garden phlox": "Clustered blooms atop tall, persistent stems with five petal-points.",
    "love in the mist": "Delicate, feathery foliage encapsulating a central, bold bloom.",
    "mexican aster": "Daisy-like petals and heart-shaped leaves, symbol of love and peace.",
    "alpine sea holly": "Thistle-like bloom, distinct silver-blue hue, loved in rock gardens.",
    "ruby-lipped cattleya": "Large, orchid blooms with gracefully positioned, wavy-edged petals.",
    "cape flower": "Five petalled blooms with distinct funnel shape, native to South Africa.",
    "great masterwort": "Star-shaped cluster, symbolizing strength and protection.",
    "siam tulip": "Curled petals shape forming a star-like bloom pattern.",
    "lenten rose": "Early-blooming, downward-facing flowers with high frost tolerance.",
    "barbeton daisy": "Resilient petals encasing a prominent tubular disk structure.",
    "daffodil": "Central trumpet-shaped corona, surrounded by a ring of petals.",
    "sword lily": "Sword-like leaves with symmetrical, upright petal arrangement.",
    "poinsettia": "Star-shaped cluster with large, leaf-like bracts surrounding tiny flowers.",
    "bolero deep blue": "Vibrant, double-petaled blooms with exquisite perfume, thriving in summers.",
    "wallflower": "Clustered blooms, perennial growth, high resilience.",
    "marigold": "Multi-layered petals arranged around a prominent central disc.",
    "buttercup": "Cup-shaped petals with reflective, glossy surface; symbolizes humility",
    "oxeye daisy": "Disk-shaped center encircled by radiating, linear petals; hardy perennial.",
    "common dandelion": "Distinctive spherical seed head with parachuting seeds.",
    "petunia": "Petunia: Funnel-shaped flowers associated with desire and passion.",
    "wild pansy": "Heart-shaped petals arranged in a distinctive tri-color pattern.",
    "primula": "Five-petaled blossom forms a distinct tube-shaped base.",
    "sunflower": "Large, disc-shaped head that moves to track the sun.",
    "pelargonium": "Pelargoniums: distinctively unique lobed leaves and asymmetrical flower petals.",
    "bishop of llandaff": "Distinctive tall spikes with dense clusters; symbolic of purity.",
    "gaura": "Long, slender stalks bearing delicate butterfly-like blooms.",
    "geranium": "Geraniums; characterized by rounded, five-petaled flowers and bilobed leaves.",
    "orange dahlia": "Large, spherical blooms showcasing intricately layered petals.",
    "pink-yellow dahlia": "Layered petals forming a spherical formation with distinct circular symmetry.",
    "cautleya spicata": "Hardy ginger-like plants with tall, terminal, dense spike inflorescences.",
    "japanese anemone": "Late-blooming, multi-petal formation, hardy perennial plant.",
    "black-eyed susan": "Daisy-like shape with conical, button-like center.",
    "silverbush": "Silverbush: Defined by silvery foliage, resilience in harsh environments.",
    "californian poppy": "Distinct cup-shaped form, radiant petals, symbolizes sleep with a nocturnal pollination cycle.",
    "osteospermum": "Daisy-like flowers with spoon-shaped petals radiating from a central disc.",
    "spring crocus": "Early-blooming, cup-shaped flowers, symbolizing rebirth and new beginnings.",
    "bearded iris": "Distinctive bearded 'falls' and three upward 'standards' arrangement.",
    "windflower": "Delicate, multi-petaled blossoms expressing unfettered wilderness.",
    "tree poppy": "Large, four-petaled blooms with papery texture, often evergreen shrubs.",
    "gazania": "Daisy-like structure with dramatic, concentric markings.",
    "azalea": "Shrub growth habit with distinct veined, ovate leaves.",
    "water lily": "Floating aquatic plants with circular leaves and distinct radiate flowers.",
    "rose": "Symbol of love and beauty, typically has thorns and layered petals.",
    "thorn apple": "Spherical capsule with spiky surface, symbolizing protection and resilience.",
    "morning glory": "Vine-growing, trumpet-shaped blossoms embodying renewal and rebirth.",
    "passion flower": "Complex, star-shaped flowers with a unique, intricate center.",
    "lotus": "Floating water blossom with distinct radial symmetry and seedpod center.",
    "toad lily": "Star-shaped flowers with intricate, impactful patterns, thrives in shade.",
    "anthurium": "Heart-shaped, waxy texture, with a prominent central spadix.",
    "frangipani": "Star-shaped, fragrant petals on clustered blooms with thick resilient leaves.",
    "clematis": "Clematis: vining flowers with four-petal symmetry, trellis-loving climbers.",
    "hibiscus": "Large, trumpet-shaped flowers with visible long central staminal column.",
    "columbine": "Spurred petals with five distinct sections, symbolizing faithfulness.",
    "desert-rose": "Succulent leaves with star-shaped cluster blooms; remarkably drought-tolerant.",
    "tree mallow": "Tree Mallow: Uniquely large-leaved, tall-growing, seaside-adaptive flowering plants.",
    "magnolia": "Large, fragrant flowers blooming on bare branches pre-spring.",
    "cyclamen": "Cyclamen: Heart-shaped leaves with unique downward-facing blooms.",
    "watercress": "Small, round-leaved aquatic perennial with hollow, floating stems.",
    "canna lily": "Broad, paddle-shaped leaves with tall, columnar inflorescences.",
    "hippeastrum": "Large, funnel-shaped blooms on tall scapes; symbol of pride.",
    "bee balm": "Bee Balm: Unique tubular blooms with a distinct whorled appearance.",
    "ball moss": "Epiphytic, spherical structure, thrives on Live Oak trees.",
    "foxglove": "Bell-shaped flowers on tall spikes; toxic, medicinal value.",
    "bougainvillea": "Bougainvillea: Thorns and vine-like cascading growth, thrives in heat.",
    "camellia": "Evergreen leaves with large, layered, and glossy blooms.",
    "mallow": "Mallow Flowers: Five-petaled symmetry embodying simplicity and hardiness.",
    "mexican petunia": "Tubular blooms on tall stalks, tolerant to heat and drought.",
    "bromelia": "Resilient rosette design, uniquely adapted for water storage.",
    "blanket flower": "Daisy-like blossoms with a spherical center, embodying rugged longevity.",
    "trumpet creeper": "Trumpet-shaped blooms on vine, symbolizing robust growth and adaptability.",
    "blackberry lily": "Uniquely features speckled petals tapering toward a fan-like disposition."
}