{
    "2000 AM General Hummer SUV": "Military-inspired design, unparalleled off-road capabilities.",
    "2012 Acura RL Sedan": "Upscale, sleek design with advanced safety and technology features.",
    "2012 Acura TL Sedan": "Sporty elegance with a powerful V6 engine and advanced tech features.",
    "2008 Acura TL Type-S": "Sporty luxury sedan with robust V6 engine and sophisticated interior.",
    "2012 Acura TSX Sedan": "Compact luxury sedan with sporty handling and advanced tech features.",
    "2001 Acura Integra Type R": "High-performing compact, exceptional handling, aerodynamic spoiler.",
    "2012 Acura ZDX Hatchback": "Luxurious crossover with coupe-like design and advanced tech features.",
    "2012 Aston Martin V8 Vantage Convertible": "Iconic roadster design with exceptional V8 engine performance.",
    "2012 Aston Martin V8 Vantage Coupe": "Sleek design, bold aerodynamics, supreme handling luxury sports coupe.",
    "2012 Aston Martin Virage Convertible": "Elegant design with exclusive hand-built V12 engine performance.",
    "2012 Aston Martin Virage Coupe": "Iconic swan wing doors with luxurious V12 performance engine.",
    "2008 Audi RS 4 Convertible": "High-performance V8 engine with convertible top luxury design.",
    "2012 Audi A5 Coupe": "Sleek design with superior handling, embodies luxury and performance.",
    "2012 Audi TTS Coupe": "Compact size, sporty design with turbocharged performance and quattro AWD.",
    "2012 Audi R8 Coupe": "Mid-engine, quattro AWD, distinctive sideblades, high-performance luxury.",
    "1994 Audi V8 Sedan": "Quattro all-wheel drive system, V8 engine, prominent grille design.",
    "1994 Audi 100 Sedan": "Iconic aerodynamic design, epitomizes German engineering and luxury.",
    "1994 Audi 100 Wagon": "Spacious luxury wagon with signature 90s boxy design.",
    "2011 Audi TT Hatchback": "Sleek design, sporty performance in a compact hatchback form.",
    "2011 Audi S6 Sedan": "High-performance luxury sedan with V10 engine and Quattro AWD.",
    "2012 Audi S5 Convertible": "Sporty elegance with a retractable roof for open-air freedom.",
    "2012 Audi S5 Coupe": "Sleek design, powerful performance, luxurious interiors",
    "2012 Audi S4 Sedan": "Performance-oriented luxury sedan with distinctive sporty design.",
    "2007 Audi S4 Sedan": "Quattro all-wheel drive, high-performance V8 luxury sedan.",
    "2012 Audi TT RS Coupe": "Compact design with high-performance, turbocharged five-cylinder engine.",
    "2012 BMW ActiveHybrid 5 Sedan": "Hybrid performance sedan, combines luxury and eco-friendliness.",
    "2012 BMW 1 Series Convertible": "Compact luxury with distinctive retractable soft-top design.",
    "2012 BMW 1 Series Coupe": "Compact luxury with distinctive sporty design and superior handling.",
    "2012 BMW 3 Series Sedan": "Streamlined design, advanced technology, superior handling dynamics.",
    "2012 BMW 3 Series Wagon": "Sporty design, superior handling, extensive cargo space.",
    "2007 BMW 6 Series Convertible": "Retractable top, sporty elegance, superior power, BMW luxury driving.",
    "2007 BMW X5 SUV": "Luxury compact SUV with superior off-road capabilities.",
    "2012 BMW X6 SUV": "Sporty performance in a luxury SUV crossover silhouette.",
    "2012 BMW M3 Coupe": "High-performance V8 engine with athletic design and luxurious interior.",
    "2010 BMW M5 Sedan": "Powerful V10 engine, unique quad exhaust, luxurious interior design.",
    "2010 BMW M6 Convertible": "V10 engine, retractable roof, sporty design, luxurious interior.",
    "2012 BMW X3 SUV": "Compact luxury SUV with superior handling, design and performance.",
    "2012 BMW Z4 Convertible": "Retractable hardtop, sporty design, luxury comfort, powerful performance.",
    "2012 Bentley Continental Supersports Conv. Convertible": "Ultra-luxury convertible, sporting high-speed performance, and exquisite craftsmanship.",
    "2009 Bentley Arnage Sedan": "Iconic British luxury, grand stature, Twin-Turbocharged V8 engine.",
    "2011 Bentley Mulsanne Sedan": "Ultra-luxurious, traditional craftsmanship, powerful V8 engine, timeless elegance.",
    "2012 Bentley Continental GT Coupe": "Luxurious grand tourer with unique W12 engine and all-wheel drive.",
    "2007 Bentley Continental GT Coupe": "Luxury coupe with distinctive W12 engine, opulent interiors.",
    "2007 Bentley Continental Flying Spur Sedan": "Luxury sedan with a powerful W12 engine and distinctive craftsmanship.",
    "2009 Bugatti Veyron 16.4 Convertible": "Quad-turbocharged engine with distinct horseshoe grille design.",
    "2009 Bugatti Veyron 16.4 Coupe": "Iconic horseshoe grille, unparalleled speed, and opulent luxury.",
    "2012 Buick Regal GS": "High-performance luxury sedan with Turbocharged engine and opulent interior",
    "2007 Buick Rainier SUV": "Midsize SUV merging luxury design with off-road functionality.",
    "2012 Buick Verano Sedan": "Compact luxury sedan with premium features and smooth ride.",
    "2012 Buick Enclave SUV": "Roomy three-row seating with luxurious, premium-styled interior.",
    "2012 Cadillac CTS-V Sedan": "Supercharged V8 engine, aggressive aesthetics, high-performance luxury.",
    "2012 Cadillac SRX SUV": "Compact luxury crossover with distinctive Cadillac styling cues.",
    "2007 Cadillac Escalade EXT Crew Cab": "Luxury SUV-truck hybrid featuring spacious crew cab design.",
    "2012 Chevrolet Silverado 1500 Hybrid Crew Cab": "Hybrid pickup with spacious crew cab and distinctive towing capacity.",
    "2012 Chevrolet Corvette Convertible": "Removable roof panel, powerful V8 engine, sporty yet luxurious.",
    "2012 Chevrolet Corvette ZR1": "High-performance supercar with distinctive rear spoiler and aerodynamic design.",
    "2007 Chevrolet Corvette Ron Fellows Edition Z06": "Limited edition, Z06 performance package, signature Ron Fellows accents.",
    "2012 Chevrolet Traverse SUV": "Spacious three-row seating with lustrous SUV design and superior handling.",
    "2012 Chevrolet Camaro Convertible": "Retractable roof and high-performance V6 engine.",
    "2010 Chevrolet HHR SS": "Retro-wagon design with high-performance turbocharged engine.",
    "2007 Chevrolet Impala Sedan": "Sleek design with spacious interior, famed for fuel efficiency.",
    "2012 Chevrolet Tahoe Hybrid SUV": "Hybrid efficiency, SUV space, visually robust and rugged outlook.",
    "2012 Chevrolet Sonic Sedan": "Compact design, distinctive tail-shaped rear end, high fuel efficiency.",
    "2007 Chevrolet Express Cargo Van": "Spacious interior designed for cargo transport, robust body structure.",
    "2012 Chevrolet Avalanche Crew Cab": "Crew cab pickup with unique fold-down midgate for extended cargo space.",
    "2010 Chevrolet Cobalt SS": "High-performance compact with turbocharged engine and sport-tuned suspension.",
    "2010 Chevrolet Malibu Hybrid Sedan": "Hybrid engine sedan with distinctive Chevrolet styling and comforts.",
    "2009 Chevrolet TrailBlazer SS": "High performance SUV with a powerful V8 SS engine.",
    "2012 Chevrolet Silverado 2500HD Regular Cab": "Powerful full-size pick-up with exceptional towing capacity.",
    "2007 Chevrolet Silverado 1500 Classic Extended Cab": "Extended Cab for extra space, Classic Chevrolet rugged design.",
    "2007 Chevrolet Express Van": "Robust full-size van, renowned for its superior cargo capacity.",
    "2007 Chevrolet Monte Carlo Coupe": "Sporty two-door design with high-performance V6 engine.",
    "2007 Chevrolet Malibu Sedan": "Mid-size sedan expressing comfort and reliability, with distinctive grille.",
    "2012 Chevrolet Silverado 1500 Extended Cab": "Extended cab for spacious cargo and passenger accommodation.",
    "2012 Chevrolet Silverado 1500 Regular Cab": "Full-size pickup, robust performance, spacious regular cab layout.",
    "2009 Chrysler Aspen SUV": "Three-row seating luxury SUV with prominent grille design.",
    "2010 Chrysler Sebring Convertible": "Retractable hardtop providing convertible functionality with coupe comfort.",
    "2012 Chrysler Town and Country Minivan": "Spacious family minivan with advanced entertainment and safety features.",
    "2010 Chrysler 300 SRT-8": "High-performance, bold sedan with distinctive SRT-8 modifications.",
    "2008 Chrysler Crossfire Convertible": "Retractable hardtop featuring unique boat-tail rear design.",
    "2008 Chrysler PT Cruiser Convertible": "Retro styled compact convertible with versatile interior design.",
    "2002 Daewoo Nubira Wagon": "Compact wagon design with distinctive hatchback versatility.",
    "2012 Dodge Caliber Wagon": "Compact crossover with hatchback design and sturdy SUV-like aesthetics.",
    "2007 Dodge Caliber Wagon": "Crossover design with distinctive high stance and versatile interior.",
    "1997 Dodge Caravan Minivan": "Compact, family-oriented, spacious interior with three-row seating.",
    "2010 Dodge Ram Pickup 3500 Crew Cab": "Large, powerful crew cab pickup with outstanding towing capability.",
    "2009 Dodge Ram Pickup 3500 Quad Cab": "Quad-cab, heavy-duty hauler with outstanding towing capacity.",
    "2009 Dodge Sprinter Cargo Van": "Spacious interior with high roof for cargo versatility.",
    "2012 Dodge Journey SUV": "Mid-sized crossover combining interior spaciousness and agile handling.",
    "2010 Dodge Dakota Crew Cab": "Sizable crew cab, robust body, power-packed V8 engine.",
    "2007 Dodge Dakota Club Cab": "Extended rear cabin, rugged profile for on/off-road versatility.",
    "2008 Dodge Magnum Wagon": "Sporty Wagon Design with Exceptional Cargo Space and Power.",
    "2011 Dodge Challenger SRT8": "Retro-inspired design with powerful HEMI V8 engine performance.",
    "2012 Dodge Durango SUV": "Spacious SUV with robust design, powerful engine, and superior agility.",
    "2007 Dodge Durango SUV": "Rugged, spacious SUV with robust towing capabilities.",
    "2012 Dodge Charger Sedan": "Muscular design with superior performance, embodying American muscle spirit.",
    "2009 Dodge Charger SRT-8": "High-performance Sedan with distinctive hood scoop and dual exhaust.",
    "1998 Eagle Talon Hatchback": "Compact hatchback with unique pop-up headlight design.",
    "2012 FIAT 500 Abarth": "Compact design with distinctive sporty performance.",
    "2012 FIAT 500 Convertible": "Compact convertible with iconic Italian design and zippy performance.",
    "2012 Ferrari FF Coupe": "Four-seater Ferrari with innovative four-wheel drive system.",
    "2012 Ferrari California Convertible": "Retractable hardtop, high-performance, elegant Italian design.",
    "2012 Ferrari 458 Italia Convertible": "Mid-engine layout with retractable hardtop and distinctive aerodynamics.",
    "2012 Ferrari 458 Italia Coupe": "Mid-engine design, aerodynamic styling, superior speed and handling.",
    "2012 Fisker Karma Sedan": "Eco-friendly luxury sedan with distinctive solar roof, hybrid technology.",
    "2012 Ford F-450 Super Duty Crew Cab": "High-capacity towing, crew comfort, robust chassis design.",
    "2007 Ford Mustang Convertible": "Retro-styled convertible with a powerful V8 engine.",
    "2007 Ford Freestar Minivan": "Versatile spaciousness with distinctive minivan-style sliding doors",
    "2009 Ford Expedition EL SUV": "Extended length, spacious cabin, off-road capability.",
    "2012 Ford Edge SUV": "Midsize crossover integrating versatility, comfort and advanced technology.",
    "2011 Ford Ranger SuperCab": "Compact pickup with unique extended cab and rugged off-road capabilities.",
    "2006 Ford GT Coupe": "Mid-engine two-seater sports car with retro-modern design features.",
    "2012 Ford F-150 Regular Cab": "Two-door, full-sized pickup with spacious cargo bed.",
    "2007 Ford F-150 Regular Cab": "Full-size pickup with versatile bed and off-road capabilities.",
    "2007 Ford Focus Sedan": "Compact, fuel-efficient, noted for smooth handling and durability.",
    "2012 Ford E-Series Wagon Van": "Extended-capacity, commercial-styled passenger van for large groups.",
    "2012 Ford Fiesta Sedan": "Compact sedan with exceptional fuel efficiency and sporty aesthetics.",
    "2012 GMC Terrain SUV": "Compact yet robust design with superior fuel efficiency.",
    "2012 GMC Savana Van": "Spacious, utilitarian design offering high passenger and cargo capacity.",
    "2012 GMC Yukon Hybrid SUV": "Environment-friendly hybrid SUV with spacious cargo, powerful towing capacity.",
    "2012 GMC Acadia SUV": "Three-rows spacious SUV with advanced safety features.",
    "2012 GMC Canyon Extended Cab": "Compact truck, extended cab, rugged build, off-road versatility.",
    "1993 Geo Metro Convertible": "Compact, economical, convertible with exceptional fuel efficiency.",
    "2010 HUMMER H3T Crew Cab": "Off-road SUV with truck-styled frame and spacious crew cab.",
    "2009 HUMMER H2 SUT Crew Cab": "Robust truck-based SUV with versatile pick-up truck bed.",
    "2012 Honda Odyssey Minivan": "Spacious interior, sliding doors, family-friendly versatility.",
    "2007 Honda Odyssey Minivan": "Spacious multi-purpose family minivan with sliding side doors.",
    "2012 Honda Accord Coupe": "Sporty two-door design with advanced fuel efficiency.",
    "2012 Honda Accord Sedan": "Sporty elegance with spacious, comfortable interior and smooth performance.",
    "2012 Hyundai Veloster Hatchback": "Unique three-door design with sporty, compact hatchback structure.",
    "2012 Hyundai Santa Fe SUV": "Compact crossover SUV with robust off-road capabilities.",
    "2012 Hyundai Tucson SUV": "Compact SUV with impressive fuel efficiency and advanced safety features.",
    "2012 Hyundai Veracruz SUV": "Mid-sized SUV, known for its spacious three-row seating design",
    "2012 Hyundai Sonata Hybrid Sedan": "Hybrid efficiency meets sleek sedan design.",
    "2007 Hyundai Elantra Sedan": "Compact design with exceptional fuel efficiency and powerful performance.",
    "2012 Hyundai Accent Sedan": "Compact Sedan with High-Efficiency, Economical Fuel Consumption",
    "2012 Hyundai Genesis Sedan": "Luxurious midsize sedan with potent V8 engine performance.",
    "2012 Hyundai Sonata Sedan": "Sleek design with efficient fuel economy and advanced safety features.",
    "2012 Hyundai Elantra Touring Hatchback": "Compact hatchback with ample cargo space and superior fuel efficiency.",
    "2012 Hyundai Azera Sedan": "Luxurious interior, V6 engine, and high-end tech features.",
    "2012 Infiniti G Coupe IPL": "High-performance luxury coupe with unique aerodynamic styling.",
    "2011 Infiniti QX56 SUV": "Upper-class spaciousness, imposing exterior, robust all-road capability.",
    "2008 Isuzu Ascender SUV": "Spacious interior and exceptional towing capacity in a compact design.",
    "2012 Jaguar XK XKR": "Enhanced sport performance with luxurious sleek design.",
    "2012 Jeep Patriot SUV": "Compact SUV with Jeep's famed off-road capability.",
    "2012 Jeep Wrangler SUV": "Rugged off-road vehicle with iconic removable top.",
    "2012 Jeep Liberty SUV": "Compact yet robust off-road capability with classic boxy design.",
    "2012 Jeep Grand Cherokee SUV": "Rugged exterior, powerful performance with luxury interiors.",
    "2012 Jeep Compass SUV": "Sleek compact design meets off-road capability in this SUV.",
    "2008 Lamborghini Reventon Coupe": "Stealth fighter-inspired design with extreme performance abilities.",
    "2012 Lamborghini Aventador Coupe": "Iconic scissor doors, supercar speed, sharp Italian design.",
    "2012 Lamborghini Gallardo LP 570-4 Superleggera": "Lightweight enhanced performance; distinct aerodynamic design.",
    "2001 Lamborghini Diablo Coupe": "Iconic Scissor doors with aggressively aerodynamic body shape.",
    "2012 Land Rover Range Rover SUV": "Iconic design, premium off-road luxury SUV.",
    "2012 Land Rover LR2 SUV": "Compact luxury SUV with robust off-road capability.",
    "2011 Lincoln Town Car Sedan": "Spacious luxury sedan with signature vertical tail lights.",
    "2012 MINI Cooper Roadster Convertible": "Compact, convertible, sporty two-seater with distinctive British flair.",
    "2012 Maybach Landaulet Convertible": "Luxury convertible with unique semi-open rooftop design, epitomizing opulence.",
    "2011 Mazda Tribute SUV": "Compact SUV with emphasis on utility and off-road capabilities.",
    "2012 McLaren MP4-12C Coupe": "Lightweight carbon-fiber structure with unique dihedral doors design.",
    "1993 Mercedes-Benz 300-Class Convertible": "Elegant convertible design, embodying classic Mercedes luxury.",
    "2012 Mercedes-Benz C-Class Sedan": "Elegant design with high-performance and luxury interior.",
    "2009 Mercedes-Benz SL-Class Coupe": "Retractable hardtop, superior luxury and sports car performance.",
    "2012 Mercedes-Benz E-Class Sedan": "Elegantly styled, performance-enhanced luxury sedan with advanced safety features.",
    "2012 Mercedes-Benz S-Class Sedan": "High-class luxury sedan with advanced safety and premium comforts.",
    "2012 Mercedes-Benz Sprinter Van": "Spacious high-roof design for superior cargo capacity.",
    "2012 Mitsubishi Lancer Sedan": "Sleek design, sporty performance, all-wheel control system.",
    "2012 Nissan Leaf Hatchback": "Compact electric vehicle with distinctive hatchback design, emission-free.",
    "2012 Nissan NV Passenger Van": "Spacious interior for 12, designed for passenger comfort and safety.",
    "2012 Nissan Juke Hatchback": "Compact crossover with unique bulbous design, sporty performance.",
    "1998 Nissan 240SX Coupe": "Compact sports coupe with rear-wheel drive and sporty performance.",
    "1999 Plymouth Neon Coupe": "Compact, sporty design with unique round headlights and high fuel efficiency.",
    "2012 Porsche Panamera Sedan": "Sporty luxury sedan with distinctive rear hatch and high performance.",
    "2012 Ram C/V Cargo Van Minivan": "Spacious cargo area, designed for business utility.",
    "2012 Rolls-Royce Phantom Drophead Coupe Convertible": "Luxury convertible with signature suicide doors and premium craftsmanship.",
    "2012 Rolls-Royce Ghost Sedan": "Elegant hand-crafted design meets unrivaled luxury performance.",
    "2012 Rolls-Royce Phantom Sedan": "Iconic grille design complements its luxurious, high-performance spirit.",
    "2012 Scion xD Hatchback": "Compact hatchback with distinctive boxy design, offering great fuel-efficiency.",
    "2009 Spyker C8 Convertible": "Hand-crafted aviation-inspired luxury two-door convertible sports car.",
    "2009 Spyker C8 Coupe": "Handcrafted, aerodynamic design with aviation-inspired luxury interior.",
    "2007 Suzuki Aerio Sedan": "Compact sedan with aerodynamic design and advanced safety features.",
    "2012 Suzuki Kizashi Sedan": "Sporty design with all-wheel-drive functionality in compact sedan form.",
    "2012 Suzuki SX4 Hatchback": "Compact Hatchback, distinct for utility-focused interior design.",
    "2012 Suzuki SX4 Sedan": "Compact design with advanced all-wheel-drive system and sporty profile.",
    "2012 Tesla Model S Sedan": "Electric luxury sedan with innovative autopilot capabilities.",
    "2012 Toyota Sequoia SUV": "Large, robust design, high ground clearance with excellent off-road capabilities.",
    "2012 Toyota Camry Sedan": "Reliable midsize sedan with superior fuel efficiency.",
    "2012 Toyota Corolla Sedan": "Compact sedan, renowned for reliability and fuel efficiency.",
    "2012 Toyota 4Runner SUV": "Rugged exterior design with off-road capabilities.",
    "2012 Volkswagen Golf Hatchback": "Compact Hatchback Design with Renowned German Efficiency.",
    "1991 Volkswagen Golf Hatchback": "Compact size, German engineering, signature boxy shape.",
    "2012 Volkswagen Beetle Hatchback": "Iconic round shape with modern, compact hatchback functionality.",
    "2012 Volvo C30 Hatchback": "Compact three-door hatchback with distinctive frameless glass hatch.",
    "1993 Volvo 240 Sedan": "Square body, robust design, renowned for durability and safety.",
    "2007 Volvo XC90 SUV": "Rugged luxury SUV with unmatched safety features.",
    "2012 smart fortwo Convertible": "Compact two-seater, convertible top, city-friendly drive."
}