{
    "abbey": "Religious edifice with arches, steeples and often stained glass.",
    "airplane cabin": "Enclosed space featuring rows of seats and overhead compartments.",
    "airport terminal": "Large open space, rows of seats, flight information displays.",
    "alley": "Narrow pathway between buildings often leading to secondary entrances.",
    "amphitheater": "Semi-circular, tiered seating arrangement facing a performance space.",
    "amusement arcade": "A venue featuring coin-operated entertainment machines and games.",
    "amusement park": "Thrilling rides and entertainments, bustling with joyous crowds.",
    "anechoic chamber": "Sound-absorbing, echo-free environment for acoustic testing.",
    "outdoor apartment building": "Open-air environment with residential structures, communal spaces.",
    "indoor apse": "Semi-circular, domed recess typically seen in religious architecture.",
    "aquarium": "Enclosed space showcasing diverse aquatic life in a contained environment.",
    "aqueduct": "Architectural structure facilitating water transport over topography.",
    "arch": "Structured curve forming a passageway or entrance.",
    "archive": "Organized storage of historical documents, artifacts or information.",
    "outdoor arrival gate": "Open-air entry point with signage for transportation termini.",
    "art gallery": "A space filled with displayed artistic works for public viewing.",
    "art school": "Creativity-inspired environment filled with a multitude of art materials.",
    "art studio": "A room filled with art materials, tools and creative artwork.",
    "assembly line": "Sequential production process with automated mechanisms and human operators.",
    "outdoor athletic field": "Open space marked for specific sports activities.",
    "public atrium": "Large, open indoor space dedicated for public gatherings and events.",
    "attic": "A cluttered, enclosed space under the roof of a house.",
    "auditorium": "A large space designed for public performances and gatherings.",
    "auto factory": "Massive machinery assembling automobiles in a systematic process.",
    "badlands": "Steep, eroded terrains with minimal vegetation, resembling desolate moonscape.",
    "indoor badminton court": "Enclosed space with net-centered court for badminton gameplay.",
    "baggage claim": "Conveyor belts delivering luggage in an airport setting.",
    "shop bakery": "Display of baked goods, bread-making equipment, distinct bakery aroma.",
    "exterior balcony": "Outdoor space elevated above ground, accessible from inside.",
    "interior balcony": "A balcony indoors, overlooking an interior space, often multileveled.",
    "ball pit": "Filled with numerous spheres for recreational jumping and play.",
    "ballroom": "Large space for dancing with ornate decor and chandeliers.",
    "bamboo forest": "Dense vertical growth of tall, slender bamboo stalks.",
    "banquet hall": "Large space equipped with tables, chairs, for social gatherings.",
    "bar": "Display of liquor bottles, people socializing, ambient lighting.",
    "barn": "Rural structure housing livestock or storing crops.",
    "barndoor": "Large, sliding wooden doors typically found on rural barns.",
    "baseball field": "Diamond-shaped playing field with bases and pitcher's mound.",
    "basement": "Underground area commonly used for storage or living space.",
    "basilica": "Large, central nave with aisles and semicircular apse; religious.",
    "outdoor basketball court": "Open area with hard surface, basketball hoops, and boundary lines.",
    "bathroom": "Space designed for personal hygiene activities, featuring sanitary fixtures.",
    "batters box": "Designated area where baseball players prepare and take swings.",
    "bayou": "Marshy water bodies with diverse flora and fauna habitats.",
    "indoor bazaar": "Enclosed space filled with diverse stalls and bustling trade activity.",
    "outdoor bazaar": "Open-air marketplace featuring diverse vendors and bustling activity.",
    "beach": "Coastline with aquatic backdrop, encouraging leisure and relaxation.",
    "beauty salon": "A venue dedicated to personal grooming, supplied with salon furniture.",
    "bedroom": "Space primarily designed for sleeping, often includes a bed.",
    "berth": "Place assigned for sleeping, often enclosed area in transportation.",
    "biology laboratory": "Lab equipment and specimens for studying living organisms.",
    "indoor bistro": "Small, cozy dining space with café style furnishings and ambiance.",
    "boardwalk": "Wooden pathway often above water or vegetated areas.",
    "boat deck": "Open area with visible water body, equipped for maritime navigation.",
    "boathouse": "Structure on water for storing and maintaining boats.",
    "bookstore": "Shelves filled with books, quiet reading environment.",
    "indoor booth": "Enclosed space with promotional or informational display indoors.",
    "botanical garden": "Diverse plant species arranged aesthetically for scientific and educational purpose.",
    "indoor bow window": "Curved window design protruding indoors, offering panoramic views.",
    "outdoor bow window": "Exterior curved window extending beyond building facade.",
    "bowling alley": "Lane-lined venue designed for pin bowling activity.",
    "boxing ring": "Square enclosure for boxing matches with roped boundaries.",
    "indoor brewery": "Large vessels for brewing amidst indoor, industrial setting.",
    "bridge": "A structure enabling passage over physical obstacles like water, road.",
    "building facade": "Architectural front view with windows, doors, and design elements.",
    "bullring": "A circular arena for bullfighting events.",
    "burial chamber": "Underground room designated for deposition of human remains.",
    "bus interior": "Seats lined in rows facing forward, handles and standing space.",
    "butchers shop": "Display of raw meats and butcher's tools, denotes food preparation.",
    "butte": "Isolated hill with steep, vertical sides and a flat top.",
    "outdoor cabin": "Rustic structure in nature offering shelter and solitude.",
    "cafeteria": "Area designated for food preparation and communal eating.",
    "campsite": "Tents or RVs set up in natural surroundings for temporary stay.",
    "campus": "Education buildings clustered, youthful atmosphere and lush greenery.",
    "natural canal": "Water channel naturally formed, often surrounded by diverse flora.",
    "urban canal": "Man-made waterway traversing through a cityscape.",
    "candy store": "A scene filled with assorted sweets and confectionery displays.",
    "canyon": "Steep-sided, deep valley with a distinct narrow bottom.",
    "backseat car interior": "Car seats and interiors viewed from backseat perspective.",
    "frontseat car interior": "Dashboard and steering wheel in confined cabin setting.",
    "carrousel": "Rotating platform with seats, often depicting animals, for entertainment.",
    "indoor casino": "Gaming tables, machines, dealers, and crowd under artificial lighting.",
    "castle": "Large, fortified building symbolizing royalty and historical significance.",
    "catacomb": "Underground burial chambers with narrow tunnels and ornate tombs.",
    "indoor cathedral": "Grand architecture with religious symbols, high ceilings and arches.",
    "outdoor cathedral": "Open-air, religious structure integrating natural landscape features.",
    "indoor cavern": "Enclosed space mimicking natural caves, with artificial formations.",
    "cemetery": "Gravestones arrangement amongst serene, lush landscaping denoting final resting place.",
    "chalet": "Wooden, slope-roofed dwelling often found in mountain regions.",
    "cheese factory": "Industrial setting with machinery for cheese production and aging.",
    "chemistry lab": "Scientific equipment-filled space for conducting chemical experiments.",
    "indoor chicken coop": "Enclosed space for housing poultry, typically featuring roosting bars.",
    "outdoor chicken coop": "Enclosed structure with mesh, housing chickens in outdoor setting.",
    "childs room": "Filled with toys, educational materials, and kid-friendly furniture.",
    "indoor church": "Religious artifacts within enclosed, architecturally ornate space.",
    "outdoor church": "Religious gathering in an open, natural enclosure with spiritual elements.",
    "classroom": "Space filled with desks and educational tools fostering learning.",
    "clean room": "Highly organized space, emphasizing sterility and precision.",
    "cliff": "Steep vertical rock face overlooking expansive lower terrain.",
    "indoor cloister": "Enclosed architecture with columned walkway surrounding open courtyard.",
    "closet": "Enclosed space primarily for storage of clothes and personal items.",
    "clothing store": "Display of diverse attire indicating sale for body adornment.",
    "coast": "Intersection of land and water, characterized by waves and tide.",
    "cockpit": "Control hub with numerous dials and switches for vehicle operation.",
    "coffee shop": "Tables arranged with beverages being prepared and served.",
    "computer room": "Filled with electronic devices for group digital interaction and learning.",
    "conference center": "Large space designed for public speaking events and gatherings.",
    "conference room": "Space designed for gatherings, equipped with seating and presentation tools.",
    "construction site": "Active creation of structures with heavy machinery and materials.",
    "control room": "High-tech equipment for monitoring and controlling operations.",
    "outdoor control tower": "Elevated structure with comprehensive overview for managing outdoor activities.",
    "corn field": "Vast landscape filled with tall, densely planted stalks of corn.",
    "corral": "Enclosed area for confining livestock, typically with wooden fences.",
    "corridor": "Long, narrow space for transit between rooms or buildings.",
    "cottage garden": "Charming disarray of diverse plants, epitomizing casual, natural beauty.",
    "courthouse": "Structure housing legal proceedings with judge's bench and galleries.",
    "courtroom": "Judges, lawyers, defendants, witnesses, in formal judicial setting.",
    "courtyard": "Open area enclosed by buildings or walls, conveying tranquillity.",
    "exterior covered bridge": "Covered bridge structure outdoors connecting two land areas.",
    "creek": "Narrow natural waterway, characteristic for tranquil and lush settings.",
    "crevasse": "Deep, wide cracks typically found in glaciers or ice sheets.",
    "crosswalk": "Pedestrian lines on road facilitating safe transit across streets.",
    "office cubicle": "Partitioned workspace in a larger office for individual use.",
    "dam": "Large structure blocking water flow, often generating power.",
    "delicatessen": "A store showcasing assorted cold cuts and cheeses.",
    "dentists office": "A professional medical space for oral health care services.",
    "sand desert": "Expansive sandy landscape marked by dunes and absence of vegetation.",
    "vegetation desert": "Sparse vegetation scattered across arid, sand-dominated landscape.",
    "indoor diner": "Enclosed space filled with tables, chairs, and food service.",
    "outdoor diner": "Al fresco dining arrangement with elements of nature.",
    "home dinette": "Dining area within home premises, characterized by food-related furnishings.",
    "vehicle dinette": "Combination of transportation and dining spaces features.",
    "dining car": "A mobile, train compartment offering meal service to passengers.",
    "dining room": "A room designated for eating and entertaining guests.",
    "discotheque": "Loud music, dancing people, flashy lights, and DJ booth.",
    "dock": "Waterfront area for securing, loading, and unloading vessels.",
    "outdoor doorway": "Transition point from indoor space to natural environment.",
    "dorm room": "Space optimizing furniture and personal touches in limited space.",
    "driveway": "A path for vehicles leading up to a house or garage.",
    "outdoor driving range": "Open area with delineated zones for practicing golf drives.",
    "drugstore": "Sells medicinal and health-related products; pharmacy presence.",
    "electrical substation": "High-voltage equipment in fenced-off outdoor area.",
    "door elevator": "Enclosed space with vertical movement mechanism for transport.",
    "interior elevator": "Enclosed space with buttons indicating different floor levels.",
    "elevator shaft": "Vertical passage designed for vertical transit of elevators.",
    "engine room": "High-density machinery area dedicated to powering large machines.",
    "indoor escalator": "Moving staircase within enclosed, typically commercial, spaces.",
    "excavation": "Digging activity with heavy machinery in earthy terrain.",
    "indoor factory": "Enclosed space with machinery, organized production lines, industrial processes.",
    "fairway": "Open, manicured grassland designated for golf play.",
    "fastfood restaurant": "Quick service, food-related posters, seating areas, branded counters.",
    "cultivated field": "Organized plant rows on vast land for agricultural purposes.",
    "wild field": "Untamed nature, characterized by sparse human activity or influence.",
    "fire escape": "Outdoor stairwell designed for emergency building evacuation.",
    "fire station": "Emergency vehicles hub, distinctive branded signage, hinged large doors.",
    "indoor firing range": "Enclosed space equipped for firearms practice and training.",
    "fishpond": "Body of water teeming with fish, aquaculture environment.",
    "indoor florist shop": "Enclosed space filled with various potted flowers and related merchandise.",
    "food court": "Variety of food stalls surrounded by communal seating area.",
    "broadleaf forest": "Densely-packed, wide-leaved trees, expressing nature's untamed abundance.",
    "needleleaf forest": "Dense, conical-shaped evergreen trees dominate the scene.",
    "forest path": "Dense vegetation intersected by narrow, winding natural tracks.",
    "forest road": "Pathway surrounded by towering trees and dense vegetation.",
    "formal garden": "Symmetrically arranged, manicured plants in a structured layout.",
    "fountain": "Water flowing or jetting upward in an orchestrated display.",
    "galley": "Long, narrow layout with both sides lined with various objects.",
    "game room": "Filled with gaming equipment for interactive entertainment and leisure.",
    "indoor garage": "Enclosed space housing vehicles, with tools and storage areas.",
    "garbage dump": "A site characterized by massive waste disposal and general disarray.",
    "gas station": "Fuel dispensers, vehicles, and convenience stores in one location.",
    "exterior gazebo": "Open-sided structure, often in gardens for relaxation or entertainment.",
    "indoor general store": "Shelves stocked with various goods in a confined space.",
    "outdoor general store": "Array of outdoor equipment and natural-centric goods on display.",
    "gift shop": "A store filled with diverse novelty items for purchase as presents.",
    "golf course": "Open landscaped area with holes, flags and specialized terrain.",
    "indoor greenhouse": "Enclosed space for controlled plant cultivation indoors.",
    "outdoor greenhouse": "Transparent structure filled with plants for controlled growth.",
    "indoor gymnasium": "Enclosed space equipped with sports and exercise facilities.",
    "indoor hangar": "Enclosed space for storing and maintaining aircrafts indoors.",
    "outdoor hangar": "Open-air structure for storing and maintaining aircraft.",
    "harbor": "Water-based hub with boats, docks, and maritime equipment.",
    "hayfield": "Open landscape densely covered with tall, wild grasses.",
    "heliport": "A designated space for helicopter landings and take-offs.",
    "herb garden": "Clustered collection of varied, fragrant culinary plants.",
    "highway": "Long, straight route path with multiple traveling lanes.",
    "hill": "Elevated terrain with gentle slopes and rounded top.",
    "home office": "Workspace equipped with technology, often in residential setting.",
    "hospital": "Medical equipment and professionals providing healthcare services.",
    "hospital room": "Medical equipment and beds designed for patient care.",
    "hot spring": "Geothermal water source producing steam in a natural setting.",
    "outdoor hot tub": "Steamy water-filled tub designed for relaxation amid outdoor setting.",
    "outdoor hotel": "Open-air lodging merging nature's beauty with modern amenities.",
    "hotel room": "Bedroom-like space equipped for temporary, paid accommodation.",
    "house": "A structure providing human habitation, often with multiple rooms.",
    "outdoor hunting lodge": "Rustic structure, surrounded by wilderness, equipped for wildlife pursuit.",
    "ice cream parlor": "Displays of various frozen desserts with serving counters.",
    "ice floe": "Large floating ice mass in cold, open water bodies.",
    "ice shelf": "Large, floating glacier extending from polar landmass into ocean.",
    "indoor ice skating rink": "Enclosed space with smooth icy surface for sliding with skates.",
    "outdoor ice skating rink": "Open-air rink for ice-based activities with possible natural backdrop.",
    "iceberg": "Giant floating ice mass in open ocean waters.",
    "igloo": "Dome-shaped snow structure, iconic of Inuit culture and cold climates.",
    "industrial area": "Dense concentrations of large-scale manufacturing and distribution facilities.",
    "outdoor inn": "Rustic setting blending man-made structures with natural surroundings.",
    "islet": "Small, isolated landform surrounded by water.",
    "indoor jacuzzi": "Enclosed space featuring water-filled, bubble-generating hot tub.",
    "indoor jail": "Enclosed spaces with bars, highlighting captivity and confinement.",
    "jail cell": "Small confined space with bars, designated for prisoner containment.",
    "jewelry shop": "Display of precious gems and metals, symbolizing wealth and luxury.",
    "kasbah": "Fortified, traditional village with narrow lanes in North Africa.",
    "indoor kennel": "Enclosed space with pet-friendly structures for safe confinement.",
    "outdoor kennel": "Enclosed space outdoors for domestic pets, often with fencing.",
    "kindergarden classroom": "Small-scaled furniture filled with playful educational tools and toys.",
    "kitchen": "Area characterized by appliances for cooking and food preparation.",
    "kitchenette": "Compact cooking area with essential appliances and utensils.",
    "outdoor labyrinth": "Open-air maze structure with complex, winding passages.",
    "natural lake": "Body of freshwater surrounded by land, formed by nature.",
    "landfill": "A site for depositing waste, characterized by mounds of waste material.",
    "landing deck": "Open space specially designed for aircraft landing and takeoff.",
    "laundromat": "Public venue with rows of washers and dryers for self-service.",
    "lecture room": "Space equipped with seats, podium and teaching aids for learning.",
    "indoor library": "Shelves of books in enclosed, quiet, intellectual setting.",
    "outdoor library": "Books and furniture setup in an open-air, natural environment.",
    "outdoor lido deck": "Open-air deck designed for outdoor leisure activities.",
    "lift bridge": "A moveable bridge vertically raised for waterway clearance.",
    "lighthouse": "Tall structure emitting light for navigational assistance at sea.",
    "limousine interior": "Luxurious amenities encapsulated in confined vehicle space.",
    "living room": "A common area featuring furniture for relaxation and socialization.",
    "lobby": "A transitional space connecting different rooms in a building.",
    "lock chamber": "Enclosed compartment facilitating elevation change for watercraft.",
    "locker room": "Space filled with lockers, benches, used for changing clothes.",
    "mansion": "Large, luxurious residence indicative of high social status.",
    "manufactured home": "Portable residential structure with pre-constructed parts.",
    "indoor market": "Enclosed space filled with multiple vendor stalls selling various goods.",
    "outdoor market": "Open-air display of goods, bustling with vendors and buyers.",
    "marsh": "Wetland ecosystem with saturated, waterlogged, often reedy terrain.",
    "martial arts gym": "Space filled with training equipment for different fighting styles.",
    "mausoleum": "A tomb structure housing the dead, often grand and historical.",
    "medina": "Densely packed, narrow alleys; traditional marketplaces in walled town.",
    "water moat": "Circular water channel surrounding sturdy fortifications for protection.",
    "outdoor monastery": "Religious structures amidst open, natural surroundings.",
    "indoor mosque": "Architectural design with Islamic elements and prayer mats arrangement.",
    "outdoor mosque": "Open-air prayer area with Islamic architectural features.",
    "motel": "Temporary accommodation featuring rooms with direct exterior access.",
    "mountain": "Elevated landforms, often rugged, showcasing peak formations.",
    "mountain snowy": "High-altitude terrain covered with frosty, white precipitations.",
    "indoor movie theater": "Large screen, tiered seating, and projection equipment present.",
    "indoor museum": "Exhibition of artifacts under artificial lighting, enclosed spaces.",
    "music store": "A location filled with instruments, albums, and auditory enjoyment.",
    "music studio": "Presence of musical instruments and soundproofing materials.",
    "outdoor nuclear power plant": "Visible reactors with protective structures in open environment.",
    "nursery": "Room filled with baby-focused furniture and accessories for caregiving.",
    "oast house": "Conical-topped structure for drying hops in beer brewing.",
    "outdoor observatory": "Open space for observing, studying and appreciating natural phenomena.",
    "ocean": "Vast body of saltwater, teeming with diverse aquatic life.",
    "office": "Space filled with desks, chairs, and business-related equipment.",
    "office building": "High-rise structures with multiple offices and centralized facilities.",
    "outdoor oil refinery": "Large industrial structures with pipes and smokestacks, processing crude oil.",
    "oilrig": "Industrial structure standing in water for drilling oil.",
    "operating room": "Sterile environment with medical equipment for surgical procedures.",
    "orchard": "Rows of fruit trees in a large, open area for cultivation.",
    "outdoor outhouse": "Portable toilet structure in an open, natural environment.",
    "pagoda": "Elevated, multi-tiered, often circular architecture with eaved roofs.",
    "palace": "Grand architecture symbolising royal or religious importance.",
    "pantry": "A room or closet where food, groceries, and other provisions are stored.",
    "park": "Open space with natural elements, designed for public recreation.",
    "indoor parking garage": "Enclosed structure for vehicle storage with marked spaces.",
    "outdoor parking garage": "Open-air structure for vehicle storage, marked lanes and spaces.",
    "parking lot": "Area designated for vehicles, marked with parking spaces.",
    "parlor": "A formal, social space often featuring furniture for entertaining guests.",
    "pasture": "Open grassy land often used for grazing animals.",
    "patio": "Outdoor space typically furnished for relaxation or dining.",
    "pavilion": "Covered, open structure typically found in parks or gardens.",
    "pharmacy": "Shelves filled with medicines; staff dispensing medical prescriptions.",
    "phone booth": "Enclosed space for making private, public telephone calls.",
    "physics laboratory": "Scientific equipment dominated space for practical physics experiments.",
    "picnic area": "Outdoor setting with seating, typically used for eating and recreation.",
    "indoor pilothouse": "Interior space with navigational controls for vessel operation.",
    "outdoor planetarium": "Open-air space, celestial bodies projection on an expansive sky.",
    "playground": "A space with play equipment promoting physical activity for children.",
    "playroom": "A space filled with toys and child-friendly furniture for play.",
    "plaza": "Open public space for socializing and community activities.",
    "indoor podium": "Elevated central platform inside a room for presentations or speeches.",
    "outdoor podium": "Public speaking platform exposed to outside environment.",
    "pond": "A calm body of water surrounded by nature's tranquility.",
    "establishment poolroom": "Venue infused with cue sports focus, sociable ambiance, and professional equipment.",
    "home poolroom": "Indoor space with pool table, cues, pool balls arrangement.",
    "outdoor power plant": "Large machinery in open area generating energy.",
    "promenade deck": "Open-air leisure space on a ship, usually with seating.",
    "indoor pub": "Indoor setting, bartender service, crowded with patrons socializing.",
    "pulpit": "Raised platform for public speaking in religious ceremonies.",
    "putting green": "Grassed area designed for practicing short-distance golf shots.",
    "racecourse": "A circuit track designed for horse racing events.",
    "raceway": "Circuit tracks designed for high-speed vehicular racing.",
    "raft": "Floating structure for water navigation, often rudimentary or makeshift.",
    "railroad track": "Parallel steel rails on hard surface for train transportation.",
    "rainforest": "Dense vegetation, diverse wildlife, and high precipitation.",
    "reception": "Area designated for welcoming and guiding visitors or clients.",
    "recreation room": "Space filled with leisurely activities and entertainment equipment.",
    "residential neighborhood": "Houses close together, usually with sidewalks and lawns.",
    "restaurant": "Dining tables, chairs, and food-serving amenities in a hospitable setting.",
    "restaurant kitchen": "Culinary equipment and staff in a busy, food preparation environment.",
    "restaurant patio": "Outdoor dining area with furniture, often attached to restaurant.",
    "rice paddy": "Terraced fields filled with water and cultivated with rice.",
    "riding arena": "Enclosed space for equestrian training and performances.",
    "river": "Continuous flowing water body with surrounding landforms.",
    "rock arch": "Natural arch formation in rocks, visually captivating geological wonder.",
    "rope bridge": "A suspended walkway made from rope, connecting two high points.",
    "ruin": "Decayed structures, indicative of past civilization and abandonment.",
    "runway": "Long, flat stretch specifically designed for aircraft takeoffs/landings.",
    "sandbar": "An exposed ridge of sand submerged in water at high tide.",
    "sandbox": "Play area with loose particles for creativity and recreation.",
    "sauna": "Heated room for perspiration and relaxation, typically wood-lined.",
    "schoolhouse": "Structured learning ambiance marked by desks, blackboards, and educational materials.",
    "sea cliff": "High, steep rock formation borders and overlooks the sea.",
    "server room": "Densely packed with computing hardware and cable networks.",
    "shed": "A small, standalone structure for storage or workspace.",
    "shoe shop": "Array of various footwear displayed for commercial sale.",
    "shopfront": "Displays goods or services, typically behind a glass window.",
    "indoor shopping mall": "Enclosed space with multiple retail stores and centralized control.",
    "shower": "Running water from overhead in a confined space for personal hygiene.",
    "skatepark": "Designed with ramps and rails for skateboarding tricks.",
    "ski lodge": "Mountainous setting featuring wooden cabins, ski equipment, and snow.",
    "ski resort": "Sloping landscapes with snow and facilities for winter sports.",
    "ski slope": "Steep, snow-covered landscape designed for downhill skiing.",
    "sky": "Expansive openness featuring cloud formations and celestial bodies.",
    "skyscraper": "Striking vertical structures towering over surrounding landscapes.",
    "slum": "Densely packed, neglected structures signifying urban poverty.",
    "snowfield": "Vast expanse showcasing pure tranquility, marked by unique crystalline topography.",
    "squash court": "Enclosed area with four walls for playing squash sport.",
    "stable": "A rural setting housing livestock, primarily horses, with hay.",
    "baseball stadium": "Field with diamond layout, surrounded by spectator seats.",
    "football stadium": "Large, open field with goalposts at each end, surrounded by seats.",
    "indoor stage": "Structured space for performances, with lighting and audience area.",
    "staircase": "Ascending or descending structure with steps for foot transit.",
    "street": "Paved pathway with buildings, vehicles, pedestrians and signage.",
    "subway interior": "Enclosed space with rows of seats and overhead handrails.",
    "platform subway station": "Train tracks, waiting areas, and signages indicating directions.",
    "supermarket": "Aisles filled with diverse products for purchase and consumption.",
    "sushi bar": "A bar displaying raw fish atop small portions of vinegared rice.",
    "swamp": "Wetland ecosystem featuring waterlogged soil and dense vegetation.",
    "indoor swimming pool": "Enclosed water body designed for human swimming activities.",
    "outdoor swimming pool": "Open-air pool surrounded by nature for recreational swimming.",
    "indoor synagogue": "Jewish religious symbols, seating arrangement, Torah ark presence.",
    "outdoor synagogue": "Open-air religious setup with Jewish worship symbols and congregation.",
    "television studio": "Equipped with cameras, lights and a broadcasting control room.",
    "east asia temple": "Architectural elegance showcasing religious reverence in an oriental setting.",
    "south asia temple": "Ornate religious architecture with distinctive domes and sculptures.",
    "indoor tennis court": "Enclosed space with tennis equipment and specific court markings.",
    "outdoor tennis court": "Open space with marked boundaries and net for tennis play.",
    "outdoor tent": "Portable shelter structure externally exposed to nature.",
    "indoor procenium theater": "Enclosed stage framed by an arch, traditional theatrical design.",
    "indoor seats theater": "Tiered seating facing a central stage for performances.",
    "thriftshop": "Display of used, diverse goods at discounted prices.",
    "throne room": "Royal setting featuring an imposing seat of power and majesty.",
    "ticket booth": "A place of ticket purchase and collection for event entry.",
    "toll plaza": "Checkpoint for vehicles, typically with multiple lanes and fee collection booths.",
    "topiary garden": "Landscape of elaborately shaped and trimmed plants, reflecting artistry.",
    "tower": "Tall, vertical structure providing panoramic views, reaching skywards.",
    "toyshop": "A packed assortment of playthings in a retail setting.",
    "outdoor track": "Open space with delineating lines for athletic running events.",
    "train railway": "Long metal tracks guiding large, engine-driven public transport.",
    "platform train station": "Rail tracks, benches, passengers, timetable boards in enclosed space.",
    "tree farm": "Ordered rows of young and mature trees for cultivation.",
    "tree house": "Elevated dwelling nestled within or constructed around trees.",
    "trench": "Long, narrow excavation below ground level for protection or conveyance.",
    "coral reef underwater": "Diverse marine life inhabiting rock-like structures underwater.",
    "utility room": "A room housing essential home maintenance appliances and tools.",
    "valley": "Enclosed depression between hills or mountains, traversed by a river.",
    "van interior": "Contained space with seats, storage, and vehicle controls.",
    "vegetable garden": "Area dedicated for cultivating various edible plants.",
    "veranda": "Outdoor extension of a house with open view and relaxing atmosphere.",
    "veterinarians office": "Presence of animals, medical equipment, staff in medical attire.",
    "viaduct": "Long elevated roadway or bridge spanning across valleys or rivers.",
    "videostore": "Shelves displaying diverse movie titles, associated with film rental.",
    "village": "Rural setting with clustered dwellings, often surrounded by nature.",
    "vineyard": "Rows of grapevines sprawling across undulating terrain.",
    "volcano": "Mountain peak featuring eruption with molten lava and released gases.",
    "indoor volleyball court": "Enclosed area with netted partition for ball-based competition.",
    "outdoor volleyball court": "Open space with sand/grass and a central net for sport.",
    "waiting room": "Area filled with seats for temporary occupancy until called upon.",
    "indoor warehouse": "Stacked goods in enclosed, large-space storage area.",
    "water tower": "Tall structure, typically cylindrical, storing and supplying water.",
    "block waterfall": "Multi-step, descending water cascading over a stepped terrain.",
    "fan waterfall": "A cascade of water spreading in a broad, semi-circular formation.",
    "plunge waterfall": "Water cascading vertically from a height into a pool below.",
    "watering hole": "A gathering spot for animals to drink and socialize.",
    "wave": "Dynamic, rhythmic movement of water in ocean or sea.",
    "wet bar": "Area equipped with sink and refrigerator solely for beverage preparation.",
    "wheat field": "Endless rows of tall, swayable stalks under a vast sky.",
    "wind farm": "Multiple towering turbines harnessing wind energy in an open area.",
    "windmill": "Rotating blades harnessing wind for energy production.",
    "barrel storage wine cellar": "Rows of diagonally stacked barrels in a cool underground space.",
    "bottle storage wine cellar": "Rows of various wine bottles in a cool, dimly-lit storage.",
    "indoor wrestling ring": "Enclosed space with padded flooring for wrestling matches.",
    "yard": "Outdoor space typically adjacent to a house, includes vegetation.",
    "youth hostel": "Affordable accommodation providing communal living and interaction spaces."
}