{
    "Apply Eye Makeup": "Manipulation of tools near eyes for aesthetic enhancement.",
    "Apply Lipstick": "Human bringing a solid or liquid object to their lips repeatedly.",
    "Archery": "Precision-based action utilizing a bow and arrow.",
    "Baby Crawling": "Infant locomotion on hands and knees with unsteady movements.",
    "Balance Beam": "Acrobatic maneuver on a narrow, elevated surface.",
    "Band Marching": "Coordinated movement in groups, often with musical instruments.",
    "Baseball Pitch": "Arm swing delivering ball with specific posture and aim.",
    "Basketball": "Bouncing ball action with an aim to shoot into high hoop.",
    "Basketball Dunk": "Execution of a high jump to force basketball into hoop.",
    "Bench Press": "Lying on back, lifting and lowering weighted barbell with arms.",
    "Biking": "Pedaling motion in seated upright position promoting locomotion.",
    "Billiards": "Striking balls with cue on a table, requiring skill and precision.",
    "Blow Dry Hair": "Utilizing a device to apply air for drying and styling hair.",
    "Blowing Candles": "Exhaling breath towards standing, flame-topped objects in celebration.",
    "Body Weight Squats": "Lowering and raising body using leg and hip strength.",
    "Bowling": "Throwing a ball to knock down pins, in lanes.",
    "Boxing Punching Bag": "Swift, forceful arm movements aimed at a stationary object.",
    "Boxing Speed Bag": "Repeated rapid punching towards a small, suspended bag.",
    "Breast Stroke": "Swimming action involving symmetrical arm movements and frog-like kicks.",
    "Brushing Teeth": "Repeated movement near mouth with a small hand-held object.",
    "Clean And Jerk": "Weightlifting move involving a lift to shoulders, then above head.",
    "Cliff Diving": "High-altitude, aquatic plunge with airborne acrobatics.",
    "Cricket Bowling": "Delivery of a cricket ball towards batsman on a cricket field.",
    "Cricket Shot": "Batsman striking ball with a bat in cricket game.",
    "Cutting In Kitchen": "Manual manipulation of tools to reduce food size in kitchen.",
    "Diving": "Submersion in water using specific equipment and techniques.",
    "Drumming": "Rhythmic striking action in pattern with sticks or hands.",
    "Fencing": "Skillful strategic fighting with bladed weapons in defensive posture.",
    "Field Hockey Penalty": "Intentional, forceful obstruction using field hockey instrument.",
    "Floor Gymnastics": "Acrobatic body movements executed on a flat surface.",
    "Frisbee Catch": "Human extends arm and hand to catch airborne disc.",
    "Front Crawl": "Swimming action characterized by alternating arm movements and flutter kick.",
    "Golf Swing": "Precision-coordinated arm motion striking a ball with a club.",
    "Haircut": "Manipulating scissors to alter hair length and shape.",
    "Hammering": "Repeated striking motion using a handheld tool, often forceful.",
    "Hammer Throw": "Swinging heavy object in circular motion before releasing.",
    "Handstand Pushups": "Inverted position, pushing body up with arms on ground.",
    "Handstand Walking": "Upside-down locomotion using hands, requiring balance and strength.",
    "Head Massage": "Manual manipulation on head for relaxation or therapeutic purposes.",
    "High Jump": "Human leaping vertically with significant height and clearance.",
    "Horse Race": "Competitive speed-running involving jockeys on horseback.",
    "Horse Riding": "Human atop horse, coordinating movements for locomotion control.",
    "Hula Hoop": "Rotational motion around the waist using a circular object.",
    "Ice Dancing": "Graceful duo movement on ice with rhythmic music interpretation.",
    "Javelin Throw": "Projectile motion of spear-like object using full body strength.",
    "Juggling Balls": "Simultaneous airborne manipulation of multiple objects.",
    "Jumping Jack": "Repeated vertical leaps with synchronized arm-leg spreading.",
    "Jump Rope": "Repeated leaping over a swung rope for rhythmic aerobic exercise.",
    "Kayaking": "Water-based activity with paddling and horizontal single-person vessel.",
    "Knitting": "Interlocking loops of yarn with needles for fabric creation.",
    "Long Jump": "Propelled horizontal leap from a running start.",
    "Lunges": "Lower body exercise involving a step forward and knee bend.",
    "Military Parade": "Structured formation of armed forces showcasing military discipline.",
    "Mixing": "Combining various components into one unified whole.",
    "Mopping Floor": "Application of force on a tool to clean horizontal surfaces",
    "Nunchucks": "Rapid hand movements wielding dual short-linked sticks.",
    "Parallel Bars": "Two-arm support, symmetrical movements on horizontal bars.",
    "Pizza Tossing": "Hand-throwing circular dough into air, embodying culinary skill.",
    "Playing Cello": "Seated, drawing bow across strings of large, vertically held instrument.",
    "Playing Daf": "Rhythmic hand movements on a circular frame drum.",
    "Playing Dhol": "Rhythmic movement involving hands striking a two-sided drum.",
    "Playing Flute": "Person blowing air into horizontally held cylindrical object.",
    "Playing Guitar": "Strumming strings with rhythmic movements, producing musical notes.",
    "Playing Piano": "Coordinated hand movement on a keyboard producing musical sounds.",
    "Playing Sitar": "Handling stringed instrument, intricate finger movement, musical.",
    "Playing Tabla": "Striking of rhythm-synchronized fingers on two drum-like instruments.",
    "Playing Violin": "Manipulation of strings with bow, displaying musical dexterity.",
    "Pole Vault": "Using pole to leap over bar in track and field event.",
    "Pommel Horse": "Gymnastic exercise involving handles and body swinging movements.",
    "Pull Ups": "Upper body exercise involving lifting oneself up on a bar.",
    "Punch": "A swift, forceful strike with a closed fist, indicating aggression.",
    "Push Ups": "Body lowered and raised using arms, engaging chest and triceps.",
    "Rafting": "Group navigating water bodies using inflatable rafts for recreation.",
    "Rock Climbing Indoor": "Vertical movement on artificial climbing walls using hands and feet.",
    "Rope Climbing": "Vertical movement with hands, feet engaged on a cord-like structure.",
    "Rowing": "Propulsion in water using oars with consistent rhythm.",
    "Salsa Spin": "Rotational dance move involving swift pivoting on one foot.",
    "Shaving Beard": "Manual removal of facial hair using a razor or electric shaver.",
    "Shotput": "Forceful underhand throw with a heavy spherical object.",
    "Skate Boarding": "Balance and movement on a board with wheels.",
    "Skiing": "Downhill movement on snow using skis for speed and balance.",
    "Skijet": "High-speed aquatic maneuver on a water-propelled device.",
    "Sky Diving": "Freefalling from high altitude with parachute for controlled landing.",
    "Soccer Juggling": "Balancing and maneuvering a soccer ball using feet continuously.",
    "Soccer Penalty": "Player shoots ball towards goal, opposed by one goalkeeper.",
    "Still Rings": "Performing strength poses on hanging, circular apparatus.",
    "Sumo Wrestling": "Full-body contact wrestling with aim to force opponent out of circle.",
    "Surfing": "Balancing on waves with a board, symbiosis of skill and nature.",
    "Swing": "Fluid motion utilizing bodily momentum and gravity.",
    "Table Tennis Shot": "Rapid arm swing with a small paddle in hand hitting a ball.",
    "Tai Chi": "Slow, rhythmic movements embodying balance and tranquility.",
    "Tennis Swing": "Racket movement focusing on hitting a tennis ball.",
    "Throw Discus": "Rotational body motion to propel a heavy disc forward.",
    "Trampoline Jumping": "Upward bouncing using elastic surface, high flexibility and coordination required.",
    "Typing": "Manual motion activating specific keys to generate text or symbols.",
    "Uneven Bars": "Gymnastic action involving two horizontal bars at different heights.",
    "Volleyball Spiking": "Leaping upward, one arm swings to forcefully hit airborne ball.",
    "Walking With Dog": "Human tethered to animal, both moving synchronously.",
    "Wall Pushups": "Pushing motion against a wall, using upper body strength.",
    "Writing On Board": "Person standing, using hand to scribe symbols on vertical surface.",
    "Yo Yo": "Reciprocating vertical motion with string-controlled spinning object."
}